{
  "date_str": "2012-12-12",
  "decision_num": 1,
  "title": "Presidential Task Force for Resettlement, Development and Security - Northern Province - Report of the Presidential Task Force - 2009-2012 - \"From Conflict to Stability?",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4837",
  "decision_details": "- contents in the above Report submitted to the Cabinet by Hon. Basil Rajapaksa, Minister of  Economic Development, were noted.  Cabinet observed that an Action Programme has been formulated through a consultative process enlisting the cooperation from line Ministries, Provincial Councils, the Armed Forces, UN Agencies and INGOs.  Many Police Stations have now been re-opened and civil security is looked after by the Police.  Elections to local authorities in the Northern Province were held in July 2011 and 378 Members to 32 Pradeshiya Sabhas in all 5 Districts of the Northern Province were elected.  Provincial Council elections to the Eastern Province were also held.  Already 142,230 families have been resettled in all the Districts of the Northern Province. Some of the projects undertaken in the Northern Province are as follows:\r\n*  \tRestoration of Health Services\t- major hospitals in all the Districts have been renovated.  At present, 161 preventive care institutions and 102 curative care institutions are functioning.  Total expenditure for healthcare services from 2009 to 2011 amounts to Rs.2135 million and an investment of Rs.9254 million has been allocated for ongoing and future projects.\r\n*  \tRevival of the Education Sector - out of the 1020 schools in the twelve educational zones in the Northern Province, 990 schools have been renovated and are functioning.  \r\n *  \tHousing - for successful implementation of resettlement programme 78,144 permanent houses are scheduled to be constructed, out of which 27,983 houses have already been completed.\r\n*  \tRehabilitation of Roads and Railway -  all major highways are being rehabilitated with a total investment of Rs.75,071 million.  In addition, rehabilitation of the Northern Railway Network is underway with assistance in a sum of US $650 million from the Government of India.\r\n*  \tWater Supply and Sanitation -  this work has been given high priority and already Rs.29.9 billion has been invested to improve water supply and sanitation in this Province.  A major water supply and sanitation project to relieve the water problems in Jaffna is underway at a cost of Rs.25 billion.\r\n*  \tRestoration of Electricity -  rehabilitation of the electricity network is underway, covering Vavuniya, Kilinochchi, Chunnakam etc.\r\n*  \tRevival of Agriculture - 90% of the 180,000 acres of  abandoned paddy lands have been brought under cultivation.  Seeds paddy and subsidized fertilizer have been provided.  A production of 212,722 MT of paddy was recorded during this period.\r\n*  \tRehabilitation of Irrigation Network -  a total commitment of Rs.6333.9 million has been made by the Government for the rehabilitation of the entire irrigation network in the Province.\r\n*  \tFisheries Sector - the total fishing fleet has now been increased to 11,225 and the fish production in the Northern Province has risen from 15,250 MT in 2007, up to 48,520 MT in 2011.\r\n*  \tBanking Sector - 20 State and Private Banks are operating in the Northern Region.  Loans amounting to about Rs.4,614 million have been granted to 36,000 beneficiaries under different credit lines by the Central Bank of Sri Lanka up to the end of 2011.\r\n*  \tPrivate Sector Investment - private sector has already begun to move to the regions in the Northern Province.   There are 23 projects approved by the BOI for a total investment of Rs.68,268 million.  In addition, 9 hotel projects consisting of 328 rooms have been approved for construction at an investment of  Rs.2217 million.",
  "key": "2012-12-12-001-4db5"
}