{
  "date_str": "2019-07-23",
  "decision_num": 7,
  "title": "Securing a new salary structure for the Department of Posts",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=9950",
  "decision_details": "- A new salary structure prepared for the Department of Posts had been submitted to the Cabinet prior to this and the Cabinet has referred it for the recommendations of the Special Commission on Reviewing the Salaries of the Public Sector appointed by H.E. the President to make recommendations with regard to the salary anomalies of the entire Public Service including the Railway, Health, Education and Postal Services. The Report submitted by the Commission, includes the recommendations to remove the salary anomalies existing in the Department of Posts, as well as the recommendations with regard to other services and a number of Government Institutions.\n\nAs such, at its meeting held on 2019 02 12, the Cabinet has appointed a Cabinet Sub Committee under the Chairmanship of the Minister of Finance and an Officials' Committee to assist the Sub Committee in order to submit recommendations on the implementation of the recommendations of the said Commission Report, after a technical and financial review in that regard. The said Report is due to be submitted to the Cabinet shortly.\n\nAccordingly, the matters presented by the Minister of Postal Services & Muslim Religious Affairs with regard to the urgent necessity of preparing a new salary structure for the Department of Posts was considered by the Cabinet and since the recommendations of the Special Commission to review the salary structure of the Public Service have been submitted with regard to other services and a number of State institutions as well, the implementation of its recommendations in respect of only the Department of Posts at this juncture is not proper, the Cabinet decided to consider implementation of the recommendations made by the said Commission, pertaining to the Department of Posts on a priority basis, as soon as the recommendations of the Cabinet Sub Committee under the Chairmanship of the Minister of Finance are received pertaining to all recommendations made by the Special Salary Commission.",
  "key": "2019-07-23-007-6d99"
}