{
  "date_str": "2015-02-11",
  "decision_num": 16,
  "title": "Release of Land and  Property in the High Security Zone",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5948",
  "decision_details": "- a large extent of land out of the 11,639 acres which was under the control of the the Security Forces during the period of conflict has been released by now and a land in extent of 6,152 acres continue to be under the control of the Sri Lanka Army and the Sri Lanka Air Force to ensure the security of the Palali area. The proposal made by His Excellency the President in his capacity as the Minister of Defence to release a further 1000 acres from this High Security Zone in stages and to release 220 acres situated in the Grama Niladhari Division of Valalai - J/284 in the Walikamam East Divisional Secretary's Division and to establish a model village to resettle 1022 families displaced due to the conflict was approved by the Cabinet.  Under this programme it is also proposed to provide a block of land in extent of 20 perches each and housing assistance and the model village so established to be provided with a school, preschool, hospital, places of religious observance, community centres and other infrastructure facilities.   Action will be pursued to release the remaining 780 acres expected to be released also for the future resettlement of the persons displaced due to the conflict. \r\n\r\n\tIt was also decided to release the land under the control of the Sri Lanka Air Force situated in Panama in the Eastern Province, except for the 25 acres where some buildings are being constructed, to enable it to be distributed among the landless persons of the area. \r\n\r\n\tIt was further decided to release the buildings in the High Security Zone in close proximity to the President's House in Colombo and also those around Temple Trees, presently under the control of the Security Forces.",
  "key": "2015-02-11-016-bd77"
}