{
  "date_str": "2015-02-25",
  "decision_num": 5,
  "title": "Prevention of further spreading of the Kidney Disease and provision of the welfare of the patients affected and their families",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5964",
  "decision_details": "- It was decided to enhance the composition of the Cabinet Sub?Committee appointed under the Chairmanship of the President at the Cabinet Meeting held on 2015?02?11, in this regard, as follows: \r\n\r\n\t\t*\tMinister of Health and Indigenous Medicine;\r\n\t\t*\tMinister of Finance;\r\n\t\t*\tMinister of Irrigation and Agriculture;\r\n*\tMinister of Urban Development, Water Supply and Drainage;\r\n*\tMinister of Education;\r\n*\tMinister of Social Services, Welfare and Livestock Development;\r\n*\tMinister of Housing and Samurdhi;\r\n*\tMinister of Food Security;\r\n*\tMinister of Public Administration, Provincial Councils, Local Government and Democratic Governance; and\r\n*\tMinister of Mass Media and Parliamentary Affairs.\r\n\r\n\tThe following decisions were also taken in relation to the programme to control the spread of the kidney disease.\r\n\r\n*\tcarrying out more efficiently the treatment of patients and the management activities relevant to the prevention of the disease, Islandwide, to be directed by the Ministry of Health and Indigenous Medicine;\r\n\r\n*\tall welfare activities in respect of the Kidney patients to be done through the Ministry of Social Services, Welfare and Livestock Development;\r\n\r\n*\tthe installation programme of the Reverse Osmosis Water Purification Units conducted in areas where there is a rapid spread of the Kidney disease to be implemented and supervised over by the Ministry of Urban Development, Water Supply and Drainage;\r\n\r\n\r\n*\tthe programme for popularizing of traditional local varieties of paddy required for the production of rice effective in the control of the Kidney disease, to be implemented by the Ministry of Irrigation and Agriculture;\r\n\r\n*\testablishment of a Coordinating Unit at the Presidential  Secretariat to coordinate all related activities of the programme and the appointment of a competent person, especially a person who has  experience in directing activities related to prevention of diseases,  as the Head of the Unit by the Secretary to the President;\r\n\r\n*\tappointment of a Committee comprising of senior officers of the relevant Ministries  and those who have expertise in dealing with these fields to assist the Cabinet Sub-Committee chaired by  H.E. the President.",
  "key": "2015-02-25-005-a9e4"
}