{
  "date_str": "2024-09-02",
  "decision_num": 15,
  "title": "Making necessary provisions to re-call of nominations for protecting the Fundamental Rights of Voters who have been deprived of the Right to Vote and the Election Candidature at the Local Authorities Elections",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12798",
  "decision_details": "- Due to the indefinite postponement of the Local Authorities Election scheduled to be held on 2023‑03‑09, it has appeared that over 900,000 voters whose names have been included in the Register of Electors updated in the year 2024 are likely to be deprived of their right to vote and to be an election candidature at the upcoming Local Authorities Election. In terms of Article 4 of the Constitution, although, every citizen who has attained 18 years of age and whose name has been entered in the Register of Electors being eligible to be a voter, should be able to exercise his franchise, it has been observed that since calling for nominations for the Local Authorities Election to be held in future has been concluded in January 2023, only voters then registered could cast their votes at the election to be conducted on the said nominations. Similarly, subsequent to the passage of the Local Authorities Election (Amendment) Act No. 30 of 2023, it is required to provide the opportunity for 25% of youth representation in the nomination papers submitted for Local Authorities. Nevertheless, due to the fact that nominations have been called in the year 2023 as of now, 25% of mandatory opportunity for the youth community have been prevented. Therefore, the joint proposal made by the Hon. Prime Minister in his capacity as the Minister of Public Administration, Home Affairs, Provincial Councils and Local Government and the Minister of Justice, Prison Affairs and Constitutional Reforms to instruct the Legal Draftsman to prepare a Local Authorities Elections (Special Provisions) Bill incorporating the appropriate provisions in consultation with the Election Commission so as to receive the necessary authority for the said Commission to re-call for nominations called for the Local Authorities Election 2023 and thereafter to call for nominations to conduct the Local Authorities Election based on the Register of Electors in the year 2024 for - \n\n      *\tprotecting the right to vote of the voters whose names have been \tincluded in the Register of Electors but who have been unable to cast \ttheir vote at the upcoming Local Authorities Election;\n\n      *\tprotecting the fundamental right of over 900,000 of voters who are \tyouth whose names are included in the 2024 Register of Electors, \twho are likely to be deprived of their right to come forward to \tcontest as a candidate at the Election;\n\n      *\tprotecting the rights of the youth community that may subjected to \tinjustice due to deprivation of the quota in contesting as a candidate in \tthe Election in terms of the provisions in the Local Authorities Elections \t(Amendment) Act, No.30 of 2023;\n\nwas approved by the Cabinet.",
  "key": "2024-09-02-015-289f"
}