{
  "date_str": "2024-09-09",
  "decision_num": 9,
  "title": "Establishment of a Financial Stability Fund",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12807",
  "decision_details": "- The Central Bank of Sri Lanka has identified the Strengthening the bank resolution framework under the crisis management framework in financial institutions regulated by the Central Bank of Sri Lanka as an urgent priority. A Financial Stability Fund should be established to ensure the achievement of the objectives of resolution and the effective implementation of the resolution measures provided for in the Act, under Section 15 of the Banking (Special Provisions) Act, No.17 of 2023. In terms of the Section 15(2) of the Banking (Special Provisions) Act, No.17 of 2023, the Financial Stability Fund should be managed separately from the other assets of the Central Bank of Sri Lanka and the assets managed by the Central Bank as an independent fund. By 2024-07-31, the Central Bank of Sri Lanka has included the establishment of the Financial Stability Fund using the initial corpus provided by the Ministry of Finance, Economic Stabilization and National Policies and operationalizing the Financial Stability Fund with comprehensive guidelines to ensure an effective resolution framework as an indicative policy action of the 2nd Sub-Programme of the Financial Sector Stability and Reforms Programme. For that purpose, it is expected to obtain a loan of USD 200 million this year under the Financial Sector Stability and Reforms programme funded by the Asian Development Bank. Accordingly, the proposal made by the Hon. President in his capacity as the Minister of Finance, Economic Stabilization and National Policies to establish the Financial Stability Fund with a nominal amount of Rs.1,000 million provided by the Ministry of Finance, Economic Stabilization and National Policies and to gradually build the fund by providing provisions from the Annual Budget subject to the prevailing fiscal constraints, was approved by the Cabinet.",
  "key": "2024-09-09-009-7514"
}