{
  "date_str": "2024-09-09",
  "decision_num": 10,
  "title": "Revision of the Import Duties levied on importation of goods",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12808",
  "decision_details": "- The necessity of taking measures as the following has been identified, upon the requests of the stakeholders of the local industries and the trade sector, to be implemented in principle and presented in time in respect of the Customs Import Duty, CESS Levy, Special Commodity Levy and Ports and Airports Development Levy, which are the types of duties levied on importation of goods to the country.\n\n* \tExemption of certain imported goods which are subject to Special Commodity Levy and to include in the general import tax structure including the Customs Import Duty.\n\n*\tRevision of Customs Import Duty for importation of brown sugar.\n\n* \tRevision of Import Duties on footwear, packaging, electrical equipment,\traw materials of plastic and rubber related industry and intermediate\tgoods under \t225 HS codes based on the recommendations of the \tMinistry of Industry to empower local industries.\n\n* \tReduction of import duties on infants and adult diapers and its raw materials.\n\n* \tIntroducing tax amendments as applicable for minimizing the usage of plastic and recycling in Sri Lanka.\n\n* \tElimination of existing import tax anomalies in respect of the importation of domestic bicycles and accessories industry, printing and printing ink industry, industries for local manufacturing of washing machines and liters and children's ready-made garments.\n\n* \tPromotion of the export of Palmyra and Palmyra products, introduction of new HS Codes National sub-division customs codes to differentiate electrically operated toys and tippili varieties used for the production of local medicine manufacturing purposes and simplification of the procedure for exemption of CESS Levies on importation of raw materials used in the production of local medicines.\n\nThe proposal made by the Hon. President in his capacity as the Minister of Finance, Economic Stabilization and National Policies to take the following steps to implement the import revisions as stated above, was approved by the Cabinet.\n\n*\tIssuance of an Order under the Revenue Conservation Act, No.19 of 1962 and the amendment of the Customs Import Duties.\n\n* \tAmendment of CESS Levy under the Export Development Act, No.40 of 1979.\n\n*\t Imposition of Orders under the Special Commodity Levy Act, No.48 of 2007.\n\n* \tTaking necessary measures concurrently under the Ports and Airports Development Levy Act, No.18 of 2011 and the Imports and Exports (Control) Act, No.1 of 1969, relevant to the tax revisions.",
  "key": "2024-09-09-010-6525"
}