{
  "date_str": "2024-09-13",
  "decision_num": 12,
  "title": "Amending the Proposed Personal Income Tax Structure",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12827",
  "decision_details": "- As a measure to increase the Government tax revenue, a method of taxation on personal income was introduced from 2023‑01‑01 with the annual income tax exemption limit of Rs.1.2 million and the marginal tax rate from 6% to 36%. As a result, although the tax revenue of the Government was increased, the Government initiated discussions with the International Monetary Fund regarding the requests received to the fact that the middle-income earning group, who were more affected by the personal income tax, should receive some relief. The facts that the revenue targets of the Government are being met by the mid 2024 and certain fiscal targets have been over performed, were brought to the attention at those discussions. Accordingly, the proposal made by the Hon. President in his capacity as the Minister of Finance, Economic Stabilization and National Policies to take necessary action to amend the Inland Revenue Act, No.24 of 2017, enabling to pursue action as follows from 2025‑04‑01 and impose legal provisions required for the purpose, was approved by the Cabinet.\n\n*\tMaintaining the Tax free threshold as the same value of Rs. 1.2 million.\n\n*\tIncreasing the first tax bracket of which the taxable income is determined from \tRs. 500,000 to Rs. 720,000.\n\n*\tThereafter, increasing each tax bracket up to the fifth tax bracket by Rs.220,000 each.\n\n*\tMaintaining the existing tax tares ranging from 6% to 36% unchanged.\n\n*\tAccordingly, the impact of the proposed amendments would be as follows:\n\n\n\n\nMonthly Income (Rs.)\nPercentage deducted from the current tax charged\n\n\n\n\n150,000/-\n14%\n\n\n200,000/-\n20%\n\n\n300,000/-\n25%\n\n\n400,000/-\n23%\n\n\n500,000/-\n15%\n\n\n750,000/-\n8%\n\n\n1,000,000/-\n6%",
  "key": "2024-09-13-012-7d92"
}