{
  "date_str": "2025-01-06",
  "decision_num": 5,
  "title": "Time Charter of two Harbour Tugs for the Sri lanka Ports Authority for operations at the Port of Colombo",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12977",
  "decision_details": "- International competitive bids have been invited to procure a 80 Ton Bollard Pull Tug for the Sri Lanka Ports Authority, as per the Cabinet decision dated 2022‑10‑10. 04 bids have been received for the same and the Cabinet Appointed Procurement Committee has recommended to award the bid to the substantially responsive bidder. Meanwhile, owing to the Value Added Tax Act coming into effect from 2024‑01‑01, the procurement cost has increased upon the calculation of the tax value on the relevant procurement cost, and therefore discussions have been held with the recommended supplier to obtain the said tug on credit basis, but upon the expression of his inability, the said procurement process has been terminated. Subsequently, international competitive bids have been invited to obtain two 80 Ton Bollard Pull Tugs on time charter, and 03 bids have been received for the same. Although discussions have been held with the substantially responsive lowest evaluated bidder for the relevant procurement to obtain a price reduction in a manner that is beneficial to the Sri Lanka Ports Authority, no consent has been made to provide a significant price reduction by the said bidder. In the meantime, the management of the Sri Lanka Ports Authority has requested to cancel the above procurement process as the requirement for tugs needs to be reassessed, based on the progress of completion of the construction works of the new terminals at the Colombo Port. Accordingly, taking into account that the construction of the new terminals is scheduled to be completed between mid-2025 and the latter half of the year, Cabinet approved the proposal made by the Minister of Transport, Highways, Ports and Civil Aviation to pursue action as follows:\n* To terminate the procurement process implemented by the Sri Lanka Ports Authority to take on time charter, two 80 Ton Bollard Pull Tugs for the operations carried out by the said Authority.\n* To initiate new procurement activities to obtain two 70 Ton Bollard Pull Twin Azimuth Stern Drive Harbour Tugs on time charter for the new terminal operations scheduled to commence in mid-2025."
}