{
  "key": "2025-01-27-003-1d9d",
  "title": "Entering into Memoranda of Understanding between Sri Lankan Universities and Foreign Universities",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=13003",
  "decision_details": "- The proposals made by the Hon. Prime Minister in her capacity as the Minister of Education, Higher Education and Vocational Education to sign the following Memoranda of Understanding by the Sri Lankan universities and foreign universities aiming to enhance higher educational collaborations with the foreign universities for the purpose of raising Sri Lankan universities in the world ranking indices and for internationalization, was approved by the Cabinet:\n\n* \tMemorandum of Understanding between the University of Sri Jayewardenepura and the Wuhan Sports University of the People's Republic of China with the aim of taking necessary steps to promote, develop and establish educational and research training programmes, jointly organizing workshops and seminars and conducting educational programmes in the areas of mutual interest.\n\n* \tMemorandum of Understanding between the University of Sri Jayewardenepura and the University of Aizu, Japan, with the aim of promoting mutual understanding and cooperation between the two parties in the field of higher education, science and technology, exchange of information related to higher education, scientific research and related activities, exchange of academic staff, researchers and students and promoting joint research activities.\n\n* \tMemorandum of Understanding between the University of Sri Jayewardenepura and the University of Agder of Norway with the aim of developing and promoting joint research, education and training programmes, as well as conducting exchange programmes of students and academic staff, joint workshops and training sessions and exchanging publications.\n\n* \tMemorandum of Understanding between the University of Sri Jayewardenepura and the Deakin University of Australia with the aim of identifying mutually beneficial short-term training programmes and projects.\n\n* \tMemorandum of Understanding between the University of Moratuwa and Linyi University of China with the aim of participating for seminars and academic meetings with the purpose of promoting cooperation in postgraduate programmes based on mutual interests and benefits, exchanging academic information and other information.\n\n* \tMemorandum of Understanding between the University of Peradeniya and the Mahatma Gandhi University of Medical Sciences and Technology of India with the aim of conducting programmes such as exchanging teaching, learning materials and other relevant literature related to research and educational programmes and jointly organizing short-term continuing education programmes, seminars or workshops in the areas of mutual interest.\n\n* \tMemorandum of Understanding between South Eastern University of Sri Lanka and Shandong University of Science and Technology of China with the aim of facilitating the exchange of students, academic staff and researchers for a limited period in the areas of cooperation such as joint research supervision, teaching, training, research and innovation, including undergraduate, postgraduate and doctoral degrees, etc and conducting induction training programmes for probationary lecturers.\n\n\n\n*\tMemorandum of Understanding between the University of Kelaniya and the State University of New York at Cortland of the United States of America with the aim of promoting research collaboration programmes, faculty academic staff and student exchange programmes, study abroad opportunities, clinical experiences, Consultative and cultural programmes, etc.\n\n* \tMemorandum of Understanding between the Open University of Sri Lanka and the Royal Melbourne Institute of Technology of Australia with the aim of collaborating with the graduate and postgraduate degree programmes.\n\n* Memorandum of Understanding between the University of Kelaniya and the National Korea Maritime and Ocean University of the Republic of Korea with the aim of promoting educational and joint research programmes and jointly organizing workshops and seminars.",
  "date_str": "2025-01-27",
  "decision_num": 3
}