{
  "date_str": "2017-12-19",
  "decision_num": 3,
  "title": "Control of Forest Fires in Sri Lanka",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8479",
  "decision_details": "- Forest fires is attributed as one of the major causes for the decline of natural forest cover in the country. There are no natural forest fires in Sri Lanka and it has been observed that all fires that emanate in the forest areas are due to the negligence or deliberate actions of human beings. Cattle owners, specially set fire on the grass lands with the objective of getting tender grass and these fires spread into forest resulting forest fires. Hunters set fire to the forests to hunt animals and the chena cultivators set fire to the forest to clear the land for cultivation. Further, the fire used by the labourers who work on the railway tracks, fires set by some villagers on their lands bordering the forest boundaries and cigarette buttes and matches discarded by the passers-by etc. result in negligent fires and some people set fire to the forest for pleasure as well.   \n\n\tDestruction of flora and fauna and the destruction of their habitats, due to forest fires in the dry zone such as  the exposure of soil and erosion during the subsequent rainy season, the blocking of streams and rivers and siltation of reservoirs reducing their water storage capacity, release of Carbon Dioxide to the atmosphere are several adverse effects that result due to forest fires.  In the year 2016 alone 2,945 hectares of forest lands have been subject to forest fires.  Accordingly, the proposal made by H.E. the President, Maithripala Sirisena in his capacity as the Minister of Mahaweli Development and Environment, with the objective of controlling and preventing forest fires, to implement a series of programmes to cover the whole Island for the establishment of fire belts to prevent the spread of fires, establishment of fire extinguishing emergency responsive units associated with areas where fires occur frequently and including public awareness of the matter, was approved by the Cabinet.",
  "key": "2017-12-19-003-bda2"
}