{
  "date_str": "2017-12-19",
  "decision_num": 25,
  "title": "Resolving the issues relating to Cost of Living and providing Flood and Drought Relief",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8501",
  "decision_details": "- Unexpected weather conditions have affected the food supply in the country and as a result, the prices of food products have escalated. On the other hand, the livelihood of the people has also been hampered due to the floods and drought that occurred in recent times. The Cabinet Sub-Committee on Cost of Living and the Cabinet Committee on Economic Management have held a series of discussions on the measures to be adopted to mitigate this situation. Accordingly, the proposal made by Hon. Ranil Wickremasinghe, the Prime Minister, to take the following measures without any delay,  in accordance with the decisions taken at such discussions, was approved by the Cabinet:\n\ni.\tEstablishment of a 'Family Budget Unit' comprising of the relevant officials to review the supply of essential items at an affordable price for households.\n\nii.\tEstablishment of a Coordinating Committee under the Chairmanship of the Secretary to the Ministry of Finance and Mass Media with the participation of the Secretaries to other relevant Ministries to ensure the successful implementation of the decisions taken by the  Sub-Committee on Cost of Living.\n\niii.\tImplementation of a programme for distributing a Budget Pack of essential food items consisting of rice, lentils, sugar, sprats, onion, potato and canned fish through the supermarkets, Sathosa and the other private shops until the beginning of the Sinhala/Tamil new year season.\n\n\niv.\tFormulating a mechanism to reimburse 50% of the income tax paid by the participating institutions and retail traders and to grant concessional electricity tariff incentives. \n\nv.\tVesting the responsibility with the Secretary to the Ministry of National Policies and Economic Affairs to monitor the relevant activities for expediting the import of coconut kernel.\n\nvi.\tExploring the possibility of  getting the assistance of Australia to establish the quarantine mechanism adopted by Australia when importing coconut kernel in Sri Lanka, as well. \n\nvii.\tPayment of the difference of the compensation agreed to be paid by the National Insurance Trust Fund to the persons affected by floods and the assessment value to be paid to such persons before 31st of December 2017 through the District Secretaries.\n\nviii.\tTaking appropriate measures to provide relief to the farmer families of Kurunegala, Puttalam, Anuradhapura, Polonnaruwa and the Wanni Districts where the cultivation was affected for three or four seasons consecutively due to adverse weather conditions.",
  "key": "2017-12-19-025-4fac"
}