{
  "date_str": "2021-01-25",
  "decision_num": 15,
  "title": "Amendments to the Regulations and Orders made under the Foreign Exchange Act No.12 of 2017",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10900",
  "decision_details": "In terms of the provisions of the Foreign Exchange Act No.12 of 2017, the Minister in charge of the subject of Finance is entrusted the power of promulgating Regulations in order to implement the said Act subject to the Cabinet approval in consultation with the Monetary Board of the Central Bank of Sri Lanka. Accordingly, Regulations No.01 of 2017, Regulations No.02 of 2017 and Regulations No.03 of 2017 have been promulgated and Orders made under Section 8 and Section 31 of the Act have been issued. It has been found necessary to amend the said Regulations and Orders to suit with the present requirements. As such, the proposal made by  Hon. Prime Minister in his capacity as the Minister of Finance to take the following measures in accordance with the provisions of  the Foreign Exchange Act No.12 of 2017, was approved by the Cabinet. \n \n    • to promulgate the following Regulations and submit the same to Parliament for approval.\ni.\tForeign Exchange  (Classes of Capital Transactions Undertaken Outside Sri Lanka by a Person Resident in Sri Lanka) Regulations \tNo.01 of 2021 \nii.\tForeign Exchange  (Classes of Capital Transactions Undertaken in Sri \tLanka by a Person Resident in Sri Lanka) Regulations No.02 of 2021 \niii.\tForeign Exchange  (Remittance of Funds by Emigrants) \tRegulation No.3 of 2021\t\t\n vi.\tForeign Exchange (Classes of Miscellaneous Capital Transactions) Regulations No.4 of 2021\nv.\tForeign Exchange  (Opening and Maintenance of Accounts for the purpose of engaging in Foreign Exchange Transactions) Regulations \tNo.5 of 2021\n\n    • to make Orders in accordance with  Section 8 and Section 31 of the \tsaid Act.",
  "key": "2021-01-25-015-3c77"
}