{
  "date_str": "2017-04-04",
  "decision_num": 1,
  "title": "Improvement of Maritime Rescue Coordination Activities",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7637",
  "decision_details": "- In accordance with the International Conventions embarked upon by Sri Lanka, the establishment of a Maritime Rescue Coordination Centre (MRCC) is absolutely necessary to respond immediately for the search and rescue services of vessels in distress operating in the region to ensure the safety of the vessels engaged in fishing within the Maritime Zone of Sri Lanka to comply with the Convention for International Civil Aviation, the International Convention for the Safety of Life at Sea as well as the law of the Sea Convention,  Presently,  the Merchant Shipping Secretariat is vested with the authority to operate the MRCC and the Secretariat in turn has vested the activities with the Sri Lanka Navy. \n\nIt is proposed to implement a project for the improvement of infrastructure facilities that will enable the MRCC of Sri Lanka to communicate directly with  vessels in distress within the Maritime Zone of Sri Lanka and to offer assistance and respond immediately and the project will be implemented with the collaboration of the Merchant Shipping Secretariat, Sri Lanka Air Force and the Department of Sri Lanka Coast Guard as stakeholders. As per the specifications developed it is planned to establish the main operational centre in Colombo, a secondary operational centre in Hambantota and in addition, to establish seven (07) strategically important sub-stations in Galle, Trincomalee, Point Pedro, Mollikulama, Arugambe, Batticaloa and Kal‑arawa.  Accordingly, the proposal made by Maithripala Sirisena, H.E. the President in his capacity as the Minister of Defence, to commence this project in the year 2017 and complete same within four (04) years, was approved by the Cabinet.",
  "key": "2017-04-04-001-d58b"
}