{
  "date_str": "2017-04-25",
  "decision_num": 5,
  "title": "Improvement of the Bus Service for the promotion of Public Transport",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7667",
  "decision_details": "- A pilot project was conducted from Rajagiriya junction to Ayurveda junction providing a 'dedicated bus priority lane' on the Parliament road from the 12th March 2017 to the 23rd March 2017 with the assistance of the Korean Overseas International Collaboration Agency and the Sri Lankan professional experts in the field and the results of the survey has shown that it is a promising solution towards reducing the road congestion. Since the completion of the proposed project for the Line Railway Transport and electrification of the Rail Transport, with a view to providing a more improved public transport service, will take many more years, the proposal made by Hon. Patali Champika Ranawaka, the Minister of Megapolis and Western Development, to extend further the concept of the 'dedicated bus priority lane', and to take necessary measures to enhance the public transport services to attract the middle class to use public transport services in order to address the road congestion which needs a speedy solution, was approved by the Cabinet.  \n\n*    Implementation of the 'dedicated bus priority lane' in the following road sections during the peak hours:\n\n-      dedicated bus priority lane extended towards Colombo in the Galle Road from Moratuwa to Ratmalana and from Wellawatta bridge up to Kollupitiya;\n\n-      dedicated bus priority lane extended towards Colombo up to Colombo Fort via. Pettah in the Parliament Road from the Parliament Junction to Rajagiriya, Borella, and Maradana;\n\n-    dedicated bus priority lane extended towards Colombo from the Chiththampalam A Gardner Mawatha Air Force Roundabout to Pettah;\n\n-     dedicated bus priority lane extended towards Colombo from Thummulla Junction to Museum Junction;\n\n-    dedicated bus priority lane extended towards Colombo from the Eye Hospital Roundabout to Thummulla Junction.\n\n*    Promote low floor, air conditioned buses through concessionary loan schemes rather than continuing tax concessions for the importation of conventional buses and 3 wheelers.\n\n*    Introduction of a common ticketing system for buses with electronic card payment facilities;\n\n*     Improve facilities for the three wheeler / taxi stops.",
  "key": "2017-04-25-005-4562"
}