{
  "date_str": "2021-05-03",
  "decision_num": 2,
  "title": "Enabling students to obtain first degree qualifications within a minimum period by amending the time schedules of holding the G.C.E. (Ordinary Level) and G.C.E. (Advanced Level) examinations and minimizing the time taken for selecting students to State Universities",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11043",
  "decision_details": "- Since there is a lapse between the releasing of the G.C.E. (O/L) Examination results and the commencement of G.C.E. (A/L) classes and the time taken for selecting students to the State Universities, it has been observed that, at the time of completing school education and university education, students normally reach the age of 19-20 years and 25-26 years, respectively. Due to structural mismatches of these examination systems and the administrative delays associated with the existing technical procedures, the youth have been obliged to spend their time unnecessarily, to complete higher education expeditiously and enter the job market. It has been observed that this situation adversely affect them personally as well as the economic growth of the country as a whole. \n\n\tTherefore, with a view to avoiding this situation in future, the proposal made by the Minister of Education to take action as follows, was approved by the Cabinet. \n\n* \tRestructuring of the curriculum of Grades 10 and 11, so as to limit for a study period of 01 year and 09 months.\n\n* \tConducting the G.C.E. (O/L) Examination in August and the G.C.E. (A/L) Examination in December and reducing the current time of  45 months to 32 months spent for the entire process by releasing the results of each examination within 03 months and providing technical arrangements required for the purpose.\n\n* \tImplementing the selection process of students to universities on z‑Score without waiting for the finalization of the re-scrutinization process of G.C.E. (A/L) Examination results.\n\n*\tProviding opportunity to those students, if any, who have achieved higher results through the re-scrutinization process, to follow the relevant degree programmes by providing them with new z-Scores and implementing the said methodology from the G.C.E. (A/L) 2020 onwards.",
  "key": "2021-05-03-002-20de"
}