{
  "date_str": "2021-05-31",
  "decision_num": 11,
  "title": "Importation of natural organic fertilizer and chelated mineral micro \tnutrient for Maha Season 2021/2022",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11086",
  "decision_details": "- The Government has taken steps to ban the use and import of chemical fertilizers, pesticides and herbicides to promote the use of organic fertilizers in the country. Accordingly, the Ministry of Agriculture has identified the need to take immediate action to supply the required organic fertilizer for the 2021/2022 Maha Season. At present there are 27 domestic organic fertilizer manufacturers licensed by the National Fertilizer Secretariat and considering the production capacity of ten of them, it is possible to supply organic fertilizer locally for 224,000 hectares for the 2021/2022 Maha Season and to manufacture the required organic fertilizer for another 100,000 hectares subsequently to make available of the required facilities for the identified farmers. Therefore, the Cabinet approved the proposal made by the Minister of Agriculture for taking action as follows.\n\n*  Appointing a Special Procurement Committee relating to the procurement of  organic fertilizer, natural minerals and chelated mineral micro nutrient and a Technical Committee comprising of the expertise on the relevant field to assist the Procurement Committee.\n* Import required organic fertilizer and natural mineral through Government Owned Fertilizer Companies for 500,000 hectares of paddy cultivation for Maha Season 2021/2022 following the international competitive bidding procedure and distributing them through the Department of Agrarian Development.\n*  Import the organic fertilizer required to cultivate  600,000 hectares of the other crops through the licensed companies that have permission to import fertilizer adhering to the recommendations of the relevant research institutions and distributing them to the relevant farmers.\n* Import identified specific fertilizers for ornamental plants, cut flower and foliage cultivations through the Import License Method adhering to the recommendations of the research institutes of the relevant crops and distributing them to the relevant farmers.",
  "key": "2021-05-31-011-1c3b"
}