{
  "date_str": "2021-05-10",
  "decision_num": 2,
  "title": "Conservation and Sustainable use of the Muthurajawela Wetland Zone",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11056",
  "decision_details": "- The Wetland eco-system associated with Muthurajawela, which is spread around an area of 6,232 hectares, consisting of the Negombo Lagoon and a Wetland area, supports immensely in preserving the environmental stability of the area and maintaining the socio‑economic well being of the urban population. The Master Plan jointly prepared by the Central Environmental Authority (CEA) and the the Greater Colombo Economic Commission in 1991 in view of protecting this Wetland Zone, has introduced 03 major land use patterns namely, Conservation Zone, Induction Zone and Mixed Urban Zone. Further, an area of 1,285.45 hectares of the zone has been designated by the Department of Wildlife Conservation as the Muthurajawela Sanctuary and another area of 162.1 hectares has been designated by the Central Environmental Authority as an Environmental Protection Area. However, the said eco‑system is now under a threat of extinction due to reasons such as irregular landfills that are still underway, creation of various infrastructure facilities in Wetlands, land acquisition for different purposes, unauthorized occupation of lands and dumping of garbage. Therefore, the joint proposal made by the Hon. Prime Minister in his capacity as the Minister of Urban Development & Housing; the Minister of Wildlife & Forest Conservation and the Minister of Environment to take the following measures to ensure the long term sustainability of the said Wetland and the sustainable use of the said land, was approved by the Cabinet. \n\n* \tPreparation of a Master Plan expeditiously in line with present needs for the conservation and sustainable use of the Muthurajawela Wetland Zone.\n\n* \tAppointment of a Steering Committee and a Working Committee comprising the Heads/agents of the relevant stakeholder institutions for the purpose.\n\n* \tAcquisition of government/private lands as per the provisions of the Urban Development Authority Act, required for the implementation of an appropriate conservation mechanism as recommended by the Steering Committee.\n\n* \tAssigning the responsibility of carrying out the activities pertaining to the sustainable use of the said eco‑system as a low lying area, to the Sri Lanka Land Development Corporation.\n\n* \tDeclaring the land areas that should be conserved as a National Reserve identified under the Master Plan, as a National Reserve under the Fauna and Flora Protection Ordinance.\n\n* \tTaking necessary action to continue the Master Plan prepared by the Steering Committee and declare the Muthurajawela Wetland Zone as a Ramsar Wetland.",
  "key": "2021-05-10-002-b26e"
}