{
  "date_str": "2018-02-27",
  "decision_num": 4,
  "title": "Effective Management of Water Resources in the face of the challenges of Climate Change",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8641",
  "decision_details": "- Sri Lanka has an annual rainfall of more than 2,000 mm which feed nearly 103 rivers that flow into the ocean covering all areas of the country. However, due to the spatial and area changes that occur during  the periods of rainfall, 65% of the land area in the Island is known as the dry zone and this zone is subject to scarcity of water and droughts frequently.  The risk of Sri Lanka being prone to adverse effects of climatic changes have increased and it has been observed that the changes in the rainfall pattern which occur continuously within a short period of time as well, increasing the annual dry weather days during a year have also been observed. \n\nAs a result of the adverse effects of these extreme weather conditions, severe unpredictable disaster situations like floods, landslides and drought affect the agriculture and food security of the country, irrigated water supply, supply of safe drinking water, generation of hydro electricity power and the livelihood of the people, severely.  In order to overcome these challenges, the necessity has arisen for formulating a wide and integrated management framework for the development, conservation and management of water resources. \n\nAccordingly, the proposal made by H.E. the President Maithripala Sirisena, in his capacity as  the Minister of Mahaweli Development and Environment to establish a Presidential Task Force with the Chairmanship of the Secretary to the President inclusive of all relevant institutions, to make recommendations within three (03) months, to establish a comprehensive integrated management mechanism for the proper management of water resources, was approved by the Cabinet.",
  "key": "2018-02-27-004-2041"
}