{
  "date_str": "2018-02-20",
  "decision_num": 12,
  "title": "Amending the Voluntary Social Service Organizations (Registration and Supervision) Act, No.31 of 1980",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8629",
  "decision_details": "- Taking into consideration the timely requirements, it has been proposed to amend the Voluntary Social Service Organizations (Registration and Supervision) Act, No.31 of 1980. Accordingly, the Voluntary Social Service Organizations (Registration and Supervision) Amendment Bill has been prepared, taking into consideration the recommendations made by the Parliamentary Select Committee which studied the operation of the Non‑Governmental Organizations and its impact as well as the views of the relevant stakeholders including the Financial Intelligence Unit of the Central Bank of Sri Lanka. \n\n\tThe objectives of making the proposed amendment are to provide for the registration of all the Non‑Governmental Organizations, to establish the National Secretariat for Non‑Governmental Organizations as a Statutory Body which is the authorized institution for the regulation and supervision of the Non‑Governmental Organizations, to promote the mutual co‑operation between the State and Non‑Governmental Organizations, to recognize the Non‑Governmental Organizations in the effort to fulfill the common development requirements of the country, to strengthen and empower the civil society, to facilitate the effective operation of the Non‑Governmental Organizations and to ensure the transparency and accountability on its Finance, Policies and Management. As such, the proposal made by Hon. Mano Ganesan, the Minister of National Co‑existence, Dialogue and Official Languages, to publish the said Bill in the Government Gazette and to present same thereafter in Parliament, for approval, was approved by the Cabinet.",
  "key": "2018-02-20-012-28d5"
}