{
  "date_str": "2022-10-17",
  "decision_num": 4,
  "title": "Establishment of the 'Jathika Jana Sabha Secretariat' in order to build 'Jana \tSabha' for strengthening the Participatory Democracy",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11749",
  "decision_details": "- It has been observed that, the Representative Democratic System which has been exercising in Sri Lanka does not adequately address the true public issues, the relationship between governing circle and the community of the periphery is drifting apart in this system, public opinions are not sufficiently considered in making policy decisions thereby causing social criticisms and based on the said criticisms, views and protests are being emerged in the society against the representative democracy. Under this circumstance, there is a need for a strong mechanism in an organizational structure that operates with participatory democratic features at the rural level and enables the public officials and the general public to discuss rural issues together, determine development priorities and the rural community to take part in the the decision making process. It will be possible to effectively and efficiently prevent the public distress that may occur through bureaucracy and arbitrary politicization through a mechanism with provisions that enable the community of the periphery to actively raise their opinions for the formulation of public policies and implement those policies with community participation. Accordingly, a concept paper on \"Jana Sabha System\" has been presented in an initiative of the National Movement for Social Justice with an independent institutional structure that can obtain public participation for the formulation of public policies and the successful implementation of those policies. The said concept paper has proposed the establishment of \"Grameeya Jana Sabha\" covering each Grama Niladhari division in the island and the establishment of \"Jathika Jana Sabha\" at the national level. As such, the Cabinet approved the proposal made by the Hon. President to accept the “Jana Sabha System” proposed by the said concept paper by the Government as a basic policy and to establish the “Jathika Jana Sabha Secretariat” as the independent focal institution for the establishment of the “Jana Sabha System”.",
  "key": "2022-10-17-004-0bd4"
}