{
  "date_str": "2013-06-20",
  "decision_num": 12,
  "title": "Report of the Officials’ Committee appointed by the Cabinet of Ministers to conduct a study and make recommendations pertaining to the acquisition of Official Languages Proficiency by Public Officers",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5099",
  "decision_details": "an Officials' Committee headed by the Secretary to the Cabinet and consisting of senior officials which looked into the difficulties encountered by Public Officers in achieving bilingual proficiency (i.e. in Sinhala or Tamil as applicable), in keeping with the Official Languages Policy of the Government, has proposed a number of short term, medium term and long term measures, in consultation with a group of leading academics engaged in language education and other relevant authorities.  After deliberations, Cabinet approved the recommendations specified in the Report. Some of the salient proposals are as follows: (i)\tthe syllabi which were more of an academic nature have now been reformulated in a practical manner to suit the needs of the Public Officers; (ii)\tpreparation of self study packs for new courses; (iii)\tinstead of an ordinary pass in the native language (as a core subject), at G.C.E. (O/L)  which is presently considered as an alternative qualification to evaluate the  second language proficiency of certain higher grade officers, it has now been proposed to accept an ordinary pass in the second  language at G.C.E. (O/L); (iv)\tit has been made mandatory to provide a basic knowledge in the second language at the induction training programme when new recruitments are made to the Public Service;  (v)\ta transfer policy to be formulated to enable public officers to achieve a working knowledge of the second language;  (vi)\tofficers who have already obtained second language proficiency in keeping with the stipulations in Service Minute are to be exempted from the requirement of obtaining the second language proficiency; (vii)\topportunities have been provided for the new recruits to professions like Medicine, Engineering, Veterinary Science etc. as well as certain technical grades, to follow an Official Language Training Course of 150 hours during their induction trainings to complete the official languages proficiency requirement; (viii)\trestructuring of the Translators' Service; (ix)\tgraduate trainees who possess a basic knowledge in Sinhala/Tamil, to be selected to undergo a special training in languages; (x)\tstudents entering Universities to be provided with a basic knowledge of Sinhala and Tamil languages during induction training programmes; (xi)\tto make the requirement of obtaining official languages proficiency  applicable to new recruits to State Corporations, Statutory Boards, State Banks and fully Government Owned Companies  (to be achieved within 05 years from the date of joining); (xii)\tto make it mandatory to possess proficiency in both Sinhala and Tamil languages when recruitments are made to the Public Service from 2019 onwards.",
  "key": "2013-06-20-012-ea83"
}