{
  "date_str": "2018-08-14",
  "decision_num": 5,
  "title": "Amending the Lepers Ordinance of 1901",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=9094",
  "decision_details": "- The proposal made by Hon. Mangala Samaraweera, the Minister of Finance and Mass Media, to enter into an Agreement between Sri Lanka and Oman relating to the avoidance of double taxation and the prevention of fiscal evasion covering the areas pertaining to interest, royalty and profit motivation on shipping services in anticipation of enhancing economic relations and corporation between the two countries, was approved by the Cabinet.The proposal made by Hon. Mangala Samaraweera, the Minister of Finance and Mass Media, to enter into an Agreement between Sri Lanka and Oman relating to the avoidance of double taxation and the prevention of fiscal evasion covering the areas pertaining to interest, royalty and profit motivation on shipping services in anticipation of enhancing economic relations and corporation between the two countries, was approved by the Cabinet. - (Agenda Item No.26)\n\nDuring the  Dutch period, leprosy was called as an infectious disease and  due to the unavailability of any treatment for the disease, leprosy patients were segregated from the other people to prevent the spread of the disease. Under the Leapers Ordinance of 1901, segregation of leprosy patients was made compulsory. With the modern treatments, it was found that leprosy could be fully cured and therefore, segregation of patients from the others was suspended from the year 1983.\n\nEven though recovered from the disease, 31 leprosy patients segregated from others under this Ordinance are still residing at the Hendala and Manthivu Leprosy Hospitals. As such, the proposal made by Hon. (Dr.) Rajitha Senaratne, the Minister of Health, Nutrition and Indigenous Medicine, to amend the Lepers Ordinance of 1901, to provide the necessary facilities enabling the patients to maintain their social relationships, was approved by the Cabinet.",
  "key": "2018-08-14-005-2c03"
}