{
  "date_str": "2019-01-14",
  "decision_num": 2,
  "title": "Entering into 06 Memoranda of Understanding between Sri Lanka and Philippines",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=9423",
  "decision_details": "- Approval of the Cabinet was granted to the proposals submitted for the purpose of entering into 06 Memoranda of Understanding specified below in view of the Bilateral Friendship, Cooperation and Development during the visit of         H. E. the President in Philippines. \n\n\tMemorandum of Understanding (MoU) on Cooperation in the field of Tourism ‑ The proposal made by Hon. John Amarathunga, the Minister of Tourism Development, Wildlife and Christian Religious Affairs, to enter into a bi­lateral Memorandum of Understanding (MoU) in the field of tourism between Sri Lanka and Philippines on improvement of the cooperation in Research & Development, Education and Training, tourism promotion programmes, investments and the other sectors as determined by both parties. \n\n\nImprovement of the cooperation in the field of foreign employment ‑ The proposal made by Hon. Harin Fernando, Minister of Telecommunication, Foreign Employment and Sports, to enter into a Memorandum of Understanding (MoU) between Philippines and Sri Lanka for the improvement of the co‑operation in the fields of welfare and protection of rights of workers, enhancement of productivity, working standards and professional health and security, providing training for migrant workers and certification and legal aid for safeguarding the workers rights between both countries. \t\n\nMemorandum of Understanding (MoU) on Cooperation in the Field of Higher Education ‑ The proposal made by Hon. Rauff Hakeem, the Minister of City Planning, Wate Supply and Higher Education, to enter into a Memorandum of Understanding (MoU) between the Commission on Higher Education of the Republic of the Philippines and the Ministry of City Planning, Water Supply and Higher Education of Sri Lanka with a view to strengthening the cooperation in the field of Higher Education between the two countries. \n\t\nEntering into a Memorandum of Understanding (MoU) covering agriculture and the related fields ‑ \nThe proposal made by Hon. P. Harison, the Minister of Agriculture, Rural Economic Affairs, Livestock Development, Irrigation and Fisheries & Aquatic Resources Development, to enter into a Memorandum of Understanding (MoU) between Philippines and Sri Lanka for the improvement of the cooperation in the fields of crop cultivation, fisheries industry, livestock control and poultry farming, agri‑processing and value addition, distribution and marketing of products.\n \nProviding facilities for the Researchers of the National Agricultural Research System (NARS) to follow foreign Postgraduate Degree Courses ‑ The proposal made by Hon. P. Harison, the Minister of Agriculture, Rural Economic Affairs, Livestock Development, Irrigation and Fisheries & Aquatic Resources Development, to enter into a Memorandum of Understanding (MoU) with the Los Banos University of the Philippines, to provide for the researchers of the NARS with facilities to follow foreign postgraduate degrees. \n\nEnhancement of cooperation between the two countries in the field of defence ‑ The proposal made by H.E. the President Maithripala Sirisena in his capacity as the Minister of Defence, to enter into a Memorandum of Understanding (MoU) between Sri Lanka and Philippines on the enhancement of cooperation in the fields of defence, military education and training, exchange of defence delegations, joint exercises, goodwill visits and conference",
  "key": "2019-01-14-002-f0c4"
}