{
  "date_str": "2017-02-14",
  "decision_num": 11,
  "title": "Identification of Judicial and Legal Causes for minimizing the overcrowding in Prisons and Prison Reform",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7486",
  "decision_details": "- The first Report of the Inter Institutional Task Force appointed to make proposals for the identification of the Judicial and Legal Causes for minimizing the overcrowding in Prisons and Prison Reform, has submitted the following recommendations:-  \n\n*\tThe effective use of the Community Based Correction orders as an alternation of imprisonment. \n\n\n*\tImplementation of the provisions of the Criminal Procedure (Amendment) Act, No.4 of 1995 to it's full potential, which provides an opportunity for payment of the relevant fine in instalments as an alternative to imprisonment when in default of a fine. \n\n*\tImplementation of a Management Information System to prevent the misplacement of case files pertaining to cases where the Magistrate has no jurisdiction but continue to call them until such time that the case is referred to the Attorney General for indictment in the High Court.       \n\n*\tAction to be taken to release persons imprisoned without an indictment on a bond and the supervision of the prison through the visits by the Magistrates, once a month, in accordance with the provisions of the Act.   \n\n*\tAdoption of the police bail system in the case of bailable offences, in accordance with the provisions of the Bail Act, No.30 of 1997. \n\n*\tConsideration of the possibility of commuting the death sentence into a life sentence. \n\n*\tConstruction of new prison buildings and relocation. \n\n*\tCreation of a safe and secure environment for the inmates and the Prison staff. \n\n\tThe joint proposal made by Hon. (Dr.) Wijayadasa Rajapaksa, the Minister of Justice; and Hon. D.M. Swaminathan, the Minister of Prison Reforms, Rehabilitation, Resettlement and Hindu Religious Affairs, to present the above Report to the Parliament, was approved by the Cabinet.",
  "key": "2017-02-14-011-c378"
}