{
  "date_str": "2017-02-28",
  "decision_num": 19,
  "title": "Construction of Yan Oya Left Bank Main Canal on Design and Built Basis",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7540",
  "decision_details": "- The Yan Oya Development Project is one of the major water resources development projects implemented in Sri Lanka in the recent years. This project will result in bringing a number of economic benefits to the people of the Districts of Anuradhapura and Trincomalee. This project,  through the Left Bank Main Canal, will provide water to a cultivable area in extent of 4,190 Ha. coming under the Padaviya scheme and the Yan Oya Anicut scheme inclusive also of the lands which at present face a severe scarcity of water. The Left Bank Main Canal of 18Km in length will have to be designed to be concrete lined with a 05Km length Syphon section, according to the geophysical features of the terrain.   \n\n\tAlthough, it has been observed that it is necessary to get the assistance of contractors of renowned international level expertise in technology for the qualitative design and built construction of the Left Bank Main Canal, if the Open International Competitive Bidding Procedure is to be adopted the time consumed for such procedure will delay the supply of water to the people of the area by one year than the time anticipated. As such, obtaining the services of the China CAMC Engineering Institution, the main contractor of the Yan Oya Reservoir design and built construction is considered as technologically and economically more beneficial and feasible for the design and built construction of the Left Bank Main Canal.  Accordingly, the proposal made by Hon. Vijith Vijayamuni Zoysa, the Minister of Irrigation and Water Resources Management, to call for technological and financial proposals from the China CAMC Engineering Institution for the design and built construction of the Yan Oya Left Bank Main Canal within a period of 24 months, on a contract basis, was approved by the Cabinet.",
  "key": "2017-02-28-019-6b4c"
}