{
  "date_str": "2015-01-21",
  "decision_num": 4,
  "title": "The official visit of the Hon. Minister of Foreign Affairs to India on the 17th and 18th of January 2015 on the invitation extended by the Hon. Minister of Foreign Affairs of India.",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5916",
  "decision_details": "- The Minister of Foreign Affairs informed the Cabinet that during his visit to India he had discussions on a wide range of subjects important to both the countries with H.E. the Prime Minister of India, Hon. Foreign Minister of India, the National Security Advisor of India, Mrs. Srimathi Soniya Gandhi, Leader of the Indian National Congress and H.E (Dr.) Manmohan Singh, the former Prime Minister of India. The Hon. Minister also informed the Cabinet that H.E. the Prime Minister of India conveyed his warm greetings to H.E. the President of Sri Lanka and also stated that with the formation of the new Government, a new Chapter has begun which will strengthen the bilateral relations of the two countries. \r\n\r\n\tThe Hon. Minister further stated that H.E. the Prime Minister of India has extended an invitation to H.E. the President of Sri Lanka to pay an official visit to India and is enthusiastic to accord a warm welcome to H.E. the President of Sri Lanka and also expressed his willingness to pay an official visit to Sri Lanka. The Hon. Minister also stated that this will be the first official visit by an Indian Head of State after 1987. The Hon. Minister also brought to the notice of the Cabinet that, bilateral discussions were held during this visit in respect of the following areas:\r\n\r\n(i)\tRepatriation of the Sri Lankan refugees in Tamil Nadu;\r\n\r\n(ii)\tDevelopment of the Colombo - Kandy railway line with double tracks ;\r\n\r\n(iii)\tConstruction of 4,000 for the plantation sector employees in the Badulla and Nuwara Eliya districts;\r\n\r\n(iv)\tIncrease in the direct number of air traffic and to re-commence the ferry services between Talaimanar and Rameshwaran and Colombo and Tuticorin;\r\n\r\n(v)\tPromotion of trade and investment relations of the two countries; and\r\n\r\n(vi)\tProblems arisen with regard to the fisher folk of the two countries.",
  "key": "2015-01-21-004-7c01"
}