{
  "date_str": "2015-01-21",
  "decision_num": 1,
  "title": "Appointment of Special Commissions to investigate the large scale corruption which had prevailed during the past",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5913",
  "decision_details": "-  The Cabinet discussed at length, the Cabinet Memoranda submitted by the Hon. Prime Minister and the Minister of Power and Energy in this regard.  Accordingly, as per the recommendation of the National Executive Council, approval was granted to establish the \"Anti?Corruption Committee\" comprising of the following members: \r\n\r\n\t(i)\tHon. Ranil Wickremasinghe, Prime Minister  - \t(Chairman)\r\n\r\n\t(ii)\tHon.\tMangala Samaraweera, Minister of Foreign \tAffairs; \r\n\r\n(iii)\tHon.\tPatali Champika Ranawaka, Minister of Power and Energy;  \r\n\r\n(iv)\tHon.\tRauff Hakeem, Minister of Urban Development, Water Supply and Drainage;\r\n\r\n(v)\tHon. R. Sampanthan, Member of Parliament and the Leader of the Tamil National Alliance;\r\n\r\n(vi)\tHon. Anura Kumara Dissanayaka, Member of Parliament and the Leader of the People's Liberation Front (JVP);\r\n\r\n(vii)\tHon. M. A. Sumanthiran, Member of Parliament;\r\n\r\n(viii)\tMr. Sarath Fonseka, Leader of the Democratic Party;\r\n\r\n(ix)\tDr. Jayampathy Wickremaratna;\r\n\r\n(x)\tJ.C. Weliamuna, Attorney?at?Law; and\r\n\r\n(xi)\tMr. Malik Samarawickrema.\r\n\r\n\tApproval was also granted to appoint a Rapid Responsive Committee  comprising of the following members to act according to the instructions of the aforesaid Committee:\r\n\r\n(i)\tHon. Anura Kumara Dissanayaka, Member of Parliament and the Leader of the People's Liberation Front (Co?ordinator);\r\n\r\n(ii)\tGovernment Officials;\r\n\r\n(iii)\tPolice Officers;\r\n\r\n(iv)\tAttorneys?at?Law;\r\n\r\n(v)\tFinance and Audit Experts; and\r\n\r\n(vi)\tOfficers of the Criminal Investigation Department.\r\nAt this meeting, it was also discussed the feasibility of introducing a Special Act, taking into consideration the existing legal framework for anti?corruption and the instances where the provisions provided for are inadequate.  It was also decided to appoint appropriate officers selected within the existing Legislative  Institutional Framework where necessary, to adopt short and long term measures by these Institutions.  It was further decided to focus attention on the following matters.\nProposed Short Term Measures\r\n\r\n(i)\tto investigate into the items brought for distribution during the time of Presidential Election which are lying in storage and to disclose them;\r\n\r\n(ii)\tto investigate into the corrupt acquisition of land, movable and immovable property and to disclose them;\r\n\r\n(iii)\tto investigate into frauds and corruptions relating to the Employees' Provident Fund and stock exchange and to disclose them; and\r\n\r\n(iv)\tto investigate into the assets and liabilities of fraudulent persons who are considered responsible for large scale corruption and take necessary action in that regard.\nProposed Long Term Measures\r\n\r\n(i)\tto investigation into the monies sent out of Sri Lanka fraudulently, taking such monies into custody and to mete out justice to the culprits;\r\n\r\n(ii)\tIntroduction of a Commission with wide powers to investigate into Bribery and Corruption;\r\n\r\n(iii)\tAppointment of a National Procurement Commission for granting approval to all projects;\r\n\r\n(iv)\tPresentation of the National Audit Act;\r\n\r\n(v)\tImplementation of the Anti?Corruption Convention of the United Nations to which Sri Lanka is a signatory. \r\n \r\n\tAttention was drawn to the need for the contribution of a team of eminent experts to investigate into the malpractices that occur in the financial sector and the Hon. Prime Minister informed the Cabinet that the experts of the Financial Intelligent Unit functioning under the Reserve Bank of India and also the experts of this sector affiliated to the International Monitory Institutions including the World Bank have already agreed to provide the expertise required in this regard. \r\n\r\n\t\r\n\r\n\r\n\tApproval was also granted to appoint a committee comprising of the following members to make recommendations for the introduction of a Bill expeditiously with wide provisions for making it compulsory to disclose the sources of undisclosed assets and to provide for the establishment of an Institution  with wide powers to be more effective than the existing instructions.\r\n\r\n\t (i)\tHon. (Dr.) Wijayadasa Rajapaksa,\r\n\t\tMinister of Justice and Labour Relations - (Chairman);\r\n\r\n\t(ii)\tHon. Patali Champika Ranawaka, Minister of Power and \tEnergy;  \r\n\r\n\t(iii)\tHon. Mangala Samaraweera, Minister of Foreign Affairs; and\r\n\r\n(iv)\tHon. Rauff Hakeem, Minister of Urban Development, Water Supply and Drainage.\r\n\r\n\tAll Hon. Ministers were also requested to submit information regarding corruptions that had prevailed in the respective Ministries with evidence available, as far as possible, to the Prime Minister's Office, expeditiously.",
  "key": "2015-01-21-001-4f88"
}