{
  "date_str": "2013-09-12",
  "decision_num": 5,
  "title": "Sri Lankan Delegation to the 9th Regional Women Ministers’ and Parliamentarian’s Conference on Gender Equity and the Post 2015 Development Agenda",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5230",
  "decision_details": "- Sri Lankan delegation headed by Hon. Tissa Karalliyadda, Minister of Child Development and Women’s Affairs and consisting of  three Deputy Ministers had attended the above Conference held in Seoul, South Korea on 15th and 16th of May 2013 which was hosted by the Asian Forum of Parliamentarians on Population and Development (AFPPD) in partnership with the Korean Parliamentary League on Children, Population and Development and Plan Population Federation of Korea with assistance from the United Nations Population Fund (UNFPA) and Japan Trust Fund.  The Conference was attended by 45 delegates representing more than 15 countries in the Asian Pacific Region.  Hon. Tissa Karalliyadda, in his speech, had highlighted the action taken by the Ministry of Child Development and Women’s Affairs and the Government of Sri Lanka and structural arrangements in place to eliminate all forms of violence against women and children, and towards maintaining gender equality in Sri Lanka, and also to provide education, health and employment facilities by the State to all its citizens without any discrimination based on gender, ethnicity, cast or creed.  The participants had appreciated the development goals reached by Sri Lanka, particularly the very high literacy rate and attendance of women in tertiary education, low maternity and infantile death rates, high rate of girls' attendance in primary and secondary education and the high rate of women employed in professional jobs etc. Cabinet of Ministers noted with appreciation, the above information provided by Hon. Tissa Karalliyadda, Minister of Child Development and Women’s Affairs.",
  "key": "2013-09-12-005-5798"
}