{
  "date_str": "2013-09-05",
  "decision_num": 8,
  "title": "State Visit of H.E. the President of Sri Lanka to the Republic of Belarus - 25th to 27th August 2013",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5216",
  "decision_details": "- H.E. the President paid a State Visit to the Republic of Belarus from 25-27 August 2013, at the invitation of the President of the Republic of Belarus and this was the first State Visit to Belarus by a Head of State of Sri Lanka.  Bilateral discussions between the leaders of the two countries had been conducted in an atmosphere of openness, friendship and mutual understanding and the constructive exchange of views were promising for further development and strengthening of bilateral relations as well as issues of mutual interests on the international agenda. Some of the salient outcomes of the above visit are as follows:*    establishment of a Joint Commission on Trade and Economic Cooperation for the development of economic ties between the two countries;*    a delegation from Belarus to visit Sri Lanka with the view to establishing a tractor and agricultural machinery assembling plant for which a partner from Sri Lanka will be identified for a Joint Venture;*    flexible conditions on prices for the import of fertilizer to be worked out;*    cooperation in the fields of dairy production and cattle breeding; *    education particularly in the Science and Medical fields;  *   agreement of cooperation in higher education between the Universities of the two countries; and*    enhanced exports from Belarus to Sri Lanka, for supply to South and South East Asia, taking advantage of the free port system and Free Trade Agreements of Sri Lanka.Memoranda of Understanding/Agreements on the following were signed during    the visit, to further enhance the bilateral relations:    *    Mutual Legal Assistance in Criminal Matters;*    Trade and Economic Cooperation;*    Avoidance of Double Taxation and Prevention of Fiscal Evasion with respect to Taxes on Income; and*    Cooperation in the Field of Tourism.",
  "key": "2013-09-05-008-37d5"
}