{
  "date_str": "2022-01-03",
  "decision_num": 11,
  "title": "Economy 2022 and the Way forward",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11392",
  "decision_details": "- Subsequent to the passage of the Budget - 2022 in Parliament, the implementation of the same has been commenced from 01st of January 2022. The following information pertaining to the External Outlook of the Sri Lankan Economy was brought to notice of the Cabinet by the Minister of Finance with a view to achieving the desired objectives of the Budget.\n\n    • Information on estimated foreign exchange that will flow out of the country in the year 2022, including foreign debt servicing payments and expected import costs of goods and services.\n      \n    • the expected foreign exchange inflows in the year 2022, including export earnings, earnings from tourism industry, remittances by migrant workers, and foreign direct investments.\n\n    • Proposed short term- and medium-term measures to cover the expected foreign exchange deficit.\n\n    • The following reliefs proposed to minimize the economic hardships faced by the people due to the increase in prices of goods and services under the prevailing economic situation.\n\n          (i)\tGranting a monthly allowance of Rs. 5000 for the \tPublic Servants and pensioners from January.\n  \n          (ii)\tTaking action to provide the above concession to \tprivate sector employees as well in consultation with \tprivate sector employers.\n\n          (iii)\tproviding an additional allowance of Rs. 1,000 / - to \tthe Samurdhi beneficiaries entitled the monthly \tallowance of Rs. 3,500/- and giving the same allowance \tto other Samurdhi beneficiaries as well.\n  \n          (iv)\tpayment of an additional amount of Rs. 25/- per 1kg of \tpaddy in addition to the guaranteed price of Rs.50/- \tcurrently being paid per 1kg of paddy, in case of any \treduction in the paddy harvest in the upcoming season.\n  \n          (v)\tbearing the additional amount so paid by the \tGovernment so as not affecting the price of rice in the \tmarket.\n  \n          (vi)\tImplementing a home gardening programme to \tencourage the cultivation of vegetables and fruits \trequired for their self consumption and providing an \tincentive allowance up to a maximum of Rs. 10,000/- \tdepending on the size of the land not more than one \tacre for inputs such as preparing the land, obtaining \tseeds etc. \n  \n          (vii)\tProviding 15kg of wheat flour at a concessionary \tprice of Rs. 80/- per kilogram to a estate sector \temployee's family.\n  \n          (viii)\tfully exempting the all essential food and \tmedicine from \ttax, taking action to protect local farmers and \tproducers whenever necessary.\n  \nThe Cabinet decided to grant its concurrence for the implementation of the arrangement including the above proposals submitted by the Minister of Finance.",
  "key": "2022-01-03-011-84d3"
}