{
  "date_str": "2021-08-23",
  "decision_num": 5,
  "title": "Progress of the Mega Scale Development Projects by the end of Second Quarter  2021",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11212",
  "decision_details": "- The following information pertaining to the Mega Scale Development Projects island wide was brought to the notice of the Cabinet by the Minister of Finance:\n\n*\t319 Mega Scale Development Projects exceeding the total cost of Rs.1000 million are being implemented within the purview of 43 Ministries.\n\n*\tThe total value of those projects which will be implemented up to the year 2030 is approximately Rs.7.1 trillion.\n\n*\tBy now, Rs.1.75 trillion has been incurred and the provision of Rs.745 billion has been allocated for the year 2021.\n\n*\t88 projects are incorporated in the relevant 319 projects which confirm the new development approach of the Government.\n\n*\tThe estimated cost for the purpose is Rs.2.5 trillion and Rs.232 billion has been allocated for the said projects in this year.\n\n*\tAmong the said projects, 'Water for All', 'Development of 100,000 kilometers of Roads', 'Development of 100 Townships', 'Waari Saubhagya' and 'Saubhagya Production Villages' programmes and those which have been launched by the Government to face the COVID 19 pandemic situation are also included.\n\n*\tOnly 55% of the target expenditure has been utilized for the said projects within the first half of the year due to the COVID-19 pandemic situation in the country.\n\nIt was decided by the Cabinet to review the projects which have shown low progress and implement the same on the priority basis enabling to achieve the objectives and targets of these projects and implement the said projects within the close supervision of the Ministry of Develop Co¬ordination and Monitoring enabling to  finalize the activities of the said projects within the due time frame and provide its benefits to the general public.",
  "key": "2021-08-23-005-775e"
}