{
  "date_str": "2012-01-11",
  "decision_num": 2,
  "title": "Consultancy Services to undertake a feasibility study and outline design of elevated Highways from Kirulapone to Kadawatha, from Colombo Fort to Kottawa and from Colombo Fort to Peliyagoda",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4375",
  "decision_details": "- vehicular traffic in the Colombo Metropolitan Area has steadily increased during the recent years due to the accelerated economic and social development in the country. Since it is extremely difficult to widen the existing roads due to massive roadside development that has already taken place, it has been proposed to construct elevated highways on the undermentioned road sections, in order to ease traffic congestion in the Colombo Metropolitan Area and to provide access to Southern Expressway, Outer Circular Highway and Colombo - Katunayake Expressway:     \r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \r\n*\tFrom Kirulapone to Kadawata (approximately 19Km) which will connect Outer Circular Highway at Kadawata and Colombo - Katunayake Expressway at Peliyagoda;\r\n\r\n*\tFrom Colombo Fort to Kottawa (approximately 21Km) which will connect Southern Expressway and Outer Circular Highway at Kottawa; and,\r\n\r\n*\tFrom Colombo Fort to Peliyagoda interchange on Colombo-Katunayake Expressway (approximately 5 km).\r\n\t\t\r\n\tThe proposal made by H.E. the President, in his capacity as the Minister of Ports and Highways, to procure consultancy services for the above feasibility study and to appoint a Cabinet Appointed Procurement Committee and a Technical Evaluation Committee for the purpose, was considered and it was decided that the Engineering Faculties of Local Universities should be requested to undertake the  task of providing consultancy services for the purpose, in the first instance.",
  "key": "2012-01-11-002-12ac"
}