{
  "date_str": "2012-08-08",
  "decision_num": 15,
  "title": "Implementation of the Urgent Development Programme to uplift the living standards of the people affected by the drought",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4656",
  "decision_details": "- Cabinet of Ministers at its Meeting held on 2012?07?11 has already directed the relevant authorities to formulate an urgent  programme to provide relief to the people affected by the drought.  Accordingly, H.E. the President, in his capacity as the Minister of Finance and Planning, briefed the Cabinet of Ministers on the following progress  achieved in this regard: \r\n\r\n*\tProject for the Payment in Cash for the work done - under this project, members of affected families between the ages of 18 and 60 have been engaged in the renovation work pertaining to minor irrigation systems, canals and rural access roads, in their  respective areas and the works are in progress.  Arrangements have been made by the General Treasury to release funds for the purpose to the District Secretaries of Polonnaruwa, Anuradhapura and Puttalam, depending on the needs.\r\n\r\n*\tprovision of Drinking Water - financial provision has been provided to the relevant District Secretaries of 14 Districts by the Ministry of Disaster Management, for the purchase of water tanks and to obtain water bowsers on rental basis to provide drinking water facilities to 66,131 affected families.  \r\n \r\n*\trenovation of Agricultural Wells - work pertaining to dredging and renovation of selected agricultural wells at regional level in the drought affected areas, is in progress.\r\n\r\n*\tdredging of major irrigation reservoirs so as to increase there water retention capacities - under this programme, dredging of Kalawewa and 126 reservoirs / tanks etc. in the vicinity, in the Anuradhapura District is in progress. In the Polonnaruwa District, dredging of  Girithale Tank and 03 reservoirs in the vicinity, is in progress. Dredging of Magalla reservoir in the Kurunegala District commenced on 2012?07?27. Work pertaining to the other reservoirs in the vicinity have also commenced. The work is being attended to by the Department of Irrigation, Mahaweli Authority of Sri Lanka and the Department of  Agrarian Development.\r\n\r\n\r\n\r\n*\tprovision of relief for cultivation purposes for the Maha season 2012 / 2013 - the requirement of seed paddy for distribution in the drought affected areas for the 2012 / 2013 Maha season is about 180,000 bushels and it is intended to allocate financial provision in a sum of Rs. 216 million for the purpose.  \r\n\r\nThis programme is being monitored by a Presidential Task Force comprising of Secretaries to the relevant Ministries and other relevant authorities, and is headed by the Secretary, Ministry of Finance Planning and a progress review on the entire programme is being conducted once in 10 days.",
  "key": "2012-08-08-015-5282"
}