{
  "date_str": "2018-07-03",
  "decision_num": 7,
  "title": "Obtaining  funds required for the implementation  of Northern Province  Sustainable Fisheries Development Project",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8960",
  "decision_details": "- It has been proposed to implement the Northern Province Sustainable Fisheries Development Project to promote investments and livelihood opportunities in the fisheries sector in the Northern Province and thereby sustainably increasing  the production in the Province. Under this project, it has been planned to construct two fishery harbours at Point Pedro and Pesalai; one anchorage at Mandative in Jaffna District; 23 landing sites in Jaffna, Mannar, Mullativu and Kilinochchi Districts. In addition, for the development of aquaculture, a sea cucumber hatchery, a mud crab hatchery and a sea weed tissue culture have been scheduled to be constructed in Mullativu, Mannar and Jaffna respectively. With a view to expanding this project among the local communities of the area and women, it is expected to develop the infrastructure facilities in selected 141 Grama Niladhari Divisions and provide access to credit for the re‑plantation of Kadolana, create awareness of credit facilities, establish three model enterprises in partnership with the private sector to generate employment opportunities and  provide the communities impacted due to the prolonged conflict with psycho‑social trauma support.\n\nA sum of US$ 201.02 million is scheduled to be invested by the Government with the assistance of foreign loans for this Project. Accordingly, the proposal made by the Hon. Ranil Wickremasinghe, the Prime Minister in his capacity as the Minister of National Policies and Economic Affairs, to obtain the foreign loan of US$ 174 million from the Asian Development Bank required for the implementation of this project, was approved by the Cabinet.",
  "key": "2018-07-03-007-28c1"
}