{
  "date_str": "2020-06-10",
  "decision_num": 23,
  "title": "Granting relief for the tourist industry during the post COVID-19 pandemic",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10512",
  "decision_details": "As a redress to minimizing the impact on the tourist industry due to the COVID 19 pandemic conditions and normalizing the industry; approval of the Cabinet of Ministers was granted for implementing a relief programme for institutions and individuals engaged in the tourist industry as follows.\n\n- \tProviding loan facilities on the basis of paying back within a period of 05 years with a 2 year grace period under an interest of 4% for payment of salaries of Rs.20,000/- per head for a period of six months for the staffs of tourist hotels, tour management companies/travel agents registered under the Sri Lanka Tourism Development Authority.\n\n-\tProviding loan facilities for the payment of Rs.15,000/- each for a period of six months serving in the other institutions related to tourism including restaurants, cafeterias, spa and wellness centres registered under the Sri Lanka Tourism Development Authority.\n\n-\tOne-off payment of Rs.20,000/- per tour guide registered under the Sri Lanka Tourism Development Authority to be dispensed by the by Sri Lanka Tourist Development Authority.\n\n-\tOne-off payment of Rs.15,000/- per tourist driver registered under the Sri Lanka Tourism Development Authority to be dispensed by the Sri Lanka Tourist Development Authority.\n\n-\tProviding facilities to pay the electricity and water bills payable from 01st March 2020 to 31st August from 01st September 2020 in 12 equal installments and not to disconnect power or water supply during that period.\n\n-\tExtending the grace period of 06 months given for payment of vehicle leasing installments related to the tourism industry up to 12 months without any delayed charges.",
  "key": "2020-06-10-023-fa35"
}