{
  "date_str": "2020-06-24",
  "decision_num": 3,
  "title": "Relief measures taken by the Ministry of Foreign Relations and the Sri Lanka Missions abroad to address the issues related to vulnerable segments of Overseas Sri Lankans amidst the COVID-19 Global Pandemic",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10522",
  "decision_details": "- Minister of Foreign Affairs presented the following measures taken by the Ministry of Foreign Relations and the Sri Lanka Missions abroad to address the issues related to the vulnerable segments of overseas Sri Lankans amidst the COVID-19 Global Pandemic to the attention of the Cabinet.\n\n* 52,401 Sri Lankans in 117 countries have made requests to be repatriated to Sri Lanka by June 16, 2020. \n\n* The Presidential Secretariat together with the COVID Task Force by now, have facilitated in repatriating to Sri Lanka more than 9,580 Sri Lankans from 38 countries.\n\n*\tFurther, Ten flights have been scheduled from 24th June to 7th July to repatriate Sri Lankans from 10 other countries.\n\n*\tOver Rs. 42.6 million have been disbursed to the Sri Lanka Missions abroad for providing dry rations, basic medicines, protective gears and safe transportation to vulnerable segments in the Middle East and other locations.\n\n*\tSteps have been taken to dispatch 5,000 packs worth Rs. 15.5 million containing dry rations and medicines to Maldives, UAE and Qatar where there is a shortage of goods and difficulty in purchasing dry rations.\n\n* \tDiplomatic representations are made by the Sri Lanka Missions on behalf of the Sri Lankans overseas pertaining to their needs and maintain continuous contact with the said Sri Lankans.\n\n*\tNecessary measures have been taken to provide the required services from the nearest Sri Lankan Diplomatic Missions to the Sri Lankans living in countries where the Sri Lankan Missions are not functioning. \n\n\n*\tMeasures are being taken by the Sri Lankan Diplomatic Missions to identify new markets and increase the demand in existing markets in order to mitigate the economic impact to Sri Lanka of the global pandemic and to revive the economy.",
  "key": "2020-06-24-003-b670"
}