{
  "date_str": "2020-06-24",
  "decision_num": 5,
  "title": "Preparation of an arrangement for the proper distribution of chemical fertilizer among farmers required for other crops excluding paddy",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10524",
  "decision_details": "- The Ministry of Mahaweli, Agriculture, Irrigation and Rural Development has implemented several programmes namely ‘Sawbagye Gewaththa’ and the programme for cultivation of 16 identified field crops within 88,000 hectares so as to avoid the possible inconveniences with regard to the food security due to the restrictive factors imposed on the imports and exports consequent to the COVID - 19 global pandemic situation. Therefore in this context, having informed of the programme expected to be implemented along with the following by the Minister of Mahaweli, Agriculture, Irrigation and Rural Development for the distribution of chemical fertilizer through a rational arrangement without any shortage to the cultivators of other crops except paddy, the Cabinet of Ministers noted the said contents. \n\n* \tEncouraging to use organic fertilizer for the small scale agricultural cultivations including ‘Sawbagye Gewaththa’ while providing an opportunity to buy less than 10 kilograms of chemical fertilizer from the market only if required.\n\n*\tProviding 50% of the required amount of fertilizer ration approved for non‑ paddy crops from the open market while the remaining 50% to be issued through the Agrarian Development Centres.\n\n* \tProviding the chemical fertilizer subsidy required for the vegetable, fruit, and other agricultural cultivations implemented under the supervision of the Department of Agriculture, Provincial Agriculture Departments and the Sri Lanka Mahaweli Authority through the Agrarian Development Centres.\n * Preparation of a methodology to obtain the fertilizer required for the cultivators from the open market based on a receipt issued by the Agricultural Research and Production Assistant when there are no required stocks of fertilizer at the Agrarian Development Centres or when it is apparent to have delays in the required stocks.",
  "key": "2020-06-24-005-1dd5"
}