{
  "date_str": "2020-06-24",
  "decision_num": 7,
  "title": "Tax Relief Measures to Facilitate Post COVID 19 Economic Recovery",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10526",
  "decision_details": "- A simple, transparent and efficient tax system was introduced to all stakeholders in the economy including Small and Medium Entrepreneurs by the Cabinet decision dated 26th of November 2019 on the Note to the Cabinet on 'Economic Revival Initiatives' submitted by His Excellency the President. Since the economy is facing a drastic challenge consequent to the COVID-19 pandemic, it has been an essential factor to implement tax administrative measures by giving sufficient space to commence the business operations of especially the Small and Medium Scale Entrepreneurs to ease their tax burden.\n\nAccordingly, Cabinet approval was granted by its decision dated 2020-06-03 to exempt the penalty relating to all type of taxes during the COVID-19 lockdown period and to re‑commence the collection of the penalty for late payments from July 2020. \n\nApart from that the Cabinet of Ministers approved the proposal submitted by Hon. Prime Minister in his capacity as the Minister of Finance, Economic and Policy Development in regard to providing the following relief measures also to the Small and Medium Scale Entrepreneurs, to amend the legal provisions accordingly and to implement the proposed relief measures with immediate effect until such time the legal provisions are operative. \n\n*\tIf the Commissioner General of Inland Revenue is satisfied that no willful evasion of the payment of tax has been taken place, to waive off the income tax in arrears payable on the assessment issued up to the assessment year 2018 / 2019.\n\n*\tNon‑issuance of additional assessments for the assessment year 2019 / 2020 in regard to the Small and Medium Scale Entrepreneurs who paid tax by submitting income tax reports. \n*\tExtension of the period provided for the submission of the bank guarantee or the non‑refundable cash payment required to be made when submitting an appeal to the Tax Appeals Commission.\n*\tGranting a grace period to settle the taxes that have already been agreed upon with the Department of Inland Revenue in arrears / default. \n*\tSuspending the implementation of the seizure notices issued to the banks until 30th April 2021.\n*\tEnable the payment or / obtaining of tax reports of a particular tax applicable for the period of 01st March 2020 to 30th June 2020, on the 31st December 2020 or prior to that, and to treat that the relevant payment of tax / submission the report was done on the due date.",
  "key": "2020-06-24-007-784e"
}