{
  "date_str": "2020-06-24",
  "decision_num": 8,
  "title": "Approval for the restriction of foreign exchange outflows from the country and to issue orders on the foreign exchange deposit account",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10527",
  "decision_details": "- The Cabinet of Ministers at its meeting held on 01st April 2020 granted approval to temporally suspend certain outward remittances for a period of three (03) months, and accordingly, the relevant Order was issued by the Gazette Notification dated 02nd April 2020 as per the provisions of the section 22 of the Foreign Exchange Act.\n\nFurther, approval of the Cabinet of Ministers was granted at the meeting held on 22nd April 2020 for taking necessary measures to encourage the remittance of foreign currency to the country through Special Deposit Accounts.\n\nIn terms of the said Cabinet decisions, relevant Regulations were issued under sections 22 and 29 of the Foreign Exchange Act, No.12 of 2017 by the Gazette Notifications 02.04.2020 and 08.04.2020 respectively. \n\nFurthermore, the Cabinet of Ministers approved the following proposals submitted by the Hon. Prime Minister in his capacity as the Minister of Finance, Economy and Policy Development for taking measures applicable to the said Orders.\n\n* \tExtending the period of the Gazette Notification relating to the Orders applicable to the restrictions of the outward remittances by another six (06) months from 02nd July 2020.\n\n\n\n*\tIssuance of a new Gazette Notification amending the existing Gazette Notification dated 08.04.2020 relating to the Regulations made under section 29 of the Foreign Exchange Act, No.12 of 2017 in order to address constrains prevailing due to the provisions in the laws applicable to Foreign Exchange Act and Anti-Money laundering and Combating the Financing of Terrorism when implementing the methodologies introduced for encouraging the remittance of foreign exchange into the country through the Special Deposit Account.",
  "key": "2020-06-24-008-2811"
}