{
  "date_str": "2023-11-20",
  "decision_num": 1,
  "title": "Introduction of a Dispute Prevention and Resolution Mechanism to the Public Service",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12259",
  "decision_details": "- Approval of the Cabinet has been granted at the meeting held on 2020‑11‑16 to implement a pilot project on a mechanism for dispute prevention and dispute resolution based on the concepts of social dialogue, conciliation, mediation and arbitration aiming to introduce a mechanism similar to the private sector to resolve disputes in the public service. Accordingly, the relevant pilot project has been implemented in 04 workplaces in the healthcare and transportation sectors, and the technical and financial assistance has been received from the International Labour Organization for that purpose. Under the said pilot project, Pilot workplace forums have been established, and owing to their functioning, it has been confirmed that it enhances cooperation between the relevant parties and paves the way for dispute prevention and dispute resolution. Based on the success achieved by the implementation of the said pilot project, the Cabinet approved the proposal made by the Hon. Prime Minister in his capacity as the Minister of Public Administration, Home Affairs, Provincial Councils and Local Government to proceed as follows:\n\n* \tEstablishment of Workplace Forums in the Government Institutions.\n\n* \tEstablishment of Sectoral Forums consisting of representatives of trade unions and management for sectors of health, transport, ports and shipping, power and Energy, education and other sectors.\n\n* \tEstablishment of the National State Dialogue Forum consisting of representatives of trade unions, relevant ministries/sectoral forums,Director General of Establishments, the Department of Management Services and the Department and \tNational Budget.\n\n* \tEstablishment of 09 Provincial Mediation Boards at provincial level.\n\n* \tEstablishment of a National Arbitration Panel under the Ministry of Public Administration, Home Affairs, Provincial Councils and Local Government.",
  "key": "2023-11-20-001-a49d"
}