{
  "date_str": "2018-04-10",
  "decision_num": 4,
  "title": "Strengthening of  the Primary Healthcare Service",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8773",
  "decision_details": "- Even though there exists around 970 primary level hospitals in Sri Lanka, there is a trend among the general public to bypass this network of hospitals and to move towards the hospitals providing treatments at tertiary level. Owing to this trend, a heavy congestion has been created in such hospitals providing treatments at tertiary level. Besides, the need has arisen to enhance the local Healthcare service due the increase of the elderly population, growth of non‑communicable diseases, dynamic illness patterns etc. As such, a proposal has been made to establish an advanced Health Service System, to enable the general public to have access to those facilities easily by linking the closest hospitals providing specialized treatment services, as forums.  \n\n\tAccordingly, the proposal made by Hon. (Dr.) Rajitha Senaratne, the Minister of Health, Nutrition and Indigenous Medicine, to implement the 'Policy providing Healthcare services with the objective of Universal Health Coverage', prepared inclusive of the following components, was approved by the Cabinet.\n\n*\tto identify one family doctor each to cover per 5,000 of the population and to further strengthen the institutions providing Primary Healthcare services to facilitate the prevention of illnesses;\n\n*\tto provide the Medical Practitioners with the initial training required for carrying out the functions in the field of Family Medicine and for  strengthening the first contact care services;\n\n*\tto ensure that all patients are provided with treatments at the Primary Healthcare Institutions and to encourage to refer those patients to secondary and tertiary hospitals with Specialist Doctors appropriately, in  a timely manner;\n\n*\tto provide a Personal Health Record to every citizen, with a unique heath identification number and to further strengthen the Health Information Management System;\n\n*\tto ensure the attribution and the utilization of human resources in the health sector productively;\n\n*\tto establish a method of obtaining distant assistance from Specialist Doctors to help the doctors providing Primary Healthcare within the relevant forums, in order to enhance their clinical skills.",
  "key": "2018-04-10-004-a190"
}