{
  "date_str": "2023-02-20",
  "decision_num": 9,
  "title": "Conferment of National Honours",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11915",
  "decision_details": "- \tConferring National Honours to evaluate the service rendered through various aspects in Sri Lanka and outside takes place since 1986. As per the Gazette Notification dated 1995‑03‑20, Honours named Sri Lankabhimanya, Desamanya, Desabandu, Vidya Jyothi, Kala Keerthi, Sri Lanka Shikamani, Vidya Nidhi, Kala Shuri, Sri Lanka Thilaka and Veera Prathapa are conferred by the Presidents according to a proper procedure. Further, Sri Lanka Ranjana, Sri Lanka Rathna and Sri Lanka Ramya Honours are conferred to foreigners as per the Gazette Notification dated 1990‑09‑12. Also, in accordance with the Gazette Extraordinary Notification dated 2008‑02‑08, the Sri Lanka Mitra Vibushana Honour is conferred to the Heads of State having cordial relationships with Sri Lanka, in recognition of their cooperation towards the Sri Lankan community. This Honour holds the topmost position in the order of the excellence of the National Honours conferred to non-Sri lankans. At present, there are considerable number of vacancies in those National Honours and the same have to be conferred to the selected individuals following the proper procedure. In addition to said Honours, it has been found appropriate to award Sri Lankans with Vishishta Kaushalyabhimani in order to evaluate the service rendered to the advancement of the fields of art, literature, science and technology and the Vishishta Janaraja Abhimani for the dedication made to the nation and also to grant the topmost rank in the order of excellence of the above mentioned National Honours. Accordingly, the Cabinet concurred with the proposals made by the Hon. President  to select honourees calling applications in keeping with the procedures set out in the relevant Gazette Notifications and to have a Parliament Act passed by making provisions to prevent conferring the National Honours irregularly by other institutions.",
  "key": "2023-02-20-009-96c0"
}