{
  "date_str": "2020-11-16",
  "decision_num": 1,
  "title": "Implementation of the Unique Digital Identity (SL-UDI) Framework and e-NIC Project",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10739",
  "decision_details": "- The Government adopts an Unique Digital Identity Framework and a strategy to facilitate the said framework in order to achieve the goal 'Smart Nation' which is one of the ten key goals of the national policy framework 'Vistas of Prosperity and Splendour'.  Further the said programme has been given priority as a national level programme. The Unique Digital Identity Framework for Sri Lanka has been prepared together with the Information and Communication Technology Agency of Sri Lanka and the Department for the Registration of Persons and implementation of the e-NIC project has been identified as one of the components to be implemented under the said Project. Accordingly, the proposal made by H.E the President to implement the following proposals was approved by the Cabinet.\n\n*\tGranting approval to the Unique Digital Identity Framework for Sri Lanka finalized \tby the Programme Preparation Committee.\n\n*\tAppointment of a Presidential Task Force to provide the necessary guidance to establish the Unique Digital Identity Framework for Sri Lanka.\n\n*\tVesting the responsibility of implementation of the Unique Digital Identity Framework Project for Sri Lanka with the Information and Communication Technology Agency of Sri Lanka.\n\n*\tImplementation of the e-NIC Project together with the Information \tand Communication Technology Agency of Sri Lanka and the Department for the Registration of Persons.\n\n\n*\tMaking required amendments to the Registration of Persons Act No.32 \tof 1968 to facilitate the implementation of Unique Digital Identity Framework for Sri Lanka and the e-NIC Project.\n\n*\tCompletion of the said project by 2022‑12‑31.",
  "key": "2020-11-16-001-e0b6"
}