{
  "date_str": "2020-11-09",
  "decision_num": 7,
  "title": "Supply of necessary scrap metal for the Local Small Scale Industrialists",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10724",
  "decision_details": "- Issues relating to the metal industry had been discussed by the “Inter-Ministerial Task Force on Industry and Enterprise” and the “Presidential Task Force on Economic Revival and Poverty Alleviation” at their meetings. As determined at those discussions, steps have been taken to stop the export of Copper, Aluminium, Stainless Steel, High Carbon Steel, Brass, Cast Iron, Aluminium Ingots and Zinc Ingots with immediate effect, with a view to providing sufficient raw materials for the local metal industrialists. According to a research conducted by the Sri Lanka Industrial Development Board and the University of Moratuwa, it has been proved that there is a high demand for scrap Iron, Cast Iron, Aluminium, Copper and Brass by the local industrialists and the demand for Zinc, Manganese, High Carbon Steel and Stainless Steel is also being increased. \n\nThe demand for Scrap Metal is expected to be increased further in line with policies of the Government pertaining to the promotion of local industries. Therefore, it has been found that it is appropriate to reconsider the current permission that has been given for the export of Copper Wire and to suspend the export of Copper Wire in order to encourage production of more value added products.\n\nAccordingly, the proposal made by the Minister of Industries to use the scrap metal of Iron, Copper, Aluminium, Stainless Steel, High Carbon Steel, Brass , Cast Iron and Aluminium Ingots and Zinc Ingots and Copper Wire only for the local industries and to permit to export the unusable Scrap Metal only on the recommendation of the Sri Lanka Industrial Development Board and the other relevant institutions, was approved by the Cabinet.",
  "key": "2020-11-09-007-2a32"
}