{
  "date_str": "2017-09-12",
  "decision_num": 35,
  "title": "Appropriation Bill for the Financial Year 2018",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8130",
  "decision_details": "- Action has been taken to table the Appropriation Bill for the Financial Year 2018 in Parliament at the end of September 2017. The General Treasury has prepared these Budget Estimates, based on the Government policy priorities, taking into consideration the total resources which may be available for the Medium Term Budgetary Framework 2018 - 2020. Attention has also been drawn to the matters surfaced at the budget discussions with the Line Ministries and the Provincial Councils.  \n\nAccordingly, the total expenditure of the Government for the financial year 2018 has been estimated at Rs.3,982 billion. Authority need to be derived through the proposed Appropriation Bill to incur the expenditure amounting to Rs.1,977 billion from the said total amount, other than the expenditure to be incurred under laws passed by Parliament such as for servicing and repayment of public debt and payment of Widows/Widowers and Orphans Pension etc amounting to Rs.2,005.1 billion for the year 2018, from this Recurrent Expenditure is estimated at Rs.1,308.9 billion and the Capital Expenditure is estimated at Rs.668 billion. Further, the total estimated Government Revenue and the Foreign Grants for the year 2018, is estimated at Rs.2,175 billion and accordingly, Rs.1,813 billion has to be obtained as loans by way of domestic and international resources, including Rs.6 billion for the advanced accounts expenditure of the Government. \n\nThe proposal made by Hon. Mangala Samaraweera, the Minister of Finance and Mass Media, to present the Appropriation Bill for the financial year 2018 including the draft budgetary estimates, for approval in Parliament having published the same in the Government Gazette, was approved by the Cabinet.",
  "key": "2017-09-12-035-1abf"
}