{
  "date_str": "2024-07-22",
  "decision_num": 17,
  "title": "National Agenda for Anti-Corruption",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12698",
  "decision_details": "- When the present Government took over in July 2022, their priority was to restore the fiscal and debt sustainability and transform the economy by improving governance and eliminating corruption. Accordingly, the foundation for the Anti-Corruption Agenda was laid through the enactment of the Anti-Corruption Act, No.9 of 2023 repealing the Bribery Act (Chapter 26), the Commission to Investigate Allegations of Bribery or Corruption Act, No.19 of 1994 and the Declaration of Assets and Liabilities Law No.1 of 1975, in order to enforce the provisions of the United Nations Convention against Corruption and other relevant international norms and practices such as the Financial Action Task Force Standards. Also, currently, the preparation of the Proceeds of Crime Bill is at the final stage. Accordingly, the following measures have been identified as key action items in the Anti-Corruption Agenda in line with the Legal, Organizational and Strategic Frameworks for Anti-Corruption as stated in the International Monetary Fund Governance Diagnostic Technical Assistance Report.\n\n* Enactment of the Anti-Corruption Act, No.9 of 2023\n\n* Developing a National Anti-Corruption Plan for the period 2025-2029\n\n* Amendment of the National Audit Act, No.19 of 2018.\n\n* Establishment of an effective and transparent Asset Declaration and Conflict of Interest Systems.\n\n* Introducing new methodologies to execute the Proceeds of Crime and Money Laundering.\n\n* Strengthening Investigation and Prosecution of Corruption Cases.\n\n* Introducing amendments to the Companies Act, No.07 of 2007 enabling to strengthen the Beneficial Ownership Framework and taking other relevant measures.\n\n* Enactment of a Public Procurement Law to ensure the transparency of the Public Procurement.\n\n* Publishing all the firms receiving tax exemptions under the Strategic Development Projects Act, No.14 of 2008 and through the Board of Investment.\n\n* Temporary suspending the application of the Strategic Development Projects Act, No.14 of 2008, until the promulgation of an explicit and transparent process for the evaluation of proposals and costing of investment promotion conditions.\n\n* Implementing a State-Owned Enterprises Reform Policy.\n\n* Initiation of short-term Anti-corruption measures within each revenue department.\n\n* Establishment of a new management arrangement for the Employee Provident Fund.\n\n* Revision of legislation, regulations and processes relating to financial sector oversight in the banking sector.\n\n* Empowering the Judicial Services Commission.\n\n* Strengthening the Right to Information.\n\r\nAccordingly, the proposal made by the Hon. President to confirm the Anti-Corruption Agenda as the National Agenda of the Government for Anti-Corruption in principle and direct all the relevant authorities to comply with the said Agenda, was approved by the Cabinet.",
  "key": "2024-07-22-017-685f"
}