{
  "date_str": "2020-12-21",
  "decision_num": 10,
  "title": "Protecting the local coconut oil manufacturers and the Sri Lankan coconut oil brand by developing a coconut based industrial system",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10822",
  "decision_details": "- Industrialists and experts in the field of coconut industry have pointed out that if more attention is paid to the coconut industry in Sri Lanka, production can be increased by 50%. Investigations carried out by the Consumer Affairs Authority have confirmed that the coconut oil imported into the country contains nearly 70% of non-coconut oils. Due to the insufficient number of coconuts produced in the country, the continuation of production activities of about 500 factories of coconut and allied products are currently in crisis. As the export income of Sri Lankan coconut oil and coconut related products have increased by 16.6% in 2019 when compared to 2018, it seems that there is a possibility of creating a new trend in the coconut industry with the Government sponsorship.\n\nAccordingly, the following joint proposals submitted by the Minister of Industry and the Minister of Plantation for the development of the coconut related industries were approved by the Cabinet-\n\n*\tImportation of broken copra for a period of three months instead of importing coconut oil, in order to encourage the local coconut oil producers.\n*\tImportation of broken copra with testa by BCC Company, which is a \tstate owned institute.\n\t*\tStrictly prohibition the mixing of palm oil or any other type of oil with \t\tcoconut oil and sell them in order to protect consumer rights and Sri \t\tLankan brand for coconut oil.\n*\tRecognizing that discouraging the consumption of palm oil within the country by popularizing coconut oil as a \tfundamental \tpolicy of the Government and granting permission to import only refined palm oil concerning consumer rights and public health issues. \t\n*\tGranting concessions to repay loans of coconut industrialists. \n*\tIntroducing relief packages to increase the productivity of coconut \tplantations such as under planting, dairy farming and water supply to \tencourage the coconut cultivation.\n\t*\t Establishment of an Inter-Ministerial Task Force representing the \t\t\trelevant Ministries and Institutions to implement and monitor this \t\t\tprogram.",
  "key": "2020-12-21-010-6ded"
}