{
  "date_str": "2014-11-19",
  "decision_num": 4,
  "title": "Visit of His Excellency the President to New York, USA, for the UN Climate Summit and the 69th Session of the United Nations General Assembly - September 2014",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5841",
  "decision_details": "- H.E. the President, led the Sri Lanka delegation to the UN Climate Summit 2014 and the High?Level Segment of the 69th Session of the United Nations General Assembly which were held in New York from 22nd to 27th September 2014.  The aim of the Summit which was attended by a number of world leaders including 100 Heads of State and Government and over 800 leaders from business, finance and civil society, was to raise political momentum for a meaningful universal climate agreement in Paris in 2015 and to galvanize transformative action in all countries to reduce emissions and built resilience to the adverse impacts of climate change.  Addressing the Climate Summit, H.E. the President had elaborated on the steps taken by the Government to address Climate Change and emphasized that although Sri Lanka was able to triple its per capita income within the last eight years, its per capita carbon emission is still less than 1 metric ton.  H.E. the President has had several discussions with the participants of other countries, during these meetings, and has highlighted the continuing progress made by Sri Lanka in addressing post conflict issues, emerging opportunities for trade and investment in the present economic resurgence, Sri Lanka's continuous engagement with the UN system and matters relating to Human Rights Council.  Hon. (Prof.) G.L. Peiris, Minister of External Affairs, who accompanied H.E. the President and provided the above information to the Cabinet, also has had fruitful discussions with the Foreign Ministers of other countries who participated at these meetings.",
  "key": "2014-11-19-004-65d0"
}