{
  "date_str": "2024-01-29",
  "decision_num": 14,
  "title": "Aswesuma Welfare Benefits Payment Scheme",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12380",
  "decision_details": "- The proposal made by the Hon. President in his capacity as the Minister of Finance, Economic Stabilization and National Policies to implement the ongoing Aswesuma Welfare Benefits Payment Scheme including the following amendments, was approved by the Cabinet.\n\n    • to extend the beneficiary validity period for the vulnerable social category from 2024‑04‑01 to 2024‑12‑31 and for the transitional social category (whose income has temporarily decreased due to the economic crisis) from 2024‑01‑01 to 2024‑12‑31, from among the social categories eligible for Aswesuma.\n\n    • to treat eight hundred thousand families as the vulnerable category with effect from 2024‑01‑01 by combining the existing vulnerable social category and the transitional social category (whose income has temporarily decreased due to the economic crisis) and to pay an allowance of Rs. 5000/- to those families from the said date to 2024‑12‑31. \n\n    • to pay a monthly allowance of Rs. 7,500/- for patients with chronic kidney disease of unknown etiology, Rs. 7,500/- for disabled persons and Rs. 3,000/- for elderly persons, who are in the family list of Aswesuma, after  an information verification process.\n\n    • to increase payments to Rs. 7,500/- for patients with chronic kidney disease of unknown etiology, Rs. 7,500/- disabled persons and Rs. 3,000/- for elderly persons, who receive benefits at present and are registered in the waiting lists, to be effective from 2024‑01‑01 and to make these payments through District Secretaries/ Divisional Secretaries, outside the Aswesuma Programme. \n\n    • To call for applications for the second round in the first quarter of 2024 and conclude in the month of June 2024 and make payments from the month of July and revise the total number of eligible families up to a maximum  of 2.4 million in order to include additional eligible families.",
  "key": "2024-01-29-014-4426"
}