{
  "date_str": "2023-01-09",
  "decision_num": 3,
  "title": "Proposal for the revision of Electricity Tariff 2023",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11843",
  "decision_details": "- Cabinet considered the proposal made by the Hon. President in his capacity as the Minister of Finance, Economic Stabilization and National Policies; and the Minister of Power and Energy on the revision of electricity tariff. Cabinet further considered that the General Treasury is no longer possible to provide required funds to the Ceylon Electricity Board within the existing fiscal space and as such there is no alternative other than the revision of the existing electricity tariff in order to cover only the cost incurred for the supply of electricity while minimizing the impact caused to the electricity consumers as much as possible in order to ensure an uninterrupted supply of power in the country. After discussion, it was decided to grant approval:\n\n* \tThe Public Utilities Commission of Sri Lanka to further study on the proposed electricity tariff revision submitted by the Sri Lanka Electricity Board in consultation with the relevant parties, and if any revisions are to be made, submit the same on or before 2023‑02‑15.\n\n* \tUntil then, the Ceylon Electricity Board and the Public Utilities Commission of Sri Lanka to take necessary action jointly to implement the Electricity Tariff \tamendment proposed by the Ceylon Electricity Board to be effective from \t01‑01‑2023 as an interim measure in accordance with the amendments of the Policy Guidelines currently in force regarding the electricity industry.\n\n* \tIf any amendments will be presented by the Public Utilities Commission of Sri Lanka, the Ceylon Electricity Board to take necessary action to implement those amendments and make the necessary adjustments by the next monthly electricity bills.",
  "key": "2023-01-09-003-ad30"
}