{
  "date_str": "2017-03-21",
  "decision_num": 27,
  "title": "Amendment to Information and Communication Technology Act, No. 27 of 2003",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7603",
  "decision_details": "- The legal framework for the Information and Communication Technology (ICT) policies to be adopted by the Cabinet is established through the Information and Communication Technology Act, No.27 of 2003 amended by the Amendment Act, No.33 of 2008.  The Cabinet has granted approval for the Information Communication Technology Agency to provide facilities to implement a Centralized Household Transfer Management project with the  idea of establishing a National Digital Identifier-NDI and a  National Digital Transaction-NDT which could store bio-metric data of citizens inclusive of  data of citizens to provide an efficient public service to the General Public using the Information and Communication Technology and exchange data with other State Institutions.  When considering the importance of the above project it is observed that ensuring the safety of the data inclusive of the personal data is imperative, and that the Information Communication Agency should prepare and National Policy on collection, storage, distribution and the use of citizen's personal data.  Accordingly, the proposal made by Hon. Harin Fernando, the Minister of Telecommunication and Digital Infrastructure, to instruct the Legal Draftsman to draft the necessary amendments to be made to the Information and Communication Technology Act, No. 27 of 2003, to enable the Inter-Ministerial Committee to exercise the powers under the Act, to establish appropriate institutional arrangements, governance and operational measures for the formal and effective implementation of the Cabinet approved strategies and programmes on Information and Communication Technology, was approved by the Cabinet.",
  "key": "2017-03-21-027-4710"
}