{
  "date_str": "2017-03-21",
  "decision_num": 28,
  "title": "Proposed Solution to the Dispute relating to some of the Employees of the Human Capital Solutions (Pvt) Ltd. - a subsidiary of Sri Lanka Telecom PLC",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7604",
  "decision_details": "- The SLT Human Capital Solutions (Pvt) Ltd (HCS), which is a Subsidiary of Sri Lanka Telecom PLC, is an institution established to provide Human Resources to the outside institutions including the Sri Lanka Telecom PLC and its staff consists of 2,650. Out of them, 2,180 are employees attached to of the Sri Lanka Telecom PLC. All of them have been recruited under a Service Agreement of the HCS Company and received salaries and other facilities from the Company. The services of 1,331 employees out of the above have been made permanent in their posts. These employees receive a monthly salary ranging from Rs.30,000/- to Rs.100,000/- including over time, allowances and annual bonus allowances and they enjoy the other facilities in addition to the annual bonus allowances, salary increases and insurance coverage. \n\n\tThe demand by one section of these employees of the trade union is to absorb them into the Sri Lanka Telecom PLC, treating them as employees of the same.  After computerizing the consumer affairs under the new investment plan of the Sri Lanka Telecom PLC it has been estimated that there will be a considerable surplus of employees, if the relevant employees are absorbed into the Sri Lanka Telecom PLC according to their request and the company will have to bear an additional expenditure of Rs.1.6 billion. \n\n\tHowever, taking into consideration the matters submitted to the Cabinet by Hon. Harin Fernando, the Minister of Telecommunication and Digital Infrastructure, regarding the prevailing situation, it was decided by the Cabinet to advise the Board of Directors of the Sri Lanka Telecom PLC to take action to absorb the experienced and professionally qualified employees of the HCS,  under four (04) stages, from the year 2017 up to the year 2020, as a humanitarian gesture.",
  "key": "2017-03-21-028-3e50"
}