{
  "date_str": "2017-03-21",
  "decision_num": 1,
  "title": "Implementation of the 'Grama Shakthi Programme' for alleviation of poverty",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7577",
  "decision_details": "- The poverty rate of Sri Lanka which was at 26.1% in the year 1990 has been brought down to 6.7% by the year 2011, as a result of numerous security programmes implemented through out the past years.   The year 2017 has been declared as the 'Year of alleviation of poverty in Sri Lanka' and under this programme measures have been adopted to alleviate poverty which still exist at the divisional level. \n\t\n\tAccordingly, in 2017, 700 severely affected Grama Niladhari Divisions will be selected out of the Divisional Secretary's Divisions where the poverty index ranges from 10% to 45% and a People's Company will be formed to be managed by a Director Board selected from out of a general assembly with a participation of 80% of the selected families under the 'Grama Shakthi Programme' which is due to be implemented. The representatives of the People's Companies will be trained and development funds will be granted to the People's Companies so as to enable the representatives to shoulder the task of alleviating poverty of the village by themselves and at the end of the year 2017 this programme will be implemented in such manner as to spend Rs. One Million for the development of every village.  \n\n\tIn addition to the 700 community-managed villages, 300 Grama Niladhary Divisions situated in various parts of the Island which could be developed as production villages will be selected for providing the needed technical know how to improve production and financial facilities for products suitable for export or materials for local needs and thereby reduce imports and creating  new employment opportunities. Accordingly, the proposal made by Maithripala Sirisena, H.E. the President for the implementation of this programme with public-private participation, was approved by the Cabinet.",
  "key": "2017-03-21-001-a2ed"
}