{
  "date_str": "2017-03-21",
  "decision_num": 26,
  "title": "Amendments to the provisions of Poisons, Opium and Dangerous Drugs Ordinance, No.17 of 1929 and Poisons, Opium and Dangerous Drugs (Amendment) Act, No.13 of 1984",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7602",
  "decision_details": "- The target of the Government in respect of the drugs issue is to reduce the supply and demand and the usage of drugs to a very low level by the year 2021.  In this connection, it has been observed that it is necessary to amend the existing provisions to strengthen the functioning of the State Institutions and other Agencies acting directly to enforce the laws relating to narcotic drugs inclusive of the Provincial and Divisional Administration and the Agencies.  Cannabis and Heroin have become a severe threat, at present and as a result of these drug dealings the future generation is being exposed to a great disaster. Although, it is observed that there is a decrease in the cultivation of Cannabis due to the constant raids carried out by the Sri Lanka Police and the Department of Excise, the consumption of Kerala Cannabis has been increased.  Accordingly, the proposal made by Hon. Sagala Ratnayake, the Minister of Law & Order and Southern Development to amend the penalties imposed for the sale of dangerous drugs such as, opium, cocaine, heroin and cannabis and the possession, importing and exporting of such drugs including the amendment to the Third Schedule to the Act, and to reduce the time period in custody after arrest,  by amending the Poisons, Opium and Dangerous Drugs Ordinance, No.17 of 1929 and  to amend the  Poisons, Opium and Dangerous Drugs (Amendment) Ordinance, No.13 of 1984  taking into consideration, the proposals submitted by the  Sub-Committee on Legislation of the National Dangerous Drugs Control Board with the contribution of the law enforcement institutions such as the Attorney Generals Department the Police Narcotic Bureau, the Sri Lanka Customs and the Department of Excise, was approved by the Cabinet.",
  "key": "2017-03-21-026-3641"
}