{
  "date_str": "2018-01-09",
  "decision_num": 12,
  "title": "Promoting the performance of the National Sports Team Pools aiming at International events/tournaments",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8542",
  "decision_details": "- There are only a few number of professional athletes in Sri Lanka and most of them are engaged in their professional and other activities in their day to day life while involving in sports activities during their free time. With a view to improving the performance of the athletes aiming at international competitions, it is important to enroll them into the training pools and to provide them with technical training, food and beverages, medical consultations and medicines etc; under proper guidance. Sports Training Pools for athletics, weight lifting, Wushu, Hockey, Rugger and Karate and Paralympic games are being conducted by the Ministry of Sports and under the training programmes, 159 athletes are being trained. Each athlete in the athletic pool is paid an allowance from Rs.10,000/- to Rs.80,000/-.\n\nIt is necessary to improve the performance of these training pools, targeting achievements at international competition(s),  As most of these athletes are engaged in sports while being employed at the institutions such as the Public Service, Tri-Forces and Sri Lanka Police, it is necessary to take action to have them released from the professional environment for the training activities on a full time basis.  As such, the proposal made by Hon. Dayasiri Jayasekara, the Minister of Sports, to obtain the services of the national and international coaches for each training pool, to provide facilities to those athletes who join the training pools and to motivate the athletes with optimal talents in sports by providing permanent appointments in the State Institutions when the relevant qualifications are achieved for recruitment, was approved by the Cabinet.",
  "key": "2018-01-09-012-97e7"
}