{
  "date_str": "2018-01-09",
  "decision_num": 5,
  "title": "Streamlining and updating of the existing Visa issue system",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8535",
  "decision_details": "- It has been proposed to streamline and update the existing Visa system to coincide with the Government economic policy to enhance the local and international investments for the development process of Sri Lanka. Presently, Visit Visa, Residence Visa, and Transit Visa categories are issued on the request of the qualified foreign nationals. The Cabinet Committee on Economic Management (CCEM) has recommended to amend the existing Visa categories and the charges made on them and to impose the Visa charges made at present in Sri Lankan Rupees, in American Dollars.  Accordingly, the proposal made by Hon. S.B. Navinne, the Minister of Internal Affairs, Wayamba Development and Cultural Affairs, to include the following items also into method of visa issuance and to amend section 14  of the Immigrants and Emigrants Act, No.20 of 1948 and the relevant regulations as appropriate, was approved by the Cabinet.  \n\n*\tto vest the authority with the Secretary to the Ministry in charge of the subject of BOI to recommend Residence Visas for the investors/employees under the Board of Investments (BOI) sector;\n\n*\tto charge an overstay penalty of US$ 500 in addition to the applicable visa fee from foreigners who have overstayed the valid visa period;\n\n*\tto issue Residence Visas for students to the entire period of their study;\n\n*\tto issue a ten year Residence Visa for foreign nationals who make a remittance of over US$ 500,000 in to Sri Lanka;\n\n*\tto issue a five year Spouse Visa for the foreign spouse married to a Sri Lankan citizen and also their children;\n\n\n\n*\tto issue a Residence Visa for employment of foreign spouses of those demised Sri Lanka spouses who are living in Sri Lanka continuously for 10 years or who have children below the age of 18 years for employment for a period of 02 years; and\n\n*\tto issue a Permanent Residence Visa for the ex-Sri Lankan who is unable to apply for dual citizenship and already have a citizenship of a foreign country.",
  "key": "2018-01-09-005-5546"
}