{
  "date_str": "2019-05-21",
  "decision_num": 9,
  "title": "Restoration of the Kudawilachchiya tank and the Dematagala tank",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=9777",
  "decision_details": "- A proposal has been made for the restoration of the presently abandoned  Kudawilachchiya tank situated adjacent to the Wilpattu National Park to augment the supply of water to fulfill the drinking, domestic and the water demand  for agricultural purposes of the people of the Mahawilachchiya area. Through this, around 25,000 people living in 12 Grama Niladhari Divisions of the Mahawilachchiya area will reap benefits while it is also expected to augment the irrigation water supply to 320 hectares of land which could be brought under cultivation. This will also help to provide water for the wildlife found in the area around the Wilpattu National Park and also the elephants roaming for water to be confined to the forest area thus anticipating the mitigation of the human-elephant conflict as well. It is also planned to implement a project to restore the presently abandoned Dematagala Tank and to construct a feeder canal and an anicut across the Hevan Ella Oya to supply additional water to  around 32 village tanks found in the area for the fulfillment of the water needs of the people around the Palagala area who constantly face difficulties owing to the scarcity of water. Through this, irrigation water will be provided for around 520 hectares of land  and will benefit around 1,250 farmer families. The wildlife will also be assured of water during the dry season through the proposed canal  constructed  across the Kahalla forest. Accordingly, the proposal made by Hon. P. Harison, the Minister of Agriculture, Rural Economic Affairs, Livestock Development, Irrigation and Fisheries & Aquatic Resources Development to restore the Kudawilachchiya tank, within a period of 03 years with an investment of Rs.1,000 million and to carryout the restoration of the Dematagala tank and the improvement of the Hevan Ella anicut and the feeder canal under two (02) stages, with an investment of Rs.924 million, was approved by the Cabinet.",
  "key": "2019-05-21-009-b42f"
}