{
  "date_str": "2019-05-07",
  "decision_num": 6,
  "title": "Improving the Educational, Health and Nutrition level of Sri Lanka",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=9745",
  "decision_details": "- According to the social, health and educational indicators, although Sri Lanka has achieved a higher level in such outcomes, it has been observed that there is still a considerable number of children subject to malnutrition among the school children.  As such, programmes like the school meal programme, the school milk programme, the triposha programme, the nutritional programmes of pre‑school students and nutritional programmes for pregnant and lacatation mothers etc. are implemented through the various Line Ministries.\n\nIn addition, the Department of Agriculture in the United States, has expressed its willingness to donate a grant of US$ 26 million under the 'Save the Children', the Project for Promoting Autonomy, Literacy and Attentiveness through Market Alliances. During a period of 05 years of the implementation of the proposed programme, an investment is to be made for the supply of 4,220 MT of high quality food substances valued at US$ 8.8 million and the Government sponsored 13 projects for the improvement of  nutrition, health, literacy sectors etc. Further more, a focus is made to provide food supplements approximately for 887 schools where around 108,940 students receive their education, across 7 districts namely Kilinochchi, Mullaitivu, Trincomalee, Nuwara Eliya, Badulla, Moneragala and Ratnapura where malnutrition is prevalent at a high level to address their nutritional deficiency.  Accordingly, the joint  proposal made by Hon. Ranil Wickremasinghe, the Prime Minister and Minister of National Policies, Economic Affairs, Resettlement & Rehabilitation, Northern Province Development and Youth Affairs and Hon. Mangala Samaraweera, the Minister of Finance, to enter into the Memoranda of Understanding required for the implementation of this project, was approved by the Cabinet.",
  "key": "2019-05-07-006-6d75"
}