{
  "date_str": "2019-05-07",
  "decision_num": 29,
  "title": "“Relief Package” for strengthening the Tourism Industry affected by the Easter Sunday Terrorist Attacks",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=9768",
  "decision_details": "- The tourism industry was the leading force for the increase of the GDP growth of Sri Lanka in the last decade. The number of tourist arrivals which was  less than 500,000 in the year 2009 rose up to 2.3 million by the year 2018 due to the end of the civil war. Accordingly, the tourism industry had assumed the third largest and fastest- growing source of foreign exchange earnings by 2018, next to the foreign remittances and apparel exports. Due to the  threat caused to the future certainty and sustainability of the tourism industry by the recent terrorist attacks, a Cabinet Sub‑Committee chaired by the Minister of Tourism Development, Wildlife and Christian Religious Affairs was established to submit the recommendations to the Government on short term and long term measures to be taken to rebuild the said industry. The Government, taking into consideration of the recommendations of the said Committee has decided to grant relief to build confidence among the investors of the tourism sector and the tourists. As such, the proposal made by Hon. Eran Wickremaratna, the Acting Minister of Finance for granting a concessionary period for the recovery of  loans obtained by the industries and persons engaged in the tourism field, to re‑schedule the loans, provide a Working Capital (W/C) loan under “Enterprise Sri Lanka Programme” with a repayment period of 2 years with a 75% interest subsidy granted by the Government, exempt the taxes on importation of security equipment to ensure the security of private establishments, to reduce the Value Added Tax (VAT) up to 5% on registered hotels and tour operators during the period of April 01, 2019 to March 31, 2020, was approved by the Cabinet.",
  "key": "2019-05-07-029-ddf1"
}