{
  "date_str": "2018-05-22",
  "decision_num": 7,
  "title": "Entering into a new Agreement in regard to providing access to the International Committee of the Red Cross (ICRC) to observe the places of detention in the Country",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8861",
  "decision_details": "- The International Committee of the Red Cross (ICRC) has been operating in Sri Lanka since the year 1989 and it conducts excellent relations at professional level with all relevant public institutions. According to a Memorandum of Understanding (MoU) signed with the then representation of the Ministry of Defence, an opportunity has been provided to the Committee to visit the persons detained in Sri Lanka Prisons and the places of detention. The Committee ensures that all detainees are treated humanly and brings to the awareness of the relevant authorities the matters where attention is needed. With the change of environment following the conclusion of the armed conflict, a proposal has been made by the Committee to enter into a new Agreement in regard to carrying out the observation activities and the visits of the Committee to the places of detention conducted in Sri Lanka. \n\n\tWhen the prison network of Sri Lanka is designed in accordance with the international standards, obtaining the wide international experiences the Red Cross Committee has gained and its expertise, is really important to Sri Lanka  in order to improve the status of the detention places of Sri Lanka and the manner in which the detainees are treated. Accordingly, the proposal made by Hon. Thilak Marapana, the Minister of Foreign Affairs, to sign the Agreement proposed for cooperation and humanitarian activities in between the Ministry of Foreign Affairs on behalf of the Government of Sri Lanka and the International Red Cross Committee to benefit the detainees deprived of their liberty, was approved by the Cabinet.",
  "key": "2018-05-22-007-890a"
}