{
  "date_str": "2018-05-09",
  "decision_num": 14,
  "title": "Implementation of the Colombo Suburban Railway Efficiency Improvement Project (CSREIP)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8815",
  "decision_details": "In providing an efficient passenger transportation service to the general public by improving of the Public Transport Service, the Government has identified the development of the Railway Service of the country as a priority. Accordingly, action has been taken to commence the development activities of the suburban railway system connecting the Colombo city with other areas under the 'Colombo Suburban Railway Project' implemented under the financial assistance of the Asian Development Bank (ADB). A proposal has been made to implement the following few small scale projects required for the improvement of the railway efficiency through 'Colombo Suburban Railway Efficiency Improvement Project (CSREIP)' to be implemented under this project:\n\n*\tImplementation of a modern Ticketing and Seating Reservation System,  replacing the existing ticketing and seating reservation system;\n\n*\tInstallation of a new system for providing radio telecommunication services to the railway passengers;\n*\tExpansion and reconstruction of the School Avenue railway bridge at Maligawatta, Colombo;\n\n*\tConstruction of the Colombo Train Control Centre and the Railway  Operations Centre;\n\n*\tDevelopment of the training activities of the Sri Lanka - German Railway Technical Training Centre, including the new technology, systems and methodologies;\n\n*\tProviding a Machinery and Carriage Repair workshop for the Railway Mechanical Engineers' Department at Ratmalana;\n\n*\tEstablishment of 02 Housing Schemes for the resettlement of families living in the railway reservations.\n\nAs such, the proposal made by Hon. Nimal Siripala de Silva, the Minister of Transport and Civil Aviation, to implement the Colombo Suburban Railway Efficiency Improvement Project (CSREIP) which includes the above sub projects, was approved by the Cabinet.",
  "key": "2018-05-09-014-1e46"
}