{
  "date_str": "2018-05-15",
  "decision_num": 27,
  "title": "Resolving the educational problems of the students of the Medical Faculty of the South Asian Institute of Technology and Medicine - SAITM",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8851",
  "decision_details": "- The Cabinet granted approval on 2018-03-06 to implement a methodology in accordance with the recommendations made by the Officials' Committee Chaired by the Secretary to the Ministry of Defence pertaining to the absorption of the students of the South Asian Institute of Technology and Medicine engaged in studying medicine to the Institute of General Sir John Kothalawala Defence University. Subsequently, discussions were held on 2018‑05‑09 presided over by H.E. the President and with the participation of the Minister of Higher Education & Cultural Affairs on 2018‑05‑10 in regard to the legal and practical problems arisen when implementing the approved methodology. \n\n\tThe joint proposals made by H.E. the President Maithripala Sirisena in his capacity as the Minister of Defence; and Hon. (Dr.) Wijayadasa Rajapaksa, the Minister of Higher Education & Cultural Affairs, to instruct the Legal Draftsman to draft legal provision with regard to the implementation of the following recommendations pertaining to the absorption of the medical students of the SAITM into the Faculty of Medicine of the Kothalawala Defence University, as decided at the said discussions, was approved by the Cabinet. \n\n*\tOut of the students who have registered with the SAITM institute from 15th September, 2009 up to 15th of May 2017 to the course of study in medicine only, the students who have fulfilled the basic qualifications to be admitted to the Medical Faculties in the State Universities to be absorbed into the Faculty of Medicine of the General Sir John Kothalawala Defence University. \n\n*\tGranting authority to the Board of Management of the said University to stipulate the requirements and conditions for the absorption of the said students to the General Sir John Kothalawa Defence University.\n\n*\tOut of the students absorbed into the General Sir John Kothalawa Defence University from the SAITM institute, the students who pass the relevant examination of the Sir John Kothalawa Defence University will be awarded the degree of the said University.",
  "key": "2018-05-15-027-5d87"
}