{
  "date_str": "2016-01-27",
  "decision_num": 9,
  "title": "Imposition of the special trade levies on the import of Mackerel fish for the production of canned fish",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6541",
  "decision_details": "- Annually, around 20,000 metric tonnes of canned fish are imported to this country to fulfill the local demand for canned fish.  In order to save the foreign exchange of more than Rs.5 billion annually expended for the purpose, the Government has encouraged the local production of canned fish and as a result, since 2012, four local factories are engaged in the process of producing canned fish and releasing the same to the local market. The number of direct employment opportunities generated under this process is about 150. In order to encourage the production of local canned fish, the levy on imported canned fish was raised up to Rs. 100/- per Kg., in the year 2013 and steps were taken to reduce the same to Rs. 50/- per Kg. in the year 2015, with the objective of providing concessions to the consumers. Conditions were imposed to the effect that every imported can of fish weighing 425 gms should contain 280 gms of drained solids; the maximum retail price of such a can should be Rs.140/-; an imported can of fish weighing 155 gms should contain 105 gms of drained solids; and that the maximum retail price of such a can should be Rs.70/-. However, the consumers have not had the anticipated relief and instead,  the sale of canned fish in excess of the maximum retail price; the importation of canned fish rising up to 40,000 MTs with tax reduction in year 2015; and the expenditure of foreign exchange exceeding Rs.10 billion, has  incurred. Therefore, the proposal made by Hon. Mahinda Amaraweera, the Minister of Fisheries and Aquatic Resources Development,  to grant the concessionary levy on the import of  Mackerel fish, introduced to provide relief to the consumer, only to the local manufacturers of canned fish, on a permit basis and to grant the concessionary levy on the import of canned fish, only to those with the stipulated standard, was approved by the Cabinet.",
  "key": "2016-01-27-009-ebad"
}