{
  "date_str": "2020-03-18",
  "decision_num": 15,
  "title": "Managing the Economy and Challenges with the COVID19 hit Global Economy",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10489",
  "decision_details": "- With the Novel Corona virus outbreak, the world economy has virtually come to a grinding halt and all the industry sectors of travel, tourism and airlines are almost grounded. Although, China where the disease originated, has shown signs of recovery from the risk of spreading the disease as a result of the measures adopted by the said country for the control and prevention of this disease, the Novel Corona virus has been spread to most countries of the world inclusive of the Advanced Countries. \n\nIn this background, the intervention of the Government has become absolutely necessary for the provision of the public health services in the country, adopting of all possible measures for the prevention of the disease, the provision of services and supplies spread over in a wide range and also for managing the set backs in the fields of tourism, export, foreign employment, information technology and the small enterprises associated with those fields. \n\nAt the time of the dissolution of Parliament on 02nd March 2020, the Appropriation Bill for the year 2020 had not been presented in Parliament and the Government had to pay attention on other alternatives as the support of the opposition was not received for the proposal made by the Government to obtain required funds since the allocations provided by the Vote on Account which had been approved by that time was not sufficient to clear the unpaid bills for the year 2019 pertaining to purchase of pharmaceuticals, procurement of fertilizer, various constructions and for the activities to conduct the General Election 2020 as well. \n\nTherefore, the provisions to obtain the required allocations for the said purposes have been imposed in terms of the authority vested with H.E. the President by the Constitution and accordingly, the General Treasury has taken the following steps:\n\n*\tRelease of funds amounting Rs. 10 billion to settle pharmaceutical bills.\n\n*\tRelease of Rs. 500 million for Corona control measures.\n\n*\tRelease of Rs 3 billion to settle fertilizer outstanding bills.\n\n* \tRelease of Rs.5 billion to settle outstanding bills of the small and medium construction contractors.\n\n* \tEmbark Rs. 46 billion to settle elderly deposit interest subsidy which has not paid for two years.\n\n* \tObtain allocations amounting Rs. 8 billion required for the General Election 2020. \n\nMany countries are compelled to seek domestic solutions in the medium term, considering the risks at the economy due to the slowdown created in the global economy. Accordingly, the Government has paid its attention to obtain the optimum benefits while considering the current tendency in oil price reduction in the World Market and has planned to implement the following proposals considering the views of the experts in the relevant fields. \n\n * \tMaintain the current fuel prices at the domestic market in view of easing traffic congestion and smooth traffic arrangements for both public and private transportation. \n\n* \tImpose an Import Duty on fuel imports to recover profit margins from Petroleum imports.\n\n* \tEstablish a Fuel Price Stabilization Fund to have savings from international oil price reduction and generate a sum of Rs. 200 billion through such savings over six months.\n\n* \tProvide Rs.50 billion from the said Fund to the Ceylon Electricity Board in order to reduce the debt of the Ceylon Electricity Board to the Ceylon Petroleum Corporation and thereby to settle the debt to be paid to the Bank of Ceylon and the Peoples Bank by the Ceylon Petroleum Corporation.\n\n* \tConsidering the benefit of the oil price reduction, supply heavy oil by the Ceylon Petroleum Corporation to the Ceylon Electricity Board at the rate of Rs.70/- per litre and thereby to settle the bank debts and interests by reducing thermal power generation cost below Rs.30 billion \n\nFurther, by considering the prevailing drought condition in many parts of the country and the necessity to provide essential food items at a reasonable price under the present situation, it has been planned to reduce the Maximum Retail Price for 1 kg of lentils to Rs. 65/- and 425 g of Canned fish to Rs. 100/-.\n\nIt has also been planned to provide following relief for the sustainable continuation in the fields of tourism, apparel and trade which have been affected by the Novel Corona Virus:\n\n*\ta 6 month moratorium to repay the loans obtained from banks and financial institutions.\n\n*\tflexible working hours and relief for the overtime and holiday payments, specially in the fields of IT and apparel.\n\n*\tWorking Capital requirement at 4% interest. \n\nApproval of the Cabinet of Ministers was granted to implement the above programme forwarded by H.E. the President.",
  "key": "2020-03-18-015-9d04"
}