{
  "date_str": "2015-09-09",
  "decision_num": 1,
  "title": "\"Let's Awaken Polonnaruwa\" - District Development Programme - 2016 - 2020",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6273",
  "decision_details": "- Polonnaruwa District which forms a part of Rajarata area of 07 Divisional Secretariat Divisions and 295 Grama Niladhari Divisions. The infrastructure facilities, which are basically limited to the urban area are inadequate to meet the present day needs of the community and the infrastructure facilities such as health, education and roads available in the rural areas are of a very low standard. Especially, the infrastructure facilities available in the Divisional Secretariat Divisions of Welikanda, Dimbulagala, Medirigiriya and Lankapura affected by conflict situation which prevailed in the North and East are in a very poor state. As such, the people in the Polonnaruwa District lead a difficult life and are becoming more inclined to avail themselves of various services they need  from the adjoining districts. \n\nUnder the above five year programme, it has been proposed to implement number of various development projects in the district at a cost of Rs.60 billion and out of which the Cabinet approval has already been granted to implement the Drinking Water Project and the Project on construction of a Hospital for Kidney Patients. It is expected to finance number of projects under  this programme through the personal donations obtained from the local and foreign parties. \n\nSeveral projects in the sectors such as Education, Health and Rural Roads which have been identified to be implemented expeditiously under the proposed five year plan, are anticipated to be initiated in the year 2015 and it has been estimated that these projects would involve a cost of approximately, Rs.750 million. Accordingly, the proposal made by H.E. the President Maithripala Sirisena, to implement the proposed District Development Programme -  \"Let's Awaken Polonnaruwa\" during the period of 2016 - 2020, and to initiate the projects that should be commenced expeditiously under the programme, was approved by the Cabinet.",
  "key": "2015-09-09-001-3697"
}