{
  "date_str": "2015-09-16",
  "decision_num": 2,
  "title": "Consent of Sri Lanka to Minimize the Impact of the Climate Change, in Keeping with the Kyoto Protocol",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6284",
  "decision_details": "- The Protocol adopted in the year 1997 in Kyoto, Japan, by the parties that are legally bound to achieve the objectives of the United Nations Framework Convention on Climate Change (UNFCCC), which is the major Convention collectively adopted by the International Community to discuss the issues related to climate change is known as Kyoto Protocol. \n\n\tAlthough, the Green House Gas Emissions by the industrialized countries were to be reduced by at least 5.2% against the gas level emitted by such countries in 1990, during the first commitment period of this Protocol, which implemented during the period of 2008 - 2012, but the target could not be achieved by the year 2012. Therefore, at the 8th meeting of the parties held in Doha-Qatar in the year 2012, a resolution was adopted to implement a Second Commitment Period by which it is anticipated to reduce the Green House Gas Emissions by the industrialized countries at least by 18% as against their emissions in 1990, individually or collectively, during the period of 2013-2020.  \n\n\tThere is a risk of facing adverse affects by the island nations like Sri Lanka due to situations such as rise of sea level occurred due to increase of global warming that may be  caused as a result of excessive emission of Green House Gases by the developed industrialized countries. \n\n\tThrough expressing concurrence for the Second Commitment Period of the Kyoto Protocol, it will be possible for the member countries like Sri Lanka to exert  the developed industrialized  countries to reduce their excessive emission of carbon and also to obtain foreign aids from the nation parties for the implementation of various projects in that regard. \n\n\tAs such, the proposal made by H.E. the President, Maithripala Sirisena in his capacity as the the Minister of Mahaweli Development and Environment, to express the consent of Sri Lanka to protect the Earth through further providing the required assistance for the proposed Second Commitment Period of the Kyoto Protocol, was approved by the Cabinet.",
  "key": "2015-09-16-002-1f22"
}