{
  "date_str": "2015-09-16",
  "decision_num": 8,
  "title": "Management of Paddy Harvest in the Yala Season 2015",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6290",
  "decision_details": "- Approval of the Cabinet was granted for the implementation of the following recommendations made by the Cabinet Sub-Committee appointed under the chairmanship of the Minister of Finance with a view to drawing up a plan to supervise the paddy harvest programme of the Yala Season 2015 and to providing concessions efficiently to farmers, in accordance with the decision taken at the Cabinet Meeting held on 2015-09-09. \n\n*\tThe 120,000 Mt of paddy anticipated to be purchased at the initial stage of the paddy purchasing programme to be increased by 40,000 Mt up to 160,000 Mt.\n\n*\tAllocation of additional financial provision of Rs.1,906 million required for the purpose.\n\n*\tIn order to have of adequate storage facilities for the purchase of paddy in the upcoming Maha season of 2015/2016, disposal of Government owned excess paddy stocks through Paddy Marketing Board following the Government Procurement Procedure while maintaining the required buffer stock.\n\n*\tMinimizing the irregularities taking place in the purchase of paddy to enable the purchase paddy from more farmers.\n\n*\tTaking necessary action to strengthen the small and medium scale paddy millers who are now inactive, for extensive participation of the private sector in the paddy purchasing while implementing the Government paddy purchasing programme.\n\n*\tCreating a competition in the paddy purchasing through providing special temporary storage facilities for bulk purchasers who do not possess adequate storage facilities.\n\n*\tEncouraging the investments of the private sector for the production of bio - fuel making use of the surplus paddy available in the country after a successful paddy harvest during both the Yala and Maha seasons.  \n\n*   \tEncouraging the industries engaged in value added productions utilizing rice flour. \n\n*\tPopularizing of new varieties of paddy suitable for the export market among farmers, as a long term solution.\n\n*\tTaking necessary steps for crop diversification, by introducing other field crops except paddy, for a season.",
  "key": "2015-09-16-008-51db"
}