{
  "date_str": "2015-09-16",
  "decision_num": 6,
  "title": "'Wana Ropa' - National Tree Planting Proramme",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6288",
  "decision_details": "- The declining of forest cover is a special environmental issue faced by Sri Lanka and a target is set to increase the prevailing 29% of forest cover up to 32% from further 6,000 hectares through the implementation of three year National Programme on Environment Conservation during the period from 2016 - 2018.  Similarly, an effective liaison will be made in order to secure the sustainability of the Tree Planting programmes are being already implemented by the state and the non-state parties, with a view to enhancing the forest cover of Sri Lanka. \n\n\tIt has also been planned to implement a national tree planting programme known as \"Wana Ropa\" throughout the month of October, 2015 to increase the forest cover, to enhance the quality of the forest cover, to conserve biodiversity and natural ecosystems, to utilize bare lands for effective tree planting and promotion and management of commercial forestry. Various activities will be conducted as follows for the purpose:   \n*\tFirst Week  \n\t\n\tPromotion, maintenance and protection of forestry in order to protect special ecosystems under the theme of 'Ensure Forest Conservation' ('Wana Arana – Rekawarana') \n*\tSecond Week\n\t\n\tPromotion of greenery and to ensure its benefits reach people through planting trees that would help to form a canopy with stems of branches in and around human settlements under the theme of 'Enhance Greenery in Human Settlements' ('Jana Hisata - Thru Sevana').\n* Third Week\n\n\tTo make the Non-Governmental Organization and Private Sector active partners of the National Tree Planting Mission under the theme of 'Promote Partnerships with the non-state Stakeholders' ('Thuru Kepakaru - Api Nirathuru').\n*\tFourth Week\n\n\tTo encourage various segments of the society to take part in creative and sustainable forestation initiatives under the theme of 'Wana Aranata - Jana Sarana'.\n\n\tThis programme will be implemented through out the Island in October 2015, at Divisional Secretariat Division level and District level and it has been proposed to organize awareness workshops on environment conservation, soil conservation projects and various environmental conservation activities at regional level. Accordingly, the proposal made by H.E. the President Maithripala Sirisena in his capacity as the Minister of Mahaweli Development and Environment, to implement this programme with the active participation of all Government institutions, Private and Non-Governmental institutions, was approved by the Cabinet.",
  "key": "2015-09-16-006-c0f1"
}