{
  "date_str": "2014-01-13",
  "decision_num": 4,
  "title": "Measures adopted by the Government for the Control of Dengue Epidemic in the Country",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5356",
  "decision_details": "- during the year 2013 a number of countries in Asia have reported a substantial increase in Dengue when compared with the past several years.  Although Dengue illness continues to remain as a challenging health issue in Sri Lanka, the Ministry of Health has implemented numerous activities, in association with the Provincial Authorities and the relevant Agencies, to minimize the burden of Dengue by early diagnosis and responding expeditiously to outbreak situations.  As a result, in 2013 a total of 27,991 cases were reported when compared to 40,823 cases in 2012, which is a reduction of 32%.  168 deaths were reported in 2012, and in 2013 it has come down to 78 deaths. The following are some of the major activities conducted by the Ministry of Health, under the direction of H.E. the President, in association with the Presidential Task Force and other stakeholders for the prevention and control of Dengue:\r\n\r\n*\tin keeping with the decisions of the Task Force, a unit responsible for inspection an action to control / destroy mosquito breeding places has to be established in every State Institution which should submit a monthly Report on action taken, to the Ministry of Health / Provincial Ministry of Health, as per Circular instructions issued by the Secretary to the President;\r\n\r\n*\tlaboratory facilities were improved for early diagnosis, including a dedicated Molecular Diagnostic Laboratory at the Medical Research Institute, Colombo;\r\n\r\n*\ttreatment facilities were strengthened by providing over 2000 clinical staff including doctors and nursing officers for the purpose, establishing nearly 200 high dependency units with necessary equipment; and\r\n\r\n*\tdeclaration of Mosquito Control Weeks and conducting activities parallel to them, including programmes through electronic and print media.  Under these activities legal action was instituted against 10,808 personnel and 9,100 were convicted under the Penal Code.  \r\n\r\nThe proposal made by Hon. Maithripala Sirisena, to proceed with the proposed activities in this regard, was approved by the Cabinet.",
  "key": "2014-01-13-004-b1c6"
}