{
  "date_str": "2021-10-11",
  "decision_num": 2,
  "title": "Formulation of legislation on Cyber Security",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11290",
  "decision_details": "- (a) \tDrafting of an Act titled as Defence Cyber Command Act -\n\nWith the development of electronic communication, terrorist groups and criminals have been likely to use cyber space and electronic communication for terrorist activities, organized crimes and anti‑social activities. It has been recognized that the electronic communication through the cyber space is a factor which may directly influence the national security. Hence, there is a stringent need of formulating new legislation covering every field for ensuring the national security, incorporating the provisions required for formal and efficient performance of operations conducted by the Cyber Security Units established by the Tri‑Forces, Police and other agencies at their institutional levels.\n\n(b) \tFormulation of a Bill for enactment of Cyber Security laws ‑ \n\nThe Ministry of Technology has been vested with the responsibility of cyber security and establishing an institutional structure for the purpose. As such, it has been decided appropriate to formulate a separate Bill as indicated under (a) above, including the provisions on cyber security pertaining to the field of defence, subsequent to the discussions held among the Ministry of Defence, the Ministry of Technology and other relevant stakeholders on the draft Bill prepared by the Legal Draftsman. The need of introducing new laws has arisen to achieve the objectives of designing a regulation framework, for the implementation of the National Information and Cyber Security Strategy, providing provisions for the establishment of the Cyber Security Agency of Sri Lanka to associate with the other supporting institutions for the purpose, introducing the legal requirements for the protection of critical information infrastructure within the country, preventing the insecure activities on cyber security and creating a formal cyber security environment within the country, apart from the matters pertaining to the national security.\n\nAs such, taking into consideration the proposals made by H. E. the President in his capacity as the Minister of Defence and Minister of Technology, approval of the Cabinet was granted to draft two bills as mentioned above.",
  "key": "2021-10-11-002-1c3d"
}