{
  "date_str": "2012-02-15",
  "decision_num": 4,
  "title": "Annual Report of the National Council for Elders for the Year 2010",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4414",
  "decision_details": "- the National Secretariat for Elders functioning under the Ministry of Social Services, has initiated the following programmes:\r\n\r\n*\tElder Protection Voluntary Workers Programme - this is a programme  to train and employ persons for providing protection and nursing services needed for elders.  Under this programme, a systematic training is given to persons, on looking after and providing health services for elders.  After training, the services of these persons could be obtained for an 8 hour shift during the day time for a fee of Rs.600/-.  A proper certificate and an identity card are issued for those who have completed the training successfully.  This service is presently centred around the Western Province and is expected to be extended to other Provinces.\r\n\r\n*\t\"Wedihiti Awarana Kepakaru\" (Sponsorship) Scheme - under this Scheme any person can make financial contributions which will be paid to needy elders selected from AGA's Divisions and each elder is paid Rs.250/- per month, through the Divisional Secretariat.  An officer attached to the Divisional Secretariat by the National Secretariat for Elders will coordinate the activity of this programme.\r\n\r\n\r\n*\tSenior Citizens Pension Scheme -  the National Secretariat for Elders jointly with the Sri Lanka Social Security Board has launched this programme with effect from 2008.  Needy elders who are above 70 years of age and not getting any financial assistance from the government are selected at Divisional Secretariat level for this Scheme and priority is given to elders with disabilities and non-communicable deceases.\r\n\r\n\r\n\r\n*\tMaintenance Board for Elders -  the function of this Board is to assist needy elders over 60 years of age who wish to claim maintenance from their own children who have neglected them. Applications for same have been made available in Divisional Secretariat or Grama Niladhari Offices, by the National Secretariat for Elders.\r\n\r\n\r\nThe above Annual Report of  the National Council for Elders for the year 2010, submitted by Hon. Felix Perera, Minister of Social Services, was approved to be presented in Parliament.",
  "key": "2012-02-15-004-22b1"
}