{
  "date_str": "2012-02-29",
  "decision_num": 8,
  "title": "Purchase of paddy of Maha Season 2011/2012 and proposals for the export of excess paddy stocks",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4430",
  "decision_details": "- the expected paddy harvest from Yala Season 2011 and Maha Season 2011/2012 is around 4.5 million MT.  With the expected paddy harvest in Maha Season 2012, there will be a stock of 3.2 million MT of paddy with the Paddy Marketing Board.   According to estimates, the annual consumption of rice in the country is around 3.54 million MT.  and with the collection of paddy of the Maha and Yala Seasons 2012, there is to be a surplus of 1.01 million MT of paddy.  The proposals made by H.E. the President in this regard, in his capacity as the Minister of Finance and Planning, some of which are as follows, were approved by the Cabinet:\r\n\r\n*\tprovision of Rs.1280 million from State Banks to the Paddy Marketing board for the purchase of paddy;\r\n\r\n*\tprovision of Rs.1015 million, made up as follows, to the District Secretaries for the purchase of paddy - \r\n\r\n\tPollonnaruwa Rs.250 million, Matale Rs.50 million, Kurunegala Rs.100 million, Moneragala Rs.30 million, Kilinochchi Rs.70 million, Mannar Rs.30 million, Hambantota Rs.10 million, Batticaloa Rs.25 million, Trincomalee Rs.50 million, Anuradhapura Rs.200 million, Ampara Rs.200 million;\r\n\r\n*\tprovision of Rs.15,000 million by the Bank of Ceylon, Rs.5000 million by the Peoples' Bank and Rs.1500 million by the Regional Development Bank, to provide loans to the private sector for the purchase of paddy;\r\n\r\n*\tprovision of Rs.2000 million by State Banks to Co-operative Societies for the purchase of paddy;\r\n\r\n*\tto call for worldwide tenders to export the surplus of paddy;\r\n\r\n*\tto utilize the stores complex constructed at Oyamaduwa under \"Deyata Kirula\", for the storage of paddy; and,\r\n\r\n*\tto provide a stock of 500 MT of paddy to the World Food Organization (WFO), to which they have already consented.",
  "key": "2012-02-29-008-8aa5"
}