{
  "key": "2025-06-02-012-65bd",
  "title": "Project to construct permanent houses for families displaced by conflict in the Northern and Eastern Provinces",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=13205",
  "decision_details": "- Due to the conflict situation that prevailed in the Northern and Eastern Provinces for 30 years, a large number of houses belonging to families residing in those areas were damaged. Since the year 2009, 914,722 people belonging to 274,728 families have been resettled in the Northern and Eastern Provinces and 150,488 houses have been constructed for them in 08 districts of the Northern and Eastern Provinces by the end of the year 2024. Funds were provided for the construction of these houses by the Government of Sri Lanka, the Government of India, Non-Governmental Organizations and other institutions including International Organizations. It has been identified that about 16,759 more houses need to be constructed in the 08 districts of the Northern and Eastern Provinces for the core families displaced before the year 2009. At the inception of this project, the estimated cost for the construction of a 550 sq. ft. house has been determined as Rs. 1,100,000/- and Rs. 650,000/- for the construction of a 340 sq. ft. house. However, based on the current prices of building materials, the estimated cost for the construction of a 550 sq. ft. house has been estimated as Rs. 1,600,000/- and Rs. 950,000/- for the construction of a 340 sq. ft. house. Accordingly, the proposal made by the Minister of Urban Development, Construction and Housing to increase the amount of assistance provided by the Government for the permanent housing construction project on the basis of construction by the beneficiary, effective from the year 2025 as follows, was approved by the Cabinet:* To increase the amount of assistance provided from Government funds for the construction of a 550 sq. ft. house up to Rs. 1,500,000/-.* To increase the amount of assistance provided for the construction of a 340 sq. ft. house up to Rs. 900,000/-.",
  "date_str": "2025-06-02",
  "decision_num": 12
}