{
  "date_str": "2025-06-16",
  "decision_num": 3,
  "title": "Programme for providing a cost of living allowance for children in institutional care or guardianship and street children",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=13233",
  "decision_details": "- Institutional care is provided in Detention Homes/Child Development Centers for children who do not have proper care and protection in the home they live in, due to the loss of parents, loss of custody, or even under the custody of both the mother and father or one of them and also to orphaned and abandoned children. It has been reported that by the end of the year 2024, about 9,191 children are receiving residential care in 356 Child Development Centers run by the Government, voluntary organizations and Non-governmental organizations throughout the country. A provision of Rs. 1,000 million has been allocated through the Budget for the year 2025 to provide a monthly allowance of Rs. 5,000/- for children under institutional care and guardianship and street children. Accordingly, the proposal made by the Minister of Woman and Child Affairs to pay the proposed cost of living allowance as follows and to appoint a National Steering Committee chaired by the Secretary to the Ministry of Women and Child Affairs and comprising officers from other relevant institutions, to provide necessary guidance and review activities for the sustainable and effective implementation of the said programme, was approved by the Cabinet.* providing a sum of Rs.3,000/- from the cost of living allowance of Rs.5,000/- to the Development Center where the child is staying or to the guardian through the National Savings Bank for the education, health and other welfare expenses to be provided under the guardianship.* depositing the remaining sum of Rs.2,000/- monthly in a savings account in the National Savings Bank in favour of the child for the future well-being of the child.",
  "key": "2025-06-16-003-6388"
}