{
  "date_str": "2024-06-03",
  "decision_num": 2,
  "title": "Implementation of the Article 6 of the Paris Agreement in Sri Lanka",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12567",
  "decision_details": "- The Paris Agreement, which is a legally binding international treaty on climate change, has been adopted by 196 parties at the 21st Conference of the United Nations Framework Convention on Climate Change (COP21) held in 2015 in Paris, and Sri Lanka has signed the said Agreement in 2016. The main objective of the Paris Agreement is to maintain the increase in the global average temperature to well below 02 degrees Celsius above the pre-industrial levels and to limit the temperature increase to 1.5 degrees Celsius above the pre-industrial levels. As per the provisions of the said Agreement, the Parties should implement \"Nationally Determined Contributions (NDCs)\", for which 02 market mechanisms have been introduced. It paves the way for the countries to bilaterally exchange the outcomes of greenhouse gas mitigation, to report such exchanges of greenhouse gas and to utilize them to achieve the Nationally Determined Contributions of the partner countries. Further, it has been introduced a new international carbon crediting mechanism through this Agreement. Under that situation, Sri Lanka is preparing Carbon Market Strategy and Guiding Principles with the technical support of the Regional Collaboration Centre, Dubai of the United Nations Framework Convention on Climate Change, and it is expected to complete the work by the end of this year. In the meantime, various project developers have submitted project proposals related to the main sectors of electricity, industry, waste management, transport, agriculture and forestry identified by Sri Lanka to mitigate greenhouse gas emissions. The proposal made by the Hon. President in his capacity as the Minister of Environment to appoint a Committee chaired by the Secretary, Ministry of Environment to evaluate the said project proposals and reach decisions until the Carbon Market Strategy and Guiding Principles are implemented, was approved by the Cabinet.",
  "key": "2024-06-03-002-d531"
}