{
  "date_str": "2024-06-03",
  "decision_num": 3,
  "title": "Reforming the Education Administration System for Drastic Transformative Change in Education",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12568",
  "decision_details": "- The National Education Policy Framework 2023-2033 prepared in accordance with the vision of \"a fully developed Sri Lanka by the year 2048\" aiming to provide equal opportunities and quality education to each and every student in the country, has presented facts about the transformative change that should take place in education. Accordingly, the need for a new transformation in the organizational structure, curriculum and evaluation method has been identified to ensure a long-term learning methodology. Accordingly Cabinet approved the proposal made by the Minister of Education for taking necessary action as follows, with a view to establishing an appropriate administrative structure for the efficient and effective implementation of the overall educational reforms, based on the recommendations of the Cabinet Sub-Committee appointed under the Chairmanship of the Hon. President regarding the preparation of the National Education Policy Framework:\n\n*\tClassification of schools in compliance with the international standards.\n\n*\tEstablishment of 09 Educational Reform Units in the 09 provinces.\n\n*\tIncreasing the number of Zonal Education Offices from 100 to 122 in stages, based on a scientific and priority order.\n\n*\tEstablishment of 350 School Boards also including the existing 314 Divisional Education Offices aiming to ensure the school supervision, \tmonitoring teachers and verifying the validity of school-based evaluations.\n\n*\tDesignating one or more selected secondary schools as leading schools and inclusion of the entire school system into 1,220 school clusters of which a single cluster school contains approximately 8‑12 numbers of schools.\n\n*\tRecruitment of required officers for the Sri Lanka Education Administrative Service and Teacher Advisors' Service.",
  "key": "2024-06-03-003-0b11"
}