{
  "date_str": "2024-06-11",
  "decision_num": 11,
  "title": "Submission of the Imports and Exports (Control) Regulations No.07 of 2024 and Standardization and Quality Control Regulations issued under the Imports and Exports (Control) Act, No.1 of 1969 to Parliament for approval",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12588",
  "decision_details": "- Even though, importation of vehicles into Sri Lanka has been temporarily suspended in terms of the provisions of the Imports and Exports (Control) Regulations No. 02 of 2023, as per a proposal made by the Minister of Tourism and Lands, approval of the Cabinet has been granted at the meeting held on 2024 04 01 to import 250 mini coaches and 750 vans for tourist transportation. Accordingly, in order to implement the said decision, Imports and Exports (Control) Regulations No.07 of 2024 have been promulgated under the Imports and Exports (Control) Act, No.1 of 1969.\n \nFurther, Cabinet has granted approval on 2024 03 11 to impose Regulations enabling to facilitate expeditious, safer and effective trade flows as well as to ensure a level playing field for domestic products and imported products by canceling the Imports and Exports Control (Standardization and Quality Control) Regulations 2017 which had been imposed under the provisions of the Imports and Exports (Control) Act, No.1 of 1969 in order to establish standards and quality on importation of 122 categories of goods, classified under 217 HS Codes with a view to safeguarding the national economy, public health and environment. Accordingly, Standardization and Quality Control Regulations under the Imports and Exports (Control) Act, No.1 of 1969 have been promulgated. The proposal made by the Hon. President, in his capacity as the Minister of Finance, Economic Stabilization and National Policies to submit the said Regulations published through the Gazette Extraordinary Notifications, to Parliament, for approval, was approved by the Cabinet.",
  "key": "2024-06-11-011-3cd5"
}