{
  "date_str": "2015-12-23",
  "decision_num": 8,
  "title": "The proposed Memoranda of Understanding to be signed between the Democratic Socialist Republic of Sri Lanka and the Government of Pakistan",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6488",
  "decision_details": "- The proposals made by the Prime Minister, Hon. Ranil Wickremasinghe, in his capacity as the Minister of National Policies and Economic Affairs and Hon. (Dr.) Harsha de Silva, the Acting Minister of Foreign Affairs, to sign the following Memoranda of Understanding (MoUs) between Sri Lanka and Pakistan, during the scheduled visit to Sri Lanka by the Prime Minister of Pakistan, H.E. Nawaz Sharif, in the first week of January 2016, was approved by the Cabinet: \n\n*\tMoU between the Ministry of National Policies and Economic Affairs of the Democratic Socialist Republic of Sri Lanka and the Ministry of Youth Affairs of  the Islamic Republic of Pakistan on Co-operation in the field of Youth Development. \n\n*\tMoU on Sharing of Statistical and Census Data between Pakistan and Sri Lanka.\n\n*\tMoU between the Ministry of Science, Technology and Research of Sri Lanka and the Ministry of Science and Technology of Pakistan on Science, Technology and Innovation Co-operation;\n\n*\tMoU for Scientific & Technological Co-operation between the National Science Foundation of Sri Lanka  and  the Pakistan Science Foundation;\n\n*\tMoU between Trade Development Authority of Pakistan and the Export Development Board of Sri Lanka;\n\n*\tAgreement on Co-operation in the field of health between Sri Lanka and Pakistan;\n\n*\tMoU between Sri Lanka and Pakistan on Co-operation in the field of Culture;\n\n*\tMoU between the Gem and Jewellary Research and Training Institute of Sri Lanka and the Pakistan Institute of Fashion and Design;\n\n*\tMoU between Sri Lanka and Pakistan concerning the Co-operation in the Exchange of Financial Intelligence related to Money Laundering and Terrorism Financing;\n\n*\tAgreement between Sri Lanka and Pakistan for Bilateral Co-operation on Prevention and Deterrence of Money Laundering and Terrorist Financing;",
  "key": "2015-12-23-008-88bd"
}