{
  "date_str": "2015-12-16",
  "decision_num": 1,
  "title": "Establishment of a Secretariat for Coordinating the Reconciliation Mechanisms",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6459",
  "decision_details": "- The  golden opportunity dawned for Sri Lanka in May 2009, subsequent to the conclusion of the conflict, to achieve reconciliation and a durable peace lost due to various reasons. The restoration of reconciliation among Sri Lankans has become an essential matter which needs to be attended to without further delay. Currently, various Government Institutions including Ministries work on building reconciliation in the country. However, the absence of a central entity to coordinate such activities has led to several practical problems such as undue delays in implementing decisions and programmes as well as duplication of work.  Therefore,  in order to effectively implement the decisions, programmes and processes related to Reconciliation Process, the proposal made by the Prime Minister, Hon. Ranil Wickramasinghe, to establish a Secretariat of Coordinating the Reconciliation Mechanisms (SCRM) which bears the following responsibilities, in the Prime Minister's Office, with immediate effect, was approved by the Cabinet.  \n\n*\tCoordinating national level consultations on reconciliation mechanisms. \n\n*\tdeveloping a time-bound plan for the setting up of relevant reconciliation mechanisms such as 'the Office on Missing Persons', 'the Commission for Truth, Justice, Reconciliation, and Non -recurrence'.  \n\n*\tcoordinating with the domestic institutions including Sri Lanka Human Rights Commission and as well as with the international institutions such as the Office of the United Nations High Commissioner for Human Rights (OHCHR). \n\n*\toversee progress and coordinate implementation of the recommendations contained in the Lessons Learnt and Reconciliation Commission (LLRC) Report, other Commission Reports and Report of the OHCHR. \n\n*\tcoordination of any other requirement relating to strengthening of the Rule of Law, Human Rights and administrative and judicial reforms.",
  "key": "2015-12-16-001-f70b"
}