{
  "key": "2025-05-26-007-e87d",
  "title": "Implementation of Stage 2 of the Mahaweli Water Security Investment Programme",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=13179",
  "decision_details": "- Approval has been granted at the Cabinet meeting held on 2015-04-22 to implement the Stage 1 of the Mahaweli Water Security Investment Programme which consists of 02 stages under the Multi-Tranche Financing Facility of the Asian Development Bank. However, due to the reasons such as exceeding the estimated quantities and costs of the contract packages, Covid-19 pandemic prevailed in the country and the economic crisis, the relevant programme could not be completed as expected. Therefore, the Asian Development Bank has granted its concurrence to restructure and implement the remaining components of this programme in several phases according to a prioritized sequence. Accordingly, it has been planned to implement Stage 2 of the Mahaweli Water Security Investment Programme which includes activities of the completion of irrigation infrastructure facilities of the North Central Province Canal and the establishment of a commercial agriculture development programme with improved water distribution systems in the areas connected to the North Central Province Canal. Under that Stage, it is expected to achieve the benefits of increasing the cropping intensity rate across major irrigation systems of Hurulu Wewa, Manankattiya, Eruwewa, Mahakanadarawa, Nachchaduwa, Nuwara Wewa and Thisa Wewa, providing 40 million cubic meters of water annually for the drinking water needs of the North Central Province and improving the livelihoods of farmers. Accordingly, the proposal made by the Minister of Agriculture, Livestock, Land and Irrigation to hold discussions with the Asian Development Bank and co-financing institutions to secure the necessary funds to implement the Stage 2 Project of the Mahaweli Water Security Investment Programme, was approved by the Cabinet.",
  "date_str": "2025-05-26",
  "decision_num": 7
}