{
  "key": "2025-05-26-006-16eb",
  "title": "Establishing a multi-sectoral mechanism with an integrated approach to protect children from abuse",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=13178",
  "decision_details": "- Protecting children from abuse and all forms of violence against them has been identified as a key principle of the policy commitment 'A Safe World for Children - A Creative Future Generation' of the National Policy Framework of the new Government for which approval has been granted at the Cabinet meeting held on 2025 03 03. There are several parties operating within the state machinery that intervene in various aspects in protecting children.  The Ministry of Women and Child Affairs, the Ministry of Health and Mass Media, the Ministry of Education, Higher Education and Vocational Education, the Ministry of Justice and National Integration and the Sri Lanka Police perform a key role among them. The National Child Protection Authority has provided facilities round the clock to receive complaints about abuse and all forms of violence against children. However, it has been observed that there are also frequent cases where complaints are not submitted in a proper manner. The Cabinet approved the proposal made by the Minister of Women and Child Affairs to take the following measures enabling to intervene in such cases promptly:\r\n\r\n*\tto appoint a Standing National Committee under the Chairmanship of the Secretary, Ministry of Women and Child Affairs and comprised with the representations of other relevant institutions.\r\n\r\n*\tto introduce amendments to the Penal Code and the Code of Criminal Procedure expeditiously, so that corporal punishment against children could be eliminated.\r\n\r\n*\tto expeditiously publish the media code of ethics currently being drafted, incorporating appropriate provisions to prevent child victims from becoming repeat victims in the reporting of such crimes and all forms of violence against children. \r\n\r\n*\tto obtain immediate intervention of the National Authority for the Protection of Victims of Crime and Witnesses, the Secretariat for Non Governmental Organizations and the Telecommunications Regulatory Commission of Sri Lanka, to regulate the activities carried out by media institutions and social media communicators in a manner that harms the identity of child victims.",
  "date_str": "2025-05-26",
  "decision_num": 6
}