{
  "date_str": "2017-06-27",
  "decision_num": 22,
  "title": "Introduction of the Electronic Procurement System into the Public Procurement in Sri Lanka",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7867",
  "decision_details": "- The procurement activities pertaining to the Public Sector forms a considerable part of the Sri Lanka's economy, since about 20% to 25% of the total Government spending is for the procurement of Goods and Services of the Public Sector. Under the present procurement process due to the shortcomings, such as persistent delay in the bid evaluation and the lack of transparency and competition, various problems crop up and this situation has a direct negative impact on the economic development of the country.  \n\nAt the 4th South Asia Region Public Procurement Conference held in Colombo and Kandy from February 20th to 23rd 2017 under the theme of 'Electronic Government Procurement in South Asia - Achievements, Opportunities and Challenges' where H.E. the President participated, it was revealed that except for Sri Lanka, most of the other South Asian countries use the Electronic Procurement System and have shown a remarkable progress. Since, the use of modern technology could minimize the deficiencies found in the procurement process, it is felt that the procurement process also could be re‑oriented accordingly by introducing an Electronic Procurement System.  \n\nAccordingly, the proposal made by Hon. Mangala Samaraweera, the Minister of Finance and Mass Media, to implement the Public Electronic Procurement System in the Public Procurement Process and to appoint an Officials' Committee under the Chairmanship of the Director General of the Department of Public Finance comprising of the representatives of other relevant institutions with the concurrence of the National Procurement Commission, with the responsibility for preparation of an Action Plan, was approved by the Cabinet.",
  "key": "2017-06-27-022-9299"
}