{
  "date_str": "2017-06-27",
  "decision_num": 25,
  "title": "Handing over of the Dr. Neville Fernando Sri Lanka Russia Friendship Hospital to the Government and the proposal for the Future Management Structure of the South Asian Institute of Technology and Medicine (SAITM)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7870",
  "decision_details": "- Although, the Dr. Nevile Fernando Sri Lanka Rusia Friendship Hospital which was established in 2013 to function as a Private Hospital with 500 beds and room facilities with 100 beds achieved a gradual development providing treatment for around 3000 Outdoor patients per month and about 100 Indoor patients, in the face of the present state of affairs, it has been difficult to attract an adequate number of Indoor patients to the hospital required to provide clinical training for Medical Students.  \n\nTaking into consideration, the availability of only a limited number of institutions which provide tertiary health care in the East Colombo area and it being situated in close proximity to the Expressway,the joint proposal made by Hon. (Dr. Rajitha Senaratne, the Minister of Health, Nutrition and Indigenous Medicine and Hon. Lakshman Kiriella, the Minister of Higher Education and Highways to get the Dr. Nevile Fernando Hospital worth of a government valuation of Rs.3.55 billion vested with the government of Sri Lanka, to transfer its full ownership to the government after the settlement of the loan obtained from the Bank of Ceylon for the establishment of SAITM, to provide free medical health care services to the public and to appoint a Governing Board by the Ministry of Health, Nutrition and Indigenous Medicine for the management of the hospital similar in nature to the Administration Structure prevailing in the University of Jayawardenapura, was approved by the Cabinet.  Further, it was also decided that alternative proposals should be presented in consultation with all the related stakeholders to widen the ownership of the SAITM.",
  "key": "2017-06-27-025-bf4f"
}