{
  "date_str": "2017-06-27",
  "decision_num": 26,
  "title": "Long Term Solutions for the Management of Municipal Solid Waste (MSW) generated in the Western Region - Project for the Sanitary Waste  Landfill at Aruwakkalu in Puttalam",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7871",
  "decision_details": "- As a long term solution for the management of Solid Waste of around 1200 MT collected daily in the Metro Colombo, it has been planned to transport the Solid Waste in 20ft containers with the necessary compaction by rail transportation and safe disposal from Kelaniya to the Aruwakkalu Sanitary Landfill to be constructed using the limestone pits which have been abandoned after excavation. Action is being taken to obtain the preliminary environmental investigation reports of the Central Environmental Authority and the Wayamba Provincial Environmental Authority and it is anticipated that the reports will be released by the end of July.  Subsequently, the operational activities of the project is expected to be commenced within 06 to 08 months. \n\nThe World Bank has agreed to provide the funds necessary for this project.  Accordingly, the proposal made by Hon. Patali Champika Ranawaka, the Minister of Megapolis and Western Development, to call for Limited International Competitive Bids and Limited National Competitive Bids in order to select a suitable contractor in accordance with the National Procurement Guidelines to commence the project expeditiously, to acquire the extent of land required for the proposed project from the land at Aruwakkalu owned by the Sri Lanka Cement Corporation, to empower the Standing Cabinet Appointed Procurement Committee to conduct negotiations with the Sri Lanka Cement Corporation, Siam City Cement (Lanka) Pvt Ltd. including the public and private sector stakeholders to obtain the other facilities needed in matters related to its operational activities, acquisition of lands and properties necessary for construction, was approved by the Cabinet.",
  "key": "2017-06-27-026-eb9a"
}