{
  "date_str": "2023-12-18",
  "decision_num": 11,
  "title": "Providing a relief for Public Officers who are entitled to Political Rights and contested at the Local Government Election",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12322",
  "decision_details": "- The Commissioner General of Elections has informed the Ministry of Public Administration, Home Affairs, Provincial Councils and Local Government that it is appropriate to appoint a committee to solve the issues that have arisen due to the indefinite postponement of the Local Government Election 2023. Accordingly, the concurrence of the Election Commission has been received to implement the recommendations of the Report submitted by the Committee appointed by the Secretary of the said Ministry. Based on the recommendations of the said Committee, the proposal made by the Hon. Prime Minister in his capacity as the Minister of Public Administration, Home Affairs, Provincial Council and Local Government to proceed as follows, was approved by the Cabinet:\n\n(i) \tIn case where an officer entitled to political rights who has faced difficulties due to getting transferred to a service station located outside the electorate from which he/she contests the election makes an appeal regarding the same, allowing the said officer to report for duty to his/her permanent place of work after considering it by the Head of the Institution and obtaining an affidavit from the respective officer to effect that he/she is not engaged in political activities, political campaigns or promotions at the relevant place of work.\n\n(ii) \tPayment of basic salary considering the period from 2023‑04‑25 to 2023‑05‑08 as a period of leave with pay.\n\n(iii)\tMaking compulsory to the officers who have submitted nominations for the Local Government Election 2023, to report for duty as per the Public Administration Circular No.07/2023 dated 2023‑05‑08.\n(iv) \tAccordingly, issuance of a Public Administration Circular including the \tabove matters to solve the issues of the Government Officers who have \tentitled to political rights.",
  "key": "2023-12-18-011-0ef5"
}