{
  "date_str": "2023-12-18",
  "decision_num": 6,
  "title": "Granting compensation to the selected families who were deprived of lands owing to construction of Yan Oya Reservoir and the Left Bank Canal, in place of alternative paddy lands to be granted",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12317",
  "decision_details": "- During the construction of the Yan Oya Reservoir, lands belonging to the Divisional Secretariat Divisions of Horowpathana and Gomarankadawala have been acquired and the lands belonging to the Divisional Secretariat Divisions of Horowpathana, Padaviya and Sri-pura have been acquired during the construction of Left Bank Canal. Alternative paddy lands have been granted to a part of the families who have deprived their lands and owing to the non availability of lands in the surrounding area to develop as paddy lands, approval of the Cabinet has been granted at the meeting held on 2023‑03‑20 to grant an additional compensation to the land owners whose lands have been acquired. Accordingly, approval of the Cabinet was granted to implement the following proposals made by the Minister of Irrigation.\n\n* \tSince it is not possible to get released sufficient lands to be granted as alternative paddy lands for the selected families who lost their houses owing to the construction of the Yan Oya Reservoir, for development purposes, payment of a compensation of Rs.1.8 million each, in place of lands for the families to whom alternative paddy lands have not been given so far and who are residing in other areas and whose livelihood is not farming. \n\n*\tSince it is not possible to get released sufficient lands to be granted a alternative paddy lands for the selected families who lost their house owing to the construction of the Left Bank Canal, for development purposes, payment of compensation of 1.8 million rupees in lieu of a 1 1/2 acre paddy field.",
  "key": "2023-12-18-006-0449"
}