{
  "date_str": "2024-11-25",
  "decision_num": 2,
  "title": "Submission of a Supplementary Estimate to Parliament",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12892",
  "decision_details": "- It is required to make necessary provisions through a Supplementary Estimate for incurring and accounting certain essential expenditures in the ensuing period of the year 2024. Accordingly, certain expenditures that have been identified can be made through allocation adjustments within the approved expenditure estimate for the year 2024 and the relevant adjustments can be made without exceeding the overall expenditure limits approved by the Appropriation Act for the year 2024 and without any impact on the credit ceiling of the Government. Accordingly, the proposal made by the Hon. President in his capacity as the Minister of Finance, Planning and Economic Development to submit a Supplementary Estimate amounting to Rs. 219,373 million to Parliament through a resolution for the following purposes, was approved by the Cabinet:\n\n(i) \tMaking provisions of Rs.130,000 million to the Department of Public Enterprises for the payment of interest subsidy to banks due to restructuring of the debt of the Ceylon Petroleum Corporation, which was transferred to the balance sheet of the Government of Sri Lanka.\n\n(ii) \tMaking provisions of Rs.18,000 million to the Department of Treasury Operations to account the exchange parity loss incurred on the balance of accounts held in the name of Deputy Secretary to the Treasury due to the appreciation of Sri Lankan Rupee against the United States Dollar.\n\n\n \n(iii) \tMaking provisions of Rs.32,641 million to the Department of Development Finance for the reimbursement of additional interest payments incurred by banks in providing special interest rates to Senior Citizens.\n\n(iv) \tMaking provisions of Rs.9,829 million to the Ministry of Education to account the value of the school uniform materials provided by Government of China as a Grant.\n\n(v) \tMaking provisions of Rs.8,331 million to the Sri Lanka Air Force to account and pay taxes for the value of 02 Aircrafts received by the Sri Lanka Air Force as a Grant from the United States of America.\n\n(vi) \tMaking provisions of Rs.1,400 million to the Department of Pensions for the payment of increased pension allowances.\n\n(vii) \tMaking provisions of Rs.3,213 million to the Ministry of Finance, Planning and Economic Development for the reimbursement of payments made by the Central Bank of Sri Lanka to financial/legal advisors in connection with the Debt Restructuring Process.\n\n(viii) \tMaking provisions of Rs.1,533 million to the Department of National Budget to account the emergency relief received as a Grant from the Government of China for the Ministry of Fisheries to provide relief for small-scale fishermen in Northern and Eastern Provinces.\n\n(ix) \tMaking provisions of Rs.10,826 million to the Department of National Budget to account the value of fuel stocks received by the Ministry of Health from the Government of Japan as a Grant for the needs of the health sector and payment of duties amounting to Rs. 5,225.5 million.\n\n(x) \tMaking provisions of Rs.1,800 million to the Department of National Budget for granting additional provisions to the Ministry of Education to increase the daily cost to be incurred per student from Rs.85/- to Rs.110/-, in connection with the School Nutrition Programme. \n\n(xi) \tMaking provisions of Rs.400 million to the Department of National Budget for granting additional provisions to the Ministry of Defence to pay compensation for the renovation of damaged properties due to natural disasters.\n\n(xii) \tMaking provisions of Rs.1,400 million to the Department of National Budget for granting additional provisions to the Department of Prisons required due to increase of expenditure on diets as a result of the increase in the number of inmates in prisons of the Department of Prisons and the rising of the prices of food.",
  "key": "2024-11-25-002-05af"
}