{
  "date_str": "2016-08-01",
  "decision_num": 1,
  "title": "Port City Development Project/The Proposed Finance City Project - Changes suggested to the Original Agreement signed in September 2014",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6945",
  "decision_details": "- A summary of the proposed changes to be included in the Original Agreement signed in September, 2014 is given below. \nFreehold land \n\n*\tAs per the Original Agreement signed by the previous Government in  September, 2014, 20 hectares of land were to be granted to the CHEC Port City (Pvt).Ltd. (the Project Company) on a freehold basis, with the balance land to be granted on a 99 year lease.\n\n*\tAccording to the new Agreement negotiated by this Government, any freehold land will not be granted and all the lands will be allocated to the Project Company will be granted on a 99 year leasehold basis.  The Project Company may lease out this 20 hectares of land for another 99 years if not required by the Government.\n\tRole of  Sri Lanka Ports Authority (SLPA) and Urban Development Authority (UDA)\n\n*\tThe Original Agreement signed by the previous Government required the SLPA Act to be amended so that the SLPA would receive 62 hectares of land from the Project Company for its own use and development.  This is restricted to the objectives of the Ports Authority as stated in Section 6 of the Act. Though at that time the then Government claimed that Sri Lankan land could be used for real estate development, such a grant of powers is not mentioned under Section 6.\n\n*\tUnder the new Agreement, the SLPA will not undertake real estate development and its responsibilities would be limited to activities dictated under the present SLPA Act.  It was therefore decided that the UDA is the most appropriate authority to whom the reclaimed land would be allocated.\nRole of Ministry of Megapolis and Western Development \n\n*\tUnder the original agreement the Ministry of  Ports and Shipping undertook to fulfill all obligations of the Government including amending the SLPA Act.\n\n*\tThe Ministry of Megapolis and Western Development (on behalf of the Government), the UDA, together with the Project Company, will now sign a new Tri Partite Agreement replacing the original agreement signed by the previous Government on 16th September 2014.\nLegal status of the land to be reclaimed  \n\n*\tUnder the Original concessionary agreement signed by the previous Government, the status of the reclaimed land was unclear.  It was not part of the District of Colombo.   Therefore, it did not come under the territory of Sri Lanka under Article 5 of the Constitution.  The new law will make it part of the Administrative District of Colombo and it will come under the Financial City Corporation distinct from the Colombo Municipal Council.\n\n*\tUnder  the Original Agreement, the SLPA would execute a master lease to the Project Company.\n\n*\tUnder  the  new Agreement, all reclaimed land will be gazetted under the Lands Ordinance by H.E the President and then allocated to the UDA at which point the UDA will declare such lands as a Development Area under the UDA Act.  This will happen before land is leased on 99 year basis to the Project Company as mentioned above.\nFisherman's Income support programme \n\n*\tUnder the Original Agreement, the responsibility of funding the income support programme for  fishermen was a responsibility of the SLPA.  No such programme was implemented by the previous administration of the SLPA .\n\n*\tUnder the new Agreement, the Project Company will allocate Rs. 500 million towards the fishermen's income support program to the Ministry of Megapolis and Western Development to implement the programme in consultation with the Ministry of Fisheries and Aquatic Resources Development. \nUtilities and Transport Infrastructure \n\n*\tUnder the Original Agreement, all investments in roads and utilities within the reclaimed area was the responsibility of the Project Company while providing all utilities and road infrastructure up to the periphery of the site was the responsibility of the Government of Sri Lanka (GoSL).\n\n*\tUnder the new Agreement, the possibility of undertaking public-private partnerships through the Project Company will be evaluated as a long term solution to ease the GoSL's responsibility of undertaking provision of road infrastructure and utilities up to the periphery of the site.\nManagement and Maintenance of the Reclaimed area \n\n*\tUnder the Original Agreement, an Estate Management Company (EMC), 100% owned by the GoSL would manage, maintain and repair the common areas of the Port City by collecting management charges from investors.  However, until such time the EMC is self-sustainable, GoSL or SLPA would have had to inject funds for the operation of the EMC.\n\n*\tIn order to ease the GoSL's obligation to fund such a venture, under the new agreement, the Project company has agreed to consider establishing and operating the EMC in partnership with GoSL.\nLimits imposed on developing lands of the GoSL\n\n*\tThe Original Agreement limits the developments GoSL could undertake on its land during three years from the completion of reclamation, to educational and cultural activities only.\n\n*\tUnder the new agreement the above has been expanded in favour of GoSL to include healthcare and hospitals and exhibition and convention centres and the new Colombo International Financial Centre (CIFC).  Also, no restriction will be placed on developing the North and West Ports of the Colombo Harbour.  In addition, the Project Company has agreed to the setting up of the CIFC building in the land area reclaimed first, including making a new investment in the CIFC building no sooner than it is technically feasible to build on reclaimed land and upon mutually acceptable terms being agreed with the GoSL after a feasibility study.\nCompensation Claims\n\n*\tIn view of the goodwill created by the visits of H.E. the President and the Hon. Prime Minister, to China, the Project Company has agreed to withdraw all compensation claims for losses incurred due to the suspension of the project caused by the failure of the previous Administration of the SLPA to obtain the required environmental permits.\n\n*\tIn their original Master Plan there was provision for night racing.  They had fully abandoned that plan at present. In view of this, a large extent of marketable land becomes available.  Out of this, 2 hectares may be allocated to them.  This will be a good gesture to reciprocate their goodwill in completely waiving off all compensation claims.\n\n*\tThe above proposal was acceptable to the GoSL since the Project Company has agreed in the new Master Plan approved by the UDA this year to increase public lands (parks, roads, walkways etc. to be used by the general public)  by 28 hectares more than originally planned to make Port City more attractive to the public.  For example, when completed Port City will have 45 hectares of parks and 13 hectares of artificial beaches (compared to 5.7 hectares available to the public at Galle Face Green).\nEnvironmental Approvals\n\n*\tUnder the original Agreement, the responsibility for undertaking to obtain and financing all environmental approvals for the Project was a responsibility of the SLPA.  There were short-comings in the environmental approvals obtained by the former administration of the SLPA.\n\n*\tA comprehensive new Supplementary Environmental Impact Assessment (SEIA) was carried out by the Ministry of Megapolis and Western Development in 2015 to address such shortcomings, with the cooperation and funding extended by the Project Company.\nNew environmental conditions\n\n*\tUnder the original EIA study carried out in 2011, 42 conditions were imposed by the Department of Coast Conservation (CCD) in its Development Permit.\n\n*\tUnder the new SEIA carried out by the Ministry of Megapolis and Western Development for 269 hectares of reclaimed land and made available for public comments in December 2015, the new Development Permit issued by the CCD includes 70 conditions to mitigate the impact on the environment.\nChange of status\n\n*\tThe previous administration considered this as a Land Reclamation Project to be utilized for real estate, sports, education and cultural development including night racing tracks etc.  Therefore, the bulk of the land was not available for real estate development by the Government.\n\n*\tNow it has been agreed with the Government that this land would be used to build a Financial City to fill the vacuum between Singapore and Dubai.  This will enable offshore operations.  For this purpose, the Government will propose new laws for governing offshore activities, like in Dubai.  The Financial City will act as a major income earner and an employment provider for Sri Lanka.",
  "key": "2016-08-01-001-a86a"
}