{
  "date_str": "2016-08-23",
  "decision_num": 3,
  "title": "Liberalization of Lubricant Industry",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6999",
  "decision_details": "- As of now, a total of 13 institutions including the Ceylon Petroleum Corporation and the Lanka Indian Oil Company PLC remain in the lubricant industry in Sri Lanka.  However, due to issues such as non-issuance of new licenses for entry to the lubricant industry, non-revision of biannual registration and license fee since 2006 and the non-existence of an independent regulator, Sri Lanka has not been able to obtain the benefits of the lubricant industry.  Accordingly, the following proposals made by Hon. Ravi Karunanayaka, the Minister of Finance in relation to the implementation of the Budget Proposal 2016, presented with a view to facilitating an effective competition in the Lubricant Industry in Sri Lanka, was approved by the Cabinet - \n(i)\tcalling of applications through the Ministry of Petroleum Resources Development, for the issuance of new licenses to those interested in entering the lubricant industry; \n(ii)\trevision of the biannual fixed registration fee/license fee from Rs.1 million up to Rs.2 million and the maximum registration fee from Rs.5 million to Rs.6 million, with immediate effect; \n(iii)\tinstruct the Sri Lanka Standards Institute (SLSI) to issue National Standards Conformity Certification for both the imported and the locally blended lubricants;\n(iv)\tempower the Public Utilities Commission of Sri Lanka (PUCSL)to function as the regulator of the lubricants industry; \n(v)\tinstruct the Consumer Affairs Authority (CAS) to  enforce the regulations required for the provision of high quality lubricant products to the public;\n(vi)\tinstruct the Sri Lanka Customs and the Department of Import and Export Control, to strictly enforce the guidelines issued by the Ministry of Petroleum Resources Development.",
  "key": "2016-08-23-003-deba"
}