{
  "date_str": "2020-10-05",
  "decision_num": 13,
  "title": "Minimum number of students in a classroom in a school",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10657",
  "decision_details": "-The Principals follow the circular instructions issued by the Ministry of Education for the admission of students to Grade 1. Similarly, admission of students to Grade 6 of the National and Provincial Schools based on the merits of the Scholarship Examination and admission of students to the Advanced Level classes based on qualifications of the Ordinary Level Examination are conducted by the relevant Principals.\nIn addition, as per the Circulars: No.37/2008 and 33/2019, students are enrolled to intermediate classes with the recommendations of the school Principals. The students who qualify to be enrolled into intermediate classes include the groups on the basis of change of residence due to transfers, arrive from abroad, elected to Parliament, Judges in Judicial Service, Government Specialist Medical Officers , Government Medical Officers, employees of schools,  Ministry of Education and in affiliated departments thereof, University Lecturers and Executive Officers, Officers in Sri Lanka Education Administrative Service and Sri Lanka Teacher Educators Service. \nMoreover, students who were subjected to injustice in the admission process and subsequently being found as qualified at the investigations conducted in this regard, students with special needs and children in social welfare centers are groups eligible to enter  to  intermediate classes.\nAccordingly, the proposal made by the Minister of Education to revise the existing procedure for admission of students and introduce a more transparent mechanism enabling to increase the number of students that could be admitted to a class, taking into consideration the high demand for admission of students to the schools, was approved by the Cabinet.",
  "key": "2020-10-05-013-3752"
}