{
  "date_str": "2020-10-19",
  "decision_num": 9,
  "title": "Single Use Plastic and Polythene Waste Management",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10682",
  "decision_details": "-Regulations such as banning the production of polythene of 20 microns or below, banning the manufacture of polythene food wrappers, and banning the open burning of polythene in the open environment have been promulgated with effect from 2017‑09‑01, in order to minimize the environmental damage caused by polythene and plastics within Sri Lanka and steps have also been taken by the Central Environmental Authority, to promote other alternatives instead of the banned polythene while the said regulations are in force.\n\t\n\tIn accordance with the consensus arrived at the discussions held with the relevant stakeholder institutions on Polythene and Plastic Management, the proposal made by the Minister of Environment, to ban the following Polythene and Plastic products in order to minimize single use Polythene and Plastic products with effect from 2021‑01‑01 and introduce other alternatives instead, was approved by the Cabinet.\n\n*\tProhibition of wrapping of chemicals or insecticides in Poly Ethylene Terephthalate (PET) and Poly Vinyl Chloride (PVC) containers and to use containers made of glass or other raw materials as an alternative.\n\n*\tProhibition of sachets made of polythene and plastic less than 20 ml / 20 g (other than for the use of packing food and medicine) and use containers of 100 ml/ 100 g or bigger as an alternative.\n\n*\tProhibition of various inflatable toys made out of plastic (excluding balloons, balls and water floating toys) and use the toys made of Eco-friendly and hygienic raw material as an alternative.\n*\tProhibition of plastic cotton buds (excluding materials used for medical treatments) and use cotton buds made from biodegradable materials, as an alternative.\n\n*\tMandating to indicate the 1-7 Codes for identification of internationally prescribed plastic to promote the recycling of all plastic products.",
  "key": "2020-10-19-009-739e"
}