{
  "date_str": "2020-10-05",
  "decision_num": 1,
  "title": "Promulgation of Regulations on maintaining 'Special Deposit Accounts' under the Foreign Exchange Act, No.12 of 2017",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10645",
  "decision_details": "-Approval of the Cabinet has been granted at its meeting held on 2020‑04‑08 to make Regulations under the  Foreign Exchange Act, No.12 of 2017 to open and maintain current deposits in the name of 'Special Deposit Accounts' to deposit the foreign currency remitted to the country through  the banking system for a period of 06 months with the view to encouraging the influx of foreign exchange  into the country. Accordingly, the validity period of the Regulations due to expire on 2020‑10‑07 and as such, the Monetary Board of the Central Bank of Sri Lanka has made following recommendations so as to further retain the foreign exchange remitted to the Sri Lanka -\n\n* \tPayment of interest  rates on normal term deposits for the 'Special Deposit Accounts'  renewed and maintained after maturity.\n\t\n* \tGranting permission to transfer the income on maturity of the 'Special Deposit Accounts' to the other accounts in Sri Lanka.\n\n* \tto credit the income of 'Special Deposit Accounts' of resident individuals but who are not eligible to open Foreign Currency Account (Non Government Organizations, Guarantee Companies etc.) on maturity, to a LKR account, subject to the condition that such income shall not be remitted outside Sri Lanka in the future.\n\n\tAccordingly, the proposal made by  the Hon. Prime Minister in his capacity as the Minister of Finance, to promulgate  new Regulations in terms of section 7 of the Foreign Exchange Act to be read  with the section 29 therein, in addition to the Regulations published in the Gazette (Extraordinary) Notification No. 2170/4 dated 2020‑04‑08 and No. 2182/32 dated 2020‑07‑01 with regard to the Special Deposit Accounts and to present the said Regulations in Parliament for approval, was approved by the Cabinet.",
  "key": "2020-10-05-001-8cba"
}