{
  "date_str": "2020-10-12",
  "decision_num": 15,
  "title": "Implementation of the recommendations made by the Presidential Commission pertaining to Edirisinghe Trust Investment Limited",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10673",
  "decision_details": "-A Presidential Commission under the chairmanship of retired Supreme Court Judge, K.T.Chithrasiri was appointed by H.E the President on 2020.01.09 to investigate, examine and report on the alleged wrongdoings, irregularities and malpractices which are said to have taken place relating to Edirisinghe Trust Investments Limited. The said Commission submitted the report containing its observations and recommendations to H.E the President on 2020‑10‑06. The aforesaid Commission, by its observations and recommendations has pointed out that many offenses have been committed under the Companies Act, the Finance Companies Act, Prevention of Money Laundering Act, Financial Reporting Act, the Legal Framework for the transfer of lands to foreigners as well as the Penal Code. Moreover, it has also been pointed out by the above Report of Presidential Commission, the need of fully re-organize the Department of Supervision of Non-Bank Financial Institutions of the Central Bank of Sri Lanka. Accordingly, bringing the aforesaid matters to the notice of the Cabinet, the following proposals made by H.E the President, were approved by the Cabinet. \n\n    • to direct the Attorney General to take legal actions expeditiously to implement the recommendations of the above Report of Presidential Commission pertaining to the irregularities of the financial and property transactions of Edirisinghe Trust Investment Limited.\n      \n    • to inform the Ministry of Finance to formulate a new institutional structure to regulate Financial Companies by fully re‑organizing the Department of Supervision of Non‑Bank Financial Institutions of the Central Bank of Sri Lanka.\n      \n    • to submit the said Report of the Commission and the measures to be taken accordingly in Parliament, through the Minister of Justice.",
  "key": "2020-10-12-015-e8ba"
}