{
  "date_str": "2020-10-05",
  "decision_num": 2,
  "title": "Amendments to the Workmen's Compensation Ordinance No.19 of 1934 \t(Chapter 139)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10646",
  "decision_details": "-In the policy statement of “Vistas of Prosperity and Splendour” under the heading of “a Culture of Working for the Country”, it has been stated that action would be taken to amend the Workmen's Compensation Ordinance No.19 of 1934 and  increase the compensation payment entitled to the employees in the event of a sudden accident. \n\n\tAccordingly, a draft Bill has been prepared by the Legal Draftsman to amend \tthe relevant provisions of the Workmen's Compensation Ordinance in order \tto increase the compensation to be paid to the employees injured due to a \tsudden  accident and it has been observed that the said draft has to be to further \tamended in view of the following reasons. \n\n    • to increase the fine of Rs 1000 that could be imposed in terms of the existing provisions in a situation where employers fail to submit the statement of compensation to the Commissioner for Worksmen's Compensation in respect of an accident caused to an employee under section 42 of the  the Workmen's Compensation Ordinance.\n      \n    • to amend the  Schedule IV of the  the Workmen's Compensation Ordinance which indicates the amount of compensations as follows to suit the current situation:\n      \n          i \tto increase the minimum monthly wage applicable for the \tpayment of compensation from Rs. 0 to Rs 10,000/- which \tprevails from Rs. 0 to 2,500/- at present.\n\n          ii\tto revise the maximum monthly wage applicable for the \tpayment of compensation from Rs. 100, 000/- upwards which \tprevails from Rs. 20,001/- upwards at present. \n          \n          iii\tto increase the amount of compensation paid in the event \tof death (on the basis of the wage) from Rs. 1,140,000/- \tto 2,000,000/- which prevails from Rs. 181,665/- to 550,000/- \tat present.\n          \n          iv\tto increase the amount of compensation paid in a permanent \ttotal \tdisablement (on the basis of the wage) from \tRs.1,200,000 to Rs. 2,000,000/- which \tprevails from \tRs.196,083.80 to Rs. 550,000/- at present.\n          \n          v\tto increase the amount of compensation paid in a temporary \tdisablement \t(on the basis of half-monthly wage) from Rs. \t5,000 to  Rs. 47,500/- which prevails from Rs. 1,320 to Rs. \t5,500/- at present.\n          \n    • to fulfill the task of  recovering the compensation to confiscate the property through the Fiscal/Registrar attached to the Office of the Commissioner for Workmen's Compensation, in order to expedite the process of recovery of compensation.\n      \n    • to introduce a new insurance scheme for workmen's compensation. \n\n\n\tAccordingly, the proposal made by the Minister of Labour to further amend the \tdraft Bill prepared by the Legal Draftsman so as to incorporate the above \tamendments as well, was approved by the Cabinet.",
  "key": "2020-10-05-002-4309"
}