{
  "date_str": "2015-04-22",
  "decision_num": 10,
  "title": "Right to Information Bill",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6047",
  "decision_details": "- It has been pledged that the draft Bill on Right to Information will be presented in Parliament under the 100 Days Programme of the Government.  Accordingly, the proposal made by the Prime Minister Hon. Ranil Wickremasinghe to present the above Bill in Parliament as an urgent Bill as provided for in the Article 122 of the Constitution, was approved by the Cabinet.  The salient features of the above Bill are as follows: \r\n\r\n*\tThat the Right to Information is afforded to every citizen of Sri Lanka.\r\n\r\n*\tThe right of access to information is the right to obtain such information from the possession, custody or control of a public authority.  Nevertheless, the access to information may be refused in the following instances where:\r\n\r\n(i)\tthe information relates to personal information, the disclosure of which has no relationship to public activity or interest or which would cause invasion of the privacy of the individual.\r\n\r\n(ii)\tthe information, the disclosure of which would seriously affect the defence of the State or its territorial integrity or national security or is likely to be seriously prejudicial to Sri Lanka's international relations or its obligation under the  International Law.  \r\n\r\n(iii)\tthe information, the disclosure of which would cause  serious prejudice to the economy of Sri Lanka.\r\n\r\n(iv)\tthe information, the disclosure of which would  reveal any trade secrets or cause harm to commercial interests of any person.\r\n\r\n(v)\tthe information, the disclosure of which would  reveal the medical reports relating to any person. \r\n\r\n(vi)\tthe information, the disclosure of which is not permitted under Section 126 of the Evidence Ordinance. \r\n\r\n(vii)\tthe information, which is required to be treated as confidential due to the existence of a fiduciary relationship. \r\n\r\n\r\n(viii)\tthe information relates to prevention or detection  of any crime or the  apprehension  or prosecution of offenders or  the disclosure of which would cause obstruction to such activities.  \r\n\r\n(ix)\tthe information, which is held in confidence by the relevant public authority. \r\n\r\n(x)\tthe information, the disclosure of which would result in contempt of Court or impinge the privileges of Parliament. \r\n\r\n(xi)\tthe information, which relates to an examination conducted by the Department of Examinations or Higher Educational Institution which is required to be kept confidential.  \r\n\r\n*\tThe Right to Information Commission will be established to facilitate the implementation of the right of access to information.  This Commission will intervene to determine the information required to be  maintained in confidence.     \r\n\r\n*\tThe effective implementation of the provisions of this Bill is entrusted with the Minister in-charge of the subject of Public Administration.",
  "key": "2015-04-22-010-2c7b"
}