{
  "date_str": "2015-04-22",
  "decision_num": 11,
  "title": "National Audit Bill",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6048",
  "decision_details": "- It has been pledged that a National Audit Bill will be presented in Parliament under the 100 Days Programme of the Government.  Accordingly, the proposal made by the Prime Minister, Hon. Ranil Wickremasinghe to present the above  Bill in Parliament as an urgent Bill as provided for in the Article 122 of the Constitution with a view to ensuring the effective implementation of the powers vested in Parliament over Public Finance Management through the Constitution, was approved by the Cabinet. The salient features of the above Bill are as follows: \r\n\r\n*\tthe Bill provides for any member of the public the right to bring to the notice of the Auditor General any matter and the Auditor General may inquire into such matters and submit a report thereon to the Parliament.  \r\n\r\n*\twhen there are no auditing standards specified in Sri Lanka for performance audits, technical audits etc.,  the International Standards shall apply.\r\n\r\n*\tthe Bill casts a duty on an Audit Officer not to disclose any information received by him in the course of performing his duties. \r\n*\tthe Auditor General shall submit a report annually to the Parliament on the results of the audits carried out by him during the year.  \r\n\r\n*\tthe Auditor General shall submit to the Parliament the Technical Reports once in every three years.  \r\n\r\n*\tAn Audit Service Commission, the members of which are appointed by the President, will be established. \r\n\r\n*\twith effect from the date the proposed Bill comes into operation, the Auditor Generals' Department will cease to function and its functions will be vested in the Audit Service Commission. The staff attached to the Department will be absorbed into the new Commission.",
  "key": "2015-04-22-011-c713"
}