{
  "date_str": "2017-11-14",
  "decision_num": 19,
  "title": "Amendment of the  Concession Agreement signed for the improvement of the Port of Hambantota by a Public-Private Partnership (PPP)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8379",
  "decision_details": "- The Sri Lanka Ports Authority (SLPA), Government of the Democratic Socialist Republic of Sri Lanka (GOSL), China Merchants Port Holdings Company Limited (CM Port), Hambantota International Port Group (Private) Limited (HIPG) and the Hambantota International Port Services Company (Private) Limited (HIPS) entered into a Concession Agreement on 2017-07-29 pertaining to the development of the Hambantota Port by a Public-Private Partnership (PPP).  As per the provisions of the aforesaid Concession Agreement, the relevant parties should fulfill the condition precedents in the Agreement within 180 days from the date of entering into the Agreement and the activities pertaining to same are presently being carried out.   \n\nIn terms of clause 4.2 of the Agreement, after completing the condition precedents the CM Port or the affiliated institutions should make the payment, the 'Investment Value' to the Government of Sri Lanka as follows, - \n\n(i)\tan amount of US$ 5 million has already been deposited in a special account as security deposit and the said amount should be transferred to the Sri Lanka Ports Authority on the effective date of the Agreement; \n\n(ii)\ta 10% of the balance Investment Value (tranche 01) should be paid, after deducting the Security Deposit  within  the period of one month from the effective date of the Agreement; \n(iii)\ta 30% of the  Investment Value (tranche 02) should be paid within the period of three months from the effective date of the Agreement; \n\n(iv)\ta 60% of the  Investment Value (tranche 03) should be paid within the period of six months from the effective date of the Agreement. \n\nAs requested by the Government of Sri Lanka the CM Port has agreed to advance the date of payment of 'Investment Value' and to increase the amount payable on the effective date of the Agreement as follows - \n\n(i)\tpayment of 30% of the remaining balance Investment Value (tranche 01) after deducting the Security Deposit  on the effective date of the Agreement; \n\n(ii)\tpayment of 10% (tranche 02) of the Investment Value within the period of one month from the effective date of Agreement; \n\n(iii)\tpayment of the balance 60% (tranche 03) of the Investment Value within the period of six months from the effective date of Agreement. \n\nAs such, the proposal made by Hon. Mahinda Samarasinghe, the Minister of Ports and Shipping, to amend the relevant clauses of the Concession Agreement to enable to make the relevant payments as stated above and to sign an Addendum to the Agreement, was approved by the Cabinet.",
  "key": "2017-11-14-019-7e7c"
}