{
  "date_str": "2016-07-05",
  "decision_num": 2,
  "title": "Proposals on the measures to be taken with regard to the damages caused to the houses of the residents of the area and business places due to the explosion of ammunition dump in Salawa Army Camp",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6872",
  "decision_details": "- Even though any loss of civilian lives was not reported due to the explosion that occurred in the ammunition dump in Army Camp at Salawa, Kosgama on 2016‑06‑05, movable and immovable properties in 12 Grama Niladhari Divisions around the area have been damaged. Cabinet decided to provide necessary relief, as per the recommendations of the Ministerial Committee appointed under the Chairmanship of Hon. Susil Premajayantha, the Minister of Science, Technology and Research, to examine on the payment of compensation for such damaged houses and business places. Accordingly, Rs.50,000/- per month is being paid to the families, whose houses and business places are damaged, until their resettlement in the said premises and up to now  of around 400 families have been paid Rs.50,000/- each. Since it may take several months to restore normalcy in Salawa and the surrounding area, the proposal made by Hon. Anura Priyadharashana Yapa, the Minister of Disaster Management,  to  provide a  monthly allowance of Rs.50,000/- each, to the rest of the families, whose houses were completely and partially damaged and are unable to resettle in their houses and to provide compensation in respect of the damages to the movable property expeditiously, as per the recommendations of the Assessing Committees appointed for the said purpose, was approved by the Cabinet.  \nIt was also decided by the Cabinet, to instruct the relevant authorities to expedite the activities of providing relief to the residents of the Western Province, including Kolonnawa, who were affected due to the flood disaster that occurred recently.",
  "key": "2016-07-05-002-b5cb"
}