{
  "date_str": "2016-07-26",
  "decision_num": 22,
  "title": "Proposals on the measures to be taken to identify the damages caused to people due to landslides occurred because of the extensive rainfall experienced in the Kegalle District during the period of 10th to 17th May 2016",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6944",
  "decision_details": "- Huge damages were caused each and every Divisional Secretariat Divisions located in the Kegalle District including the Aranayake Divisional Secretariat Division due to extensive rainfall experienced in the said District during the period of 10th to 17th May, 2016.  As a result of these landslides, 151 human lives were lost and a total number of 34,833 people of 9,620 families were adversely affected.  At the Special District Coordinating Committee Meeting held on 2016‑06‑01 at the Kegalle Town Hall, chaired by H.E. the President, instructions were given by His Excellency to take immediate action to bring back to normal, the daily life of the people of the district.   Accordingly, the proposal made by Hon. Anura Priyadharshana Yapa, the Minister of Disaster Management, for the National Insurance Trust Fund to reimburse the losses caused to the partially damaged 1,845 houses, due to above disaster situation; to construct 1,682 new houses for the 1,682 households recommended for  resettlement by the National Building Research Organization (NBRO), including the totally damaged 230 houses, at an estimated cost of Rs.2,018.4 million; to provide a sum of Rs.200 million to 500 beneficiaries, Rs.400,000 each, who are willing to  build houses in their own lands; to declare the landslide affected areas and the areas identified as high-risk areas as areas restricted for settlement; and to entrust the responsibility of providing the necessary instructions on safety measures in respect of the construction of houses, with the NBRO, was approved by the Cabinet.",
  "key": "2016-07-26-022-cf0f"
}