{
  "date_str": "2017-07-25",
  "decision_num": 13,
  "title": "Concession Agreement of the Port of Hambantota",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7981",
  "decision_details": "- The Government of Sri Lanka is expected to enter into a Concession Agreement with the China Merchant Ports Holdings Company Limited (CMPort), with a view to making the operational activities of the Port of Hambantota commercially viable under a Public-Private Partnership. The Agreement submitted previously in this regard to the Cabinet has been reformulated to be more favourable to the country, in consultation with all the relevant stakeholders. According to the new proposed Concession Agreement, 02 companies due to be established in which the state partner will be the Government of Sri Lanka (Sri Lanka Ports Authority) and the relevant investor company will be the private partner. \n\n*\tHambantota International Port Services Co. (Pvt.) Ltd. (HIPS); \n\n\twill be established for the management of the services and common user facilities of the Port of Hambantota and its capital will be US$ 606 million. The Sri Lanka Ports Authority will own 50.7% of the shares of the Company and the remainder of 49.3% will be owned by the CMPort Company.\n\n*\tHambantota International Port Group (Pvt.) Ltd. (HIPG);\n\n\tthe Company to be established for the management of operational assets of the Port, further development activities, its infrastructure facilities and commercialization of cargo handling and other operations, with US$ 794 million of its capital, the Sri Lanka Ports Authority will own 15% of the share capital and 85% by the CMPort Company, identical to the share split  of the SAGT terminal and CICT terminal of the Port of Colombo.  \n\n\tAccordingly, the ownership of shares of the entire investment will be amended as 69.55% to the CMPort Company and 30.45% to the Sri Lanka Ports Authority, as against the share split of 80:20 as proposed in the previous Agreement.  \n\n\tThe freehold right of the Port of Hambantota and the lands thereunder will not be transferred to the investor Company at any time and those lands will be granted to the 02 Companies to be established in partnership with the Government of Sri Lanka, on lease basis under the proposed Agreement. The Sri Lanka Ports Authority will be entitled to purchase the shares of the said two Companies as follows; \n\n*\tAfter 70 years of the date of enforcement of the Agreement;  \n\n\tthe Sri Lanka Ports Authority will be entitled to purchase the shares held by the CMPort and its affiliates and partners in both companies HIPS and HIPG Companies, at a reasonable value to be determined by the Government Valuer or an independent valuer. \n\n*\tAfter 80 years of the date of enforcement of the Agreement;   \n\n\tthe Sri Lanka Ports Authority will be entitled to purchase the shares held by the CMPort, its affiliates and partners in both companies at a cost of US$ 01 and the Sri Lanka Ports Authority will own 60% of the shares of the HIPG Company and 76.8% of the shares of the HIPS Company. \n\n*\tAfter 99 years of the date of enforcement of the Agreement; \n\n\tall shares held by the CMPort, its affiliates and partners in both companies HIPG and HIPS will be transferred to the Sri Lanka Ports Authority by the CMPort  at a cost of US$ 01.  \n\n\tMoreover, the provisions have been incorporated in the proposed agreement  for preventing the  utilization of the Port of Hambantota for military activities and the sole responsibility and the authority of the security of the Port will be with the Government of Sri Lanka.  \n\n\tAccordingly, taking into consideration the proposal made by Hon. Mahinda Samarasinghe, the Minister of Ports and Shipping, the Cabinet granted approval to further seek the views of the parties interested in the proposed concession Agreement, to present the Agreement in Parliament and make amendments where necessary, in accordance with the proposals if any, made therein, thereafter to accept it and sign the same.",
  "key": "2017-07-25-013-a832"
}