{
  "date_str": "2017-07-04",
  "decision_num": 3,
  "title": "Macro-Fiscal Framework for Preparation of the Budget 2018",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7874",
  "decision_details": "- The Zoro-Based Budgeting approach was adopted in the year 2016 and 2017 to prepare the budgetary programmes gradually moving towards the Performance-Based Budgeting over the Medium Term in an orderly fashion. Appropriate measures are being taken to prepare the National Budget 2018 based on the Performance-Based Budgeting.  \n\nAccordingly, the Ministry of Finance and Mass Media, has formulated the 'Medium Term Macro-Fiscal Framework for 2018 - 2020' and the distinguishing elements that characterise this framework include, rationalization of recurrent expenditure, prioritization of capital expenditure and enhancing government revenue organization.  Accordingly, the major outcomes envisioned along the path of fiscal consolidation are as follows: \n\n(i)\tIncreasing the Government revenue up to a 16.5% of GDP \n(ii)\tBringing the Government Recurrent Expenditure to a 14.8% of GDP\n(iii)\tBringing the Government Public Investments to a 5.3% of GDP \n(iv)\tReducing the Budget Deficit up to a 3.5% of GDP \n(v)\tReducing the Outstanding government debt up to a 70% of GDP \n\nBy the achievement of the said targets it will provide the way to contain  the rate of inflation at mid single digit levels and the realization of the Medium Economic growth rate at around 6% - 7%.  In this context, since the capacity of the relevant sectors are required to be broadened to a considerable level, more emphasis will be placed to adopt methods such as Build, Operate and Transfer (BOT) and also the Public Private Partnership Enterprises. Meanwhile, when the budgetary provisions are allocated, provision will be set apart for the new projects, taking into consideration the socio-economic needs and the long term targets on a priority basis.  Here, specially the performance will be based on efficient indexes.  \n\nThe tax policy structure which has already been declared will be further implemented and appropriate measures will be taken for more effective revenue collection.  \n\nAccordingly, the proposal made by Hon. Mangala Samaraweera, the Minister of Finance and Mass Media, to prepare the National Budget for the year 2018 based on the Performance Based Budgeting within the Medium Term Budgetary Framework, and to impose the budgetary limits for line Ministries for the year 2018, taking into consideration the government priority programmes, was approved by the Cabinet.",
  "key": "2017-07-04-003-ff7f"
}