{
  "date_str": "2017-07-18",
  "decision_num": 21,
  "title": "Adoption of expeditious remedial measures to resolve the issues  associated with the Uma Oya Multipurpose Development Scheme",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7968",
  "decision_details": "- The Cabinet at its meeting held on 2017‑06‑27 appointed a Ministerial Sub‑Committee under the Chairmanship of Hon. Mahinda Amaraweera the  Minister of  Fisheries and Aquatic Resources Development and the State Minister of Mahaweli Development to examine and submit a Report to the Cabinet on the difficulties encountered by the residents of the area as a result of the construction of tunnels of the Uma Oya Multipurpose Development Scheme. \n\nAccordingly, the proposal made by Hon. Mahinda Amaraweera, the Minister of  Fisheries and Aquatic Resources Development and the State Minister of Mahaweli Development, to implement the following recommendations expeditiously to provide relief for the difficulties faced by the residents of the area, as a result of the construction of tunnels of the Uma Oya Multipurpose Development Scheme, subsequent to a visit to the relevant area and  discussions had with the relevant parties, was approved by the Cabinet: \n\n*\tHaving made a comprehensive study, to construct six (06) large deep wells associated with the suitable locations.\n\n*\tImplement a special programme to provide water tanks within the next two (02) weeks, to family units, if any, which have not been provided with water tanks so far; \n\n*\tRelease twenty (20) tractor bowsers in the possession of the Ministry of Home Affairs, to the District Secretary, Badulla expeditiously, for further strengthening of the water distribution process; \n\n*\tExpedite the process of the payment of compensation for the damaged properties. \n\n*\tEstablishment of a special unit by the National Buildings Research Institute for a more efficient service. \n\n*\tRelease of a financial provision of Rs.100 million expeditiously to the Provincial Council for the rehabilitation of the Rural Road Network of the affected areas. \n\n*\tStrengthen the 'Secretariat for Relief to Persons' already established to ensure that the relief activities are efficient. \n\n* \tReview of the progress of the relief measures once in two weeks or monthly. \n\n*\tAllocation of funds necessary for expediting the construction work of the proposed Bandarawela Multi Water Scheme from the Budget 2018. \n\n*\tRelease provision of Rs.100 million for the restoration of the affected small reservoirs.   \n\n*\tHand over of the possession of the lands identified to be re‑settled expeditiously to the Divisional Secretary, Bandarawela.  \n\n*\tProvide the necessary additional financial provision to renovate the affected schools expeditiously and put them in order.   \n\n*\tProvide a 2 year relief period for the affected families for the repayment of installments of housing and cultivation loans obtained by them. \n\n*\tImplement a special alternative livelihood development plan expeditiously in the affected areas. \n\n*\tAction to be taken by the Company in Iran to close the water spill in the tunnel. \n\n*\tFuture drilling activities of the project to be considered only on the recommendations of the International Experts and on the recommendations made by a Committee of Local Experts.",
  "key": "2017-07-18-021-eb9d"
}