{
  "date_str": "2017-07-18",
  "decision_num": 5,
  "title": "Phasing-out of Hydrochloroflurocarbon harmful to the Ozone Strata",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7952",
  "decision_details": "- Sri Lanka has been working on minimizing the use of ozone depleting substance known as Hydrochloroflurocarbon, since 1989 and introducing ozone friendly alternative substances, in accordance with the agreements reached and the commitments made with the Vienna Convention and the Montreal Protocol on protection of the Ozone Layer.  Accordingly, the Cabinet at its meeting held on 16‑08‑2016 appointed a Technical Committee to submit short term and long term solutions for imposing limits on the import of  Hydrochloroflurocarbon chemical while also controlling the adverse effects likely to occur on the maintenance and repair of refrigeration and air conditioning systems which necessitate the use of Hydrochloroflurocarbon.  As such, the proposal made by H.E. the President Maithripala Sirisena, in his capacity as  the Minister of Mahaweli Development and Environment, for the implementation of the recommendations of the Committee along with the following recommendations, was approved by the Cabinet: \n\n\n*\tto impose a ban with immediate effect, on the import of used and reconditioned equipment falling within the category with the ozone depleting substances mentioned in the Montreal Protocol. including Refrigerators, Deep Freezers, Air conditioning Systems and Heat Pump Units, Water Coolers, Ice Machines, Vehicle Deep Freezers or Containers.  \n\n*\tto impose a ban with effect from 01‑01‑2018, on the importation to Sri Lanka of equipment or spares manufacturing or assembling in Sri Lanka using the Hydrochloroflurocarbon  exceeding the Global Warming Potential 100, and Ozone Depleting Potential 0.03. \n\n*\tto impose a ban with effect from 01‑01‑2021, on the importation to Sri Lanka, of equipment or spares manufacturing or assembling in Sri Lanka using the Hydrochloroflurocarbon not exceeding the Global Warming Potential 100, and Ozone Depleting Potential 0.03. \n\n*\tto make it mandatory to use Refrigerant Recovery and Recycling Machine with effect 01‑01‑2019 at all work shops which are engaged in  services, maintenance and repair of Refrigeration and Air Conditioning Systems to be incorporated as a condition, when issuing environment protection licenses.",
  "key": "2017-07-18-005-9bb6"
}