{
  "date_str": "2017-07-18",
  "decision_num": 16,
  "title": "The prevention of unauthorized dumping of solid waste in Colombo and the suburban areas and the emergency measures to be taken for controlling of the Dengue Epidemic",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7963",
  "decision_details": "- The Cabinet has already granted approval to prepare an operational mechanism  to minimize the issues faced due to haphazard disposal of solid waste informally in Colombo and the suburban areas. Accordingly, an Operational Office has already been set up in the Ministry of Provincial Councils and Local Government,  integrating the Tri‑Armed Forces, and the Police including other Institutions and the said office receives a considerable number of complaints on a daily basis. The complaints reveal that the required  cooperation of the public is not forthcoming for the disposal of waste and  the haphazard disposal of waste takes place specially during the night. Accordingly, the Joint proposal made by Hon. Faiszer Musthapha, the Minister of Provincial Councils and Local Government  and Hon. Sagala Ratnayake, the Minister of Law & Order and Southern Development to implement the following steps decided upon to be carried out at the meeting held under the Chairmanship of the Prime Minister, was approved by the Cabinet: \n\n*\tinstallation of CCTV Cameras to observe the common sites where unauthorized waste is disposed of and to adopt a methodology to enable the officers of the Operational Office to monitor the images received from such cameras through mobile phones. \n\n*  making it compulsory to exhibit name boards containing all information pertaining to the construction sites in Colombo and the suburban areas, the names of the legal owners of such construction sites and the information regarding the contractor with other details. \n\n*  \tinstituting legal action against persons in their personal name working in such manner as to make way for mosquito breeding in schools, state institutions and other institutions. \n\n*  \tmake regulations under the Public Security Ordinance permitting the entry into premises which are under lock and key to conduct investigations and also to take legal action against such persons.   \n\n*\tto attach the required number of officers to the Operational Office to enable it to operate during the entire 24 hours and to provide such facilities in respect of the above.",
  "key": "2017-07-18-016-91e2"
}