{
  "date_str": "2017-07-18",
  "decision_num": 10,
  "title": "National Health Policy",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7957",
  "decision_details": "- The existing National Health Policy is one which had been prepared in the year 1996 and as such, the need has arisen for the introduction of a new National Health Policy to address the present emerging problems. \n\nAccordingly, within a period of three (03) years from 2014 to 2016 a new National Health Policy has been designed with the participation of professional experts of all sectors of the Health Service, Professionals and the Professional Institutions. In this respect, the concept of the 'Universal Health Coverage' was taken into consideration for the introduction of the new Health Policy aimed at ensuring the rights of patients and social justice centered around the patients and the public.\n\nAs such, the proposal made by Hon. (Dr.) Rajitha Senaratne, the Minister of Health, Nutrition and Indigenous Medicine for the approval of the said National Health Policy designed for a period of 10 years from 2016 to 2025 identifying the following major policy directions, was approved by the Cabinet.\n\n*\tStrengthening of services delivery for achieving the goals of preventive health. \n\n*\tprovision of an appropriate and accessible high quality curative care for all citizens of Sri Lanka.\n\n*\tPromotion of equitable access to qualitative rehabilitation care.\n\n\n*\tEstablishment of a planned methodology based on the service supply data to strengthen the methodologies of uninterrupted service supplies.\n\n*\tDevelopment of new strategies to minimize of out of pocket spending for patients and to reduce of financial risk.\n\n*\tEnsure a comprehensive health system through a better re‑structure including human resource management.\n\n*\tDevelopment of  a strategic partnership with all health care providers.",
  "key": "2017-07-18-010-5c03"
}