{
  "date_str": "2017-07-25",
  "decision_num": 14,
  "title": "Procurement of the required medical equipment for treating Dengue patients and taking expeditious action for controlling the Dengue Outbreak",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7982",
  "decision_details": "- The Cabinet has granted approval to procure some essential medical and laboratory equipment  expeditiously, treating it as an emergency procurement to provide efficient intensive care treatment to Dengue patients, taking into consideration the Memorandum submitted by Hon. Ranil Wickremasinghe, the Prime Minister, and also the Memorandum submitted by Hon. (Dr.) Rajitha Senaratne, the Minister of Health, Nutrition and Indigenous Medicine on the measures to be taken to control the Dengue epidemic.  Accordingly, it was decided to procure  the equipment expeditiously which can be purchased locally, to take necessary action to purchase the rest of the equipment via the Sri Lankan Diplomatic Missions abroad and to allocate a provision of Rs.300 million to the Ministry of Health, Nutrition and Indigenous Medicine for the purpose. \n\nIn addition, it was decided to grant approval to take the following action to prevent the further spreading of Dengue. \n\ni.\tStrictly enforce the circular instructions issued by the Secretary to the President to the effect that the Heads of Departments are accountable for maintaining Dengue free office premises.  \n\nii.\tThe Ministry of Education to carry out the Dengue prevention  programmes in schools with the participation of parents and students. \n\niii.\tThe Western Provincial Council has employed field officers to carry on house to house supervision in order to identify the breeding places of the Dengue mosquito and the same methodology to be followed by the other Provincial Councils. \n\niv.\tThe Ministry of Finance and Mass Media, to produce and broadcast suitable short video programmes/audio programmes to make the general public aware of the importance of preventing Dengue. \n\nv.\tProvide training to 2,000 Sri Lanka Army personnel with the assistance of the Ministry of Health, Nutrition and Indigenous Medicine to  make available the required care and services to the Dengue patients. \n\nvi.\tImplement Dengue Prevention Programmes in the respective areas in collaboration with the Medical Officers of Health (MOH), Local Authority Institutions, Divisional Secretariats and Police Stations.",
  "key": "2017-07-25-014-a7ad"
}