{
  "date_str": "2017-07-11",
  "decision_num": 4,
  "title": "Proper Management of the use of polythene to minimize environmental issues caused by polythene",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7905",
  "decision_details": "- The Cabinet at its meeting held on 06th September 2016 granted approval to appoint a Committee of Experts to prepare a national policy and action plan with a view to managing properly the use of polythene and plastic in order to minimize the environmental issues caused by polythene and plastic. The proposal made by H.E. the President, Maithripala Sirisena, in his capacity as the Minister of Mahaweli Development and Environment, to implement the following short term, middle term and long term activities included in the action plan prepared by the said Committee of Experts so appointed, was approved by the Cabinet.\n\nShort Term Measures: \n\n*\tto ban the use of polythene for decorative purposes of all ceremonies pertaining to national, religious, social and political;\n\n*\tto enforce further the present regulations made for banning the use, sale and production of polythene equal to or less than 20 micron in thickness;\n                          \n*\tto permit the use of polythene of less than 20 micron for essential purposes only with the approval of the Central Environmental Authority;\n\n*\tto ban the import, production and sale of polythene used for domestic use and wrapping food (lunch sheets);\n\n* \tto ban the import, production, sale and use of food storage containers, plastic plates, cups and spoons manufactured using polystyrene as raw material;\n\n*\tto ban the sale of processed and cooked foodstuffs in bags made of  polythene;\n\n*\tto provide environmental friendly biodegradable bags such as paper, pan or cloth bags as alternatives to polythene bags given to customers when purchasing items and to promote the use of degradable plastic material in the production of such bags;\n\n*\tto ban the burning of polythene and plastics in open spaces or premises;\n\n*\tto introduce and promote biodegradable plastic raw material.\n\n\n\nMiddle Term Measures:\n\n*\tto grant tax relief and VAT exemption for the importation of machineries required for productions using biodegradable plastic raw material;\n\n*\tto impose a CESS of 15% upon the import of plastic raw material and plastic products.\n\nLong Term Measures:\n\n*\tto completely ban the importation of recycled plastic raw material.",
  "key": "2017-07-11-004-eb45"
}