{
  "date_str": "2021-02-15",
  "decision_num": 2,
  "title": "Development of Summit Flats Premises for the promotion of construction of Multi-storied Housing Units",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10930",
  "decision_details": "- In order to meet the increasing demand on houses due to the dearth of lands available in the City of Colombo, the Government has paid its attention to identify suitable land blocks and construct multi-storied housing units. The Summit Flats, having established in the year 1976, comprising 176 housing units and 15 bungalows constructed in a land block of 12 acres in extent and located in Keppetipola Road, Colombo 05, under the governance of the Ministry of Public Services, Provincial Councils and Local Government, are being used for official residential requirements of the Public Officers. Most of these housing units are in dilapidated condition at present and the National Building Research Organization (NBRO) has recommended that the said housing units should be fully repaired. Further, around 700 Public Officers are in the waiting list in anticipation of official residences. Taking these matters into consideration, the Ministry of Urban Development & Housing and the Ministry of Public Services, Provincial Councils & Local Government have entered into an Agreement to implement a project for constructing 400 official residences for Public Officers, in a block of land of 02 acres of the said 12 acres in extent, as its first stage. 100 housing units from the Middle Income Housing Schemes currently underway by the Urban Development Authority within the purview of the said project, will also be transferred to the Ministry of Public Services, Provincial Councils & Local Government. Accordingly, the remaining land in extent of 10 acres will be transferred to the Urban Development Authority for development. As such, the Joint Proposal made by the Hon. Prime Minister in his capacity as the Minister of Urban Development & Housing and the Minister of Public Services, Provincial Councils & Local Government to implement the proposed project, was approved by the Cabinet.",
  "key": "2021-02-15-002-9837"
}