{
  "date_str": "2016-09-13",
  "decision_num": 13,
  "title": "Amendments to the Act on Value Added Tax",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7058",
  "decision_details": "- As per the Budget proposals 2016, the decision taken at the special Cabinet Meeting held on 2016-03-04 and in accordance with the recommendation of the Cabinet Committee on Economic Management (CCEM) held on 2016-06-15, it was decided to revise the provisions pertaining to the VAT under the Value Added Tax Act, No.14 of 2002. Accordingly, the proposal made by Hon. Ravi Karunanayake, the Minister of Finance, to publish the Value Added Tax (Amendment) Bill  amended incorporating the following proposals, in the Government Gazette instead of the Bill submitted previously with regard to the VAT amendment and thereafter to present same in Parliament for approval, was approved by the Cabinet:     \n\n   \t(i)\tFixing VAT rate at 15%;\n\n(ii)\tReduction of the threshold of Registration for VAT from Rs.3.75 million per quarter or Rs.15 million per annum to Rs.3 million per quarter or Rs.12 million per annum;\n\n(iii)\tImposition of VAT on the following goods and services\n*\tWholesale or retail trade valued more than Rs.50 million per annum (i.e. Rs.12.5 million per quarter);\n*\tPrivate health services other than OPD services that do not contain diagnostic tests, dialysis and medical consultancy services;\n*\tTelecommunication services; \n*\tTobacco products;\n*\tPowdered milk containing added sugar or other sweeteners;\n*\tAir ticketing fee of Air passengers moving from an airport in Sri Lanka to an airport outside Sri Lanka;\n\n(iv)\tRestriction of the VAT exemption applicable on the supply, lease or rent of residential accommodation services carried out by projects of which the investment cost does not exceed US$ 05 million, other than services made by Strategic Development Projects (SDPs) approved prior to 2015-11-01 or by SDPs and other projects where the sales agreements are entered into or project completed before 2016-10-01. \n \n(v)\tIncrease of the piece rate of garments supplied to the local market by companies registered under the Sri Lanka Board of Investment (BOI) up to Rs.75/- per piece.",
  "key": "2016-09-13-013-0358"
}