{
  "date_str": "2016-09-27",
  "decision_num": 3,
  "title": "Filling of the Existing Teacher Vacancies",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7064",
  "decision_details": "- An adequate number of teachers should be available in schools to ensure equal access to a qualitative education in  schools  throughout the island.  However, there is a dearth of about 22,500 teachers as a whole, in  schools across  the island. Neither Teachers nor resources have been adequately provided for, especially, to the schools in rural areas to teach the subjects of Science, Maths and English. With a view to providing a sustainable solution to this problem, in addition to the recruitment of graduates from state universities and diploma holders, it has been planned to implement a programme to recruit youth who have passed A/Ls and qualified for university entrance,  to the teaching service, after completion of a B.Ed (Science) or a B.Ed. (Arts) Degree awarded by a  private university approved by the Ministry of Higher Education and Highways, and also to provide a sum of Rs.275,000/- annually by a state bank to those who have been admitted to such Degree programme and after completing the Degree, to have them serve in a teacher vacancy in a school in a district of their choice for 10 years. In case they serve for a period of 10 years in the relevant district, action will be taken not to recover the loan granted to them for the Degree programme. Accordingly, the proposal made by Hon. Ranil Wickramasinghe, the Prime Minister, in his capacity as the Minister of National Policies and Economic Affairs, to recruit 5,000 students, who have passed the G.C.E. (A.L) Examination, as teachers of Science and Maths under this programme during the 1st Phase, was approved by the Cabinet. \n \n\tIt was also decided to vest authority on the Ministry of Education, to recruit graduates expeditiously to address the dearth of Science teachers existing in the government schools.",
  "key": "2016-09-27-003-e5b5"
}