{
  "date_str": "2015-03-23",
  "decision_num": 8,
  "title": "Future Course of Action relating to the Head Works of Uma Oya Multipurpose Development Project (UOMDP)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6007",
  "decision_details": "- The Agreement signed with M/s FARAB Co. of Iran for the construction work of the Uma Oya Multipurpose Development Project (UOMDP) is in force and the physical progress achieved in the project up to now is 47%.  However, with the ingress of water into the Head Race Tunnel at the end of 2014, some socio-economic issues like drying up of wells, developing cracks in houses and crop damage etc. have surfaced in 6 Grama Niladari Divisions around Bandarawela and Ella Divisional Secretary's Divisions.  As such, until the receipt of the recommendations of the Central Environment Authority and the Panel of Experts appointed specially for the purpose, the construction of the head works had been temporarily suspended with effect from 2015?02?16 except for those essential work on sealing the water ingress into the Head Race Tunnel and the other work of protective nature.  The reports of the Panel of Experts as well as the Central Environment Authority have now been received.  Accordingly, most of the remedial measures recommended by those committees have to be implemented by the Contractual Construction Co. and a monitoring mechanism is required to be adopted to prevent the occurrence of circumstances of above nature in future.  The proposal made by H.E. Maithripala Sirisena, the President, in his capacity as the Minister of Mahaweli Development and Environment to construct above 600 houses damaged due to ingress of water into the Tunnel, to provide uninterrupted supply of pipe borne water by the Water Supply and Drainage Board for the affected families and to appoint a Cabinet Sub-Committee comprising the Minister in-charge of the Subject and other Ministers representing the respective area to make recommendations, as to how the future activities of the project should be handled, taking also into consideration the recommendations of the  Central Environment Authority and the  Panel of Experts, was approved by the Cabinet.",
  "key": "2015-03-23-008-6216"
}