{
  "key": "2024-12-09-001-0bd4",
  "title": "Establishment of the Food Policy and Security Committee",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12913",
  "decision_details": "- Ensuring the national food and nutrition security and providing the food safely is a key function of the Government and providing the minimum food requirement of every citizen qualitatively and quantitatively at an affordable price is a main objective of the Government. The new Government policy statement has proposed a number of measures for this purpose and the key functions among them have been identified, including the production of all food that can be produced in the country locally, maintenance of buffer stocks of essential food sufficient for at least for 03 months, maintenance of a database on the food stocks available in the country and preparing and implementation of an effective programme with the participation of the private sector as well in the implementation processes of production, storage, distribution, wholesale and retail trade which ensures the food security. It has been decided to coordinate the National Food and Nutrition Security and Safety Programme through the Presidential Secretariat to pay more attention to these tasks and to make efficient the institutional coordination. Accordingly, the proposal made by the Hon. President to establish the \"Food Policy and Security Committee\" under the Presidential Secretariat, under the co-chairmanship of the Minister of Agriculture, Livestock, Land and Irrigation and the Minister of Trade, Commerce, Food Security and Cooperative Development, and with the membership of the Secretary to the Prime Minister and other Secretaries to the relevant Ministries, to provide policy guidance through data and information-based scientific analysis with the participation of all institutions involved in ensuring the food security and nutrition, was approved by the Cabinet.",
  "date_str": "2024-12-09",
  "decision_num": 1
}