{
  "date_str": "2024-12-02",
  "decision_num": 7,
  "title": "Identification and resolving of existing issues regarding Development Officers, Officers of Allied Service Categories, and Officers already in various Posts in the Public Service with a degree although the degree is not considered as a basic qualification for entry into the Public Service, and graduates expecting to join the Public Service",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12905",
  "decision_details": "- More than 150,000 graduates including the Development Officers recruited to the Government service through various schemes  in 07 occasions from the year 1994 to 2020, are employed under the Central Government and Provincial Councils  Recruitment to the public service has been made without a proper evaluation of the skills and professional qualifications of the officers serving as  Development Officers and Officers  of Allied Service Categories. It has not been possible to achieve the expected performance of those officers, as they were not provided   with proper induction and in-service training, neither have they been formally assigned with duties and responsibilities related to the post. Similarly, more than 15,800 Development Officers are engaged in teaching in National and Provincial schools and a problematic situation has also arisen regarding recruiting them to the Teachers' Service. Accordingly, the Cabinet approved the proposal made by the Hon. Prime Minister to appoint a Ministerial Committee under the Chairmanship of the Prime Minister and consisting of the following Ministers/Deputy Ministers to identify the various issues that have arisen regarding the administration as well as the performance of the Development Officers, analyze those issues and present sustainable solutions, and also to appoint an Officials' Committee chaired by the Secretary to the Prime Minister to assist the Ministerial Committee - \nMinisterial Committee:\n\t* Hon. Prime Minister - (Chairperson)\n\t* Hon. Minister of Public Administration, Provincial Councils and Local \tGovernment\n\t* Hon. Deputy Minister of Economic Development\n\t* Hon. Deputy Minister of Education and Higher Education\n\t* Hon. Deputy Minister of Vocational Education\nOfficials Committee:\n* Secretary to the Prime Minister - (Chairman)\n\t* Secretary, Ministry of Public Administration, Provincial Councils and Local Government\n* Secretary, Ministry of Education, Higher Education and Vocational Education\n\t* Secretary, Finance Commission\n* Director General of National Budget\n\t* Director General of Establishments\n* Director General - Department of Management Service\n* Director General of Combined Service",
  "key": "2024-12-02-007-695d"
}