{
  "date_str": "2017-08-09",
  "decision_num": 4,
  "title": "Revision of the fines imposed on traffic offences committed under the Motor Traffic Act",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8019",
  "decision_details": "- Having identified 7 violations of traffic rules which severely affect the fatal road accidents to a large extent, it was proposed in 2016 to increase the fines imposed on these traffic offences, up to a minimum of Rs.25,000/- with a view to minimizing road accidents.  However, taking into consideration the protest made by the Bus and Three-Wheeler Associations the President appointed an Officials' Committee to inquire into the increasing of fines imposed under the Motor Traffic Act and accordingly, the proposal made by  Hon. Nimal Siripala de Silva, the Minister of Transport and Civil Aviation to implement the following recommendations made by the said Committee, was approved by the Cabinet. \n*\tIncrease of the minimum fine up to Rs.25,000/- in respect of the following traffic offences:\n\n-\tdriving a vehicle without a valid driving license\n\n-\temploying in service persons who do not possess a driving license\n\n-\tdriving vehicles under the influence of liquor or drugs\n\n-\tcrossing a railway line haphazardly\n\n-\tdriving a vehicle without a valid insurance cover\n*\tRevision of the minimum fines presently imposed in respect of the following traffic offences:  \n\n-\thigh speed driving \n\t(imposing a spot fine - of Rs.3,000/- for driving a vehicle at high speed above the 20% limit of the maximum speed stipulated; of Rs.5,000/- for driving a vehicle at high speed above the 20% limit and less than 30% limit of the maximum speed stipulated; of Rs.10,000/- for driving a vehicle at high speed above the 30% limit and less than 50% limit of the maximum speed stipulated; and of Rs. 15,000/-; for driving a vehicle at high speed above the 50% limit) \n \n- \tOvertaking from the left\n\t(the minimum spot fine for this offence is increased up to Rs.2,000/-)\n-\tdriving a motor vehicle carelessly or without due regard to others or without due diligence\n\t(a minimum fine of Rs.10,000/- is imposed for the offence)\n\n\n\n-\tdriving a motor vehicle recklessly or in a dangerous manner or at a dangerous speed \n\t(a minimum fine of Rs. 10,000/- is imposed for the offence)\n\n-\tdriving vehicles by underaged persons\n\t(the minimum fine of Rs. 5,000/- imposed on this offence presently is increased up to Rs. 30,000/-) \n\n- \tthe increase of the minimum fine imposed under the general penalty for any offence for which a punishment has not been specified under the Motor Traffic Act up to Rs.2,500/-.\n\n*\tImposing a spot fine of  Rs. 2,000/- for using a mobile phone while driving.\n\n*\tExpediting of the implementation of a driver score card system.\n\n*\tInstalling of CCTV cameras in the places where many road accidents occur and taking legal action against the offenders based on such information.\n\n*\timplementation of the proposal for the use of electronic facilities for payment of spot fines for traffic offences expeditiously.\n\n*\tproper display of the speed limit sign boards on expressway and highways. \n\n*\timplementation of an integrated timetable and the operation of the SLTB buses and the private buses or to adopt a suitable procedure expeditiously. \n\n*\tEstablishment of institutions to regulate the three-wheelers and the buses and vans transporting school children.\n\n*\tEstablishment of a public transport service ensuring the safety of passengers.\n\n*\tUse of modern technological equipment to minimize the various irregularities caused by some of the officers who enforce the traffic rules and to ensure transparency in the enforcement of traffic laws.",
  "key": "2017-08-09-004-fb98"
}