{
  "date_str": "2017-08-01",
  "decision_num": 4,
  "title": "Regulation of the usage of  pneumatic weapons to ensure the protection of wild animals",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7989",
  "decision_details": "- Due to the increase in some wild animal population the crop damages caused by them also have increased in various parts of the island, and the difficulties caused to the daily lives of the people living in such areas have also increased.  On the other hand, complaints have been made to the effect that pneumatic weapons to be used for the crop protection are also used for hunting of wild animals. Accordingly, the proposal made by Hon. Gamini Jayawickrema Perera, the Minister of Sustainable Development and Wildlife, to implement the following recommendations made by the Officials' Committee appointed to study the matter, was approved by the Cabinet. \n\n*\tto look into the possibility of producing a pneumatic rifle with low power in place of the 0.22mm pneumatic rifle which is used for driving away of wild animals and to encourage the creation of a new model rifle which could drive away animals, by way of a loud noise.\n \n*\tregularization of the issuance of  the 0.22mm pneumatic rifles presently used for the protection of the coconut cultivation.\n\n*\tpneumatic rifles to be brought under the Firearms Ordinance.\n\n*\tconduct of bio‑scientific research with the assistance of the experts to control the high growth of animal population which cause harmful effects on  cultivations.  \n\n*\timpose controls in the usage of agro‑chemicals which result in destroying the animals who are considered beneficial to cultivations. \n\n*\tusage of modern scientific methods to minimize the crop damages caused by the wild animals. \n\n*\timproving the traditional methods used in the past  in driving away of animals from cultivable lands without causing harm to them with new technology and apply them to suit the present trends. \n*\tminimize the disposal of waste in open grounds which is a cause for wild animals to come over to the villages. \n\n*\timpose limits on the import of raw materials used in the production of 'hakka patas'.",
  "key": "2017-08-01-004-366f"
}