{
  "date_str": "2011-11-23",
  "decision_num": 10,
  "title": "Revival of Underperforming Enterprises And Underutilized Assets",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4306",
  "decision_details": "- the objective of the Government is to provide for the effective manner, administration and revival of these enterprises in the national interest, which are listed in the Schedules to the Act No.43 of 2011.  It has been observed that most of the enterprises related to the above have obtained many BOI concessions, and had not fulfilled the assurances given to the BOI, such as further investments, ensuring exports etc.  The proposal made by H.E. the President, in his capacity as the Minister of  Finance and Planning to appoint -\r\n\r\n\r\n(a)\ta Ministerial Committee consisting of the following and an Officials' Committee consisting of six Officials to assist this Committee, to ensure the overall monitoring of the related aspects in a timely manner:\r\n\r\n\r\n*\tHon. Anura Priyadharshana Yapa, Minister of Environment - (Chairman);\r\n*\tHon.  Dilan Perera, Minister of Foreign Employment and Welfare (Member);\r\n*\tHon. Reginald Cooray, Minister of Minor Export Crop Promotion \t(Member);\r\n*\tHon. Lakshman Seneviratne, Minister of Productivity Promotion \t(Member); and\r\n*\tHon. Geethanjana Gunawardena, Deputy Minister of Finance and \tPlanning (Member); and\r\n\r\n\r\n(b)\tthe following Competent Authorities -\r\n\r\n(i)\tLanka Tractors Limited (Properties situated at Pettah and Narahenpita), Charmers Granaries (Property situated at Pettah), Ceylinco Leisure Properties Ltd. (Properties situated at Kollupitiya, Colomb 3) and Intertrade Lanka (Private) Limited (Property situated at Fort, Colombo) - Mr. Kalinga Indatissa, Attorney-at-Law;\r\n\r\n(ii)\tHotel Developers Lanka plc (HDL) - Mr. Senaka Walgampaya, Attorney-at-Law;\r\n\r\n(iii)\tPelwatte Sugar Industries Ltd. - District Secretary, Hambantota;\r\n\r\n(iv)\tSevanagala Sugar Industries Ltd. - District Secretary, Moneragala;\r\n\r\n(v)\tColombo Commercial Company Limited (Badulla Property) - District Secretary, Badulla; and,\r\n\r\n(vi)\tall the remainder of Under Utilized Assets (being closed BOI Factories) - Mr. Tuly Cooray; \r\n\r\nwas approved by the Cabinet.",
  "key": "2011-11-23-010-6c45"
}