{
  "key": "2025-03-10-002-b20a",
  "title": "Construction of a Lawyers' Office Complex acquired adjacent to the New Galle Courts Complex",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=13071",
  "decision_details": "- Proposal pertaining to the construction of a Lawyers' Office Complex at the expense of the Galle Bar Association on a plot of land in extent of 130 perches adjacent to the New Galle Courts Complex acquired for the use of the Ministry in charge of the subject of Justice, was taken up for discussion at the Cabinet meeting held on 2025‑02‑03. At this meeting, an Officials' Committee headed by the Secretary, Ministry of Justice and National Integration, comprising of representatives from the Ministry of Finance Planning and Economic Development, Land Commissioner General's Department including other relevant institutions, has been appointed to examine the existing legal and other matters pertaining to the implementation of the said proposal and submit a Report with recommendations to the Cabinet. The proposal made by the Minister of Justice and National Integration to sign a Memorandum of Understanding between the Ministry of Justice and National Integration and the Galle Bar Association to pursue action as follows, based on the recommendations submitted by the said Officials' Committee, was approved by the Cabinet.\n\n*\tConstruction of a Lawyers' Office Complex through the funds of the Galle Bar Association on the above plot of land in extent of 130 perches, having the ownership of the land with the Government.\n\n*\tHanding over the tenure of the said building to the Galle Bar Association to use the same for a period of 30 years, attending to its maintenance, in a manner that the total amount invested by the said Association for the construction of the building is covered by the lease rental.\n\n*\tNot to use the building for any commercial purpose other than providing servìces to the public in relation to the legal profession.\n\n*\tHandover of the tenure of the building to the Ministry in charge of the subject of Justice after a period of 30 years.\n\n*\tIf the said building is further required thereafter, to provide the opportunity to use the said building, having entered into a fresh Memorandum of Understanding with the Galle Bar Association, based on the valuation of the Chief Government Valuer.",
  "date_str": "2025-03-10",
  "decision_num": 2
}