{
  "date_str": "2017-05-02",
  "decision_num": 18,
  "title": "Long term solutions for the management of Municipal Solid Waste generated in the Western Region",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7706",
  "decision_details": "- The Ministry of Megapolis and Western Development and the Urban Development Development Authority has been assigned with the task of finding long term solutions for the management of urban solid waste of the Western Region. It has been forecast that an additional 1,300 mt of waste will be collected daily by the year 2013 with the implementation of the Colombo Megapolis Development Plan and the Colombo Port Financial City project. As such, the following proposals made by Hon. Patali Champika Ranawaka, the Minister of Megapolis and Western Development, for the implementation of the following projects and plans initiated by the Ministry of Megapolis and Western Development in respect of the urban solid waste management, was approved by the Cabinet.  \n\n*\tto take necessary measures to complete the activities being done in respect of the Meethotamulla land fill within 05 months with the collaboration of the Army and to develop the place as an Urban Forest Park.  \n\n*\tto take measures to vest authority on the Central Environment Authority for granting Environmental  approval of all ongoing and future waste processing adopting the initial Environmental Evaluation procedure.  \n\n*\tto induce the general public only to segregate the waste  and only such waste to be transported to the centres allocated for such purpose.\n\n*\tto direct Local Authorities having more than 50,000 families to take measures to initiate their own waste disposal and processing centres.\n\n*\tThe Ministry of Megapolis and Western Development in collaboration with the Lanka Transformers Limited, to initiate a Waste to Energy Project. \n*\tto request for project proposals from foreign Governments through the foreign embassies in Sri Lanka for the Arukkaru Waste Disposal Project in Puttlam.\n      \n*\tto transfer the plot of land required for the construction of a Transfer Station of Waste in Kelaniya to the Ministry of Megapolis and Western Development belonging to the Sri Lanka Land Reclamation and Development Corporation.",
  "key": "2017-05-02-018-ef78"
}