{
  "date_str": "2017-05-30",
  "decision_num": 17,
  "title": "Provision of Relief to the victims of floods and landslides",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7781",
  "decision_details": "- The Cabinet of Ministers while conveying its sympathy to the families over the demise of their members due to floods and landslides, expressed its gratitude to the peoples' representatives, public officers, the tri-forces, the police and the civil security force including all sectors of the society who actively responded to the need of the hour during this difficult situation and decided to make the following decisions in that regard: \n\n\n(i)\tto increase the maximum cost to be incurred to provide cooked meals per affected person per day, from Rs.225/- to Rs.300/- due to the disaster situation;\n\n(ii)\tto suspend immediately the purchase of new vehicles for the use of the Ministers and Ministries during this year;\n\n(iii)\tto formulate a method for the deployment of  the personnel of the Sri Lanka Army and the Civil Security Department, for the renovation and reconstruction of the damaged houses and other buildings due to the disaster;\n\n(iv)\tto utilize the financial grants received from foreign countries for the construction of houses damaged due to the disaster;\n\n\n(v)\tto appoint a Ministerial Sub-Committee comprising of the following Ministers to make recommendations for an appropriate mechanism, to arrange for the provision required for the proposed re-development activities to carry out the rehabilitation of damaged buildings and the capital assets after re-prioritizing the provision set apart for development projects and other activities through the Budget 2017;\n\n\n*\tHon. Mangala Samaraweera,\n\tMinister of Finance and Mass Media  - (Chairman);\n\n*\tHon. Ravi Karunanayake,\n\tMinister of Foreign Affairs;\n\n*\tHon. Kabir Hashim,\n\tMinister of Public Enterprise Development;\n\n(vi)\tto instruct the Secretary, Ministry of Finance and Mass Media to create awareness of the tax concessions granted to the private sector for their contribution towards the renovation of houses and the infrastructure facilities damaged as a result of the disaster.",
  "key": "2017-05-30-017-5c76"
}