{
  "date_str": "2014-10-09",
  "decision_num": 29,
  "title": "Construction of the portion of the Northern Expressway from Enderamulla to Galewela and the portion of the link Expressway from Pothuhera to Galagedara",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5774",
  "decision_details": "- the Government has given high priority for the construction  of the portion of the Link Expressway from Pothuhera to Galagedara.  The above mentioned portion of the Expressway will connect major commercial cities viz., Gampaha, Veyangoda, Mirigama, Kurunegala, Rideegama, Melsiripura and Galewela and the above mentioned portion of Link Expressway will connect major commercial cities viz., Rambukkana and Galagedara.  On the Northern Expressway portion, interchanges will be constructed at Enderamulla (System Interchange), Gampaha, Veyangoda, Mirigama, Nakalagamuwa, Dambokka, Kurunegala, Ridigama, Melsiripura, Galewala, Pothuhera (System Interchange).  On the Link Expressway interchanges will be constructed at Rambukkana and Galagedara.  System Interchange provides connectivity only among expressway.  The feasibility studies and preliminary designs have been already completed and the proposed expressway corridors for the above mentioned sections have been already identified. Environmental Impact Assessment and land acquisition activities are in progress.   The above mentioned sections of the expressway have been divided into eight (08) individual contract packages for implementation of construction as per details given below:\n\n\n Contract  Package No.  \n Name of Section  \n Length (km) \n\n\n Package 01   \n Enderamulla - Veyangoda    \n 28.0 \n\n\n Package 02   \n Veyangoda - Mirigama   \n 16.0 \n\n\n Package 03   \n Mirigama - Nakalagamuwa   \n 18.0 \n\n\n Package 04   \n Nakalagamuwa - Alakoladeniya   \n 20.1 \n\n\n Package 05   \n Alakoladeniya - Meddeketiya   \n 16.9 \n\n\n Package 06   \n Meddeketiya - Galewela   \n 19.0\n\n\n Package 07   \n Pothuhera - Rambukkana\n 17.5\n\n\n Package 08   \n Rambukkana - Galagedara\n 18.0\n\n\n\r\nThe proposal made by H.E. the President, in his capacity as the Minister of Highways, Ports and Shipping, to proceed with the related activities, was approved by the Cabinet.",
  "key": "2014-10-09-029-41d1"
}