{
  "date_str": "2013-08-29",
  "decision_num": 14,
  "title": "Recent reports of milk powder contamination with Dicyandiamide (DCD) and Whey Protein Concentrate Contamination with Clostridium Botulinum Bacteria",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5208",
  "decision_details": "- Cabinet at its meeting held on 2013-08-15 appointed a Cabinet Sub-Committee headed by Hon. D.E.W. Gunasekara, Minister (Senior) for Human Resources and consisting of six other Ministers to examine this issue and submit a Report to the Cabinet.  Accordingly, the Report of the Committee was submitted by Hon. D.E.W. Gunasekara, Minister (Senior) for Human Resources and the following recommendations contained in the Report were approved by the Cabinet for implementation:(a)    to improve the capacity of local laboratories to meet the emerging demands including those at the Medical Research Institute and Industrial Technical Institute; (b)    to inspect the Complex and Advanced Food Manufacturing Plants in Sri Lanka by the experts under the Chief Food Authority to ensure good manufacturing practices;(c)    to launch an Island-wide programme to promote breast feeding and consumption of locally produced liquid milk by the Ministry of Health in collaboration with other relevant stakeholders;(d)    to take action to strengthen the capacity of the Food Authority in terms of staff and other facilities and to amend the Food Act to address the existing and emerging food safety issues effectually;(e)    to direct the Ministry of Health to publish a detailed news paper advertisement indicating in simple language:(i)    background of the issue; and(ii)    a system of labelling to identify the products free of DCD and Clostridium bacteria, which are safe to consume.(f)    to ensure the introduction of the new labelling system prior to publishing the above public communication;(g)    to purchase a Liquid Chromatograph Mass Spectrometer (LC/MS/MS) for the ITI;(h)    to direct the Chief Food Authority and the Consumer Affairs Authority to withdraw from the market  imported milk products suspected to be contaminated with  DCD as decided by that Authority; and(i)    to ensure close collaboration with the Ministry of Health, the Consumer Affairs Authority and the Industrial Technology Institute when addressing the issues of this nature. Action will also be taken to introduce a methodology to carry out Food Safety Hazards Tests prior to clearance of goods by the Customs, jointly by the Sri Lanka Customs, the Medical Research Institute and the Industrial Technical Institute in keeping with international standards.",
  "key": "2013-08-29-014-6125"
}