{
  "date_str": "2014-12-23",
  "decision_num": 16,
  "title": "Programme to strengthen Small and Medium Scale Millers and Stockists",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5909",
  "decision_details": "-  the small and medium scale millers and stockists contribute largely to the process of offering a government guaranteed price for paddy farmers and providing rice to consumers at an affordable price through purchasing paddy and also processing and distributing rice.  The monthly consumption of rice in the country is around 180,000 mt. and the small and medium scale millers and stockists have the capacity to produce 60% of the market requirement.  The Government intends to strengthen the small and medium scale millers and stockists financially and to provide immediate relief to settle their outstanding loans during the past due to natural calamities and loss of harvest.   Accordingly, the following proposals made by H.E. the President, in his capacity as the Minister of Finance and Planning, were approved by the Cabinet: \r\n  \r\n*\tto suspend legal action taken by State Banks against the defaulted pledge loans of small and medium scale millers and stockists;\r\n\r\n*\tto write off the outstanding loan balances of pledge loans for paddy purchasing obtained by them from  State Banks during the period from 1997 to 2010 and for the General Treasury to provide the required funds to the relevant banks;\r\n\r\n*\tto offer a grace period of six (06) months with effect from 2015?01?01 for the repayment of the pledge loans granted by State Banks for paddy purchasing in Maha 2013/2014 and Yala 2014;\r\n\r\n*\tto purchase Samba rice and other rice stocks processed by them, through Lanka Sathosa Limited at Rs.85/- and Rs.82/- per kg. respectively and to provide financial facilities to Lanka Sathosa Limited in this regard;\r\n\r\n\r\n*\tto provide transformers free of charge for them, considering their electricity capacity requirement and to bear the cost of same by the Government; and\r\n\r\n*\tto implement a new Loan Scheme for them with concessionary  interest rates to improve the paddy purchasing and storage capacity and to improve the quality of rice through introduction of modern technology.",
  "key": "2014-12-23-016-9c7d"
}