{
  "date_str": "2020-07-15",
  "decision_num": 9,
  "title": "Sri Lanka Biotechnology Innovation Park (SLBIP)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10562",
  "decision_details": "- The project for the establishment of the Sri Lanka Bio Technology Innovation Park and the Sri Lanka Bio Technology Institute, with the objective of promoting high-tech exports and encouraging the substitute productions of such imports has been designed to implement in stages. The objective of this project is to facilitate the creation of a favourable environment required to work collectively for the biotech companies and biotech researchers to convert their ideas into commercial products. The International Centre for Genetic Engineering and Biotechnology (ICGEB) an affiliated entity of the United Nations' Organization has selected Sri Lanka as the Regional Research Centre for South Asia to work in collaboration with the proposed Sri Lanka Bio Technology Institute. Under this, the Organization has given its consent to transfer the technology for the manufacture of 10 biologics including insulin and the growth hormones immediately creating favourable grounds for Sri Lanka.\n\nAccordingly, the Cabinet approved the joint proposal submitted by the Hon. Prime Minister in his capacity as the Minister of Finance, Economy and Policy Development and the Minister of Higher Education, technology and Innovation, for the establishment of a Biotechnology Innovation park and to construct the 'BiotechnoPlex' building in a land in extent of 13.2 acres situated in Aramawatte, Pitipana, Homagama and to appoint a Monitoring Committee co-chaired by the Secretary to the Treasury and the Secretary to the Ministry of Higher Education, Technology and Innovation and a Technical Committee comprising of the experts of the relevant field to take the future steps relating to same and to allocate provisions required for the said project.",
  "key": "2020-07-15-009-930f"
}