{
  "date_str": "2020-07-22",
  "decision_num": 3,
  "title": "Further extension of benefits under the Agrahara Insurance Scheme operated for retired Public Officers",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10568",
  "decision_details": "- The officers who retired from the public service after 2016‑01‑01, have been provided an opportunity to join the Agrahara Insurance Scheme and enjoy its benefits. However, the majority of the retired officers have retired from the public service prior to 2016‑01‑01 and the unions of the said retired officers have made requests to grant them also an opportunity to join the Agrahara Insurance Scheme. Accordingly the approval was granted by the Cabinet to the joint proposal made by the Minister of Skills Development, Employment and Labour Relations and the Minister of Public Administration, Home Affairs, Provincial Councils & Local Government with regard to the extending of Agrahara benefits which is presently entitled to the public servants retired after 2016‑01‑01 also to the public servants retired prior to 2016‑01‑01, taking into consideration the concurrence given by the Hon. Prime Minister in his capacity as the Minister of Finance, Economy and Policy Development.\n\n\tFurther, the Cabinet granted approval for taking action, considering the proposals submitted by the Hon. Prime Minister in his capacity as the Minister of Finance, Economy and Policy Development - \n\n* \tto prepare a suitable mechanism to maintain a separate ward in every leading Government hospital covering all the districts, for all public servants and the retired public servants enabling them to obtain high quality health care facilities under the Agrahara Insurance Scheme.\n\t\n* \tto request the National Pay Commission to submit appropriate recommendations to rectify the pension anomalies since it has been observed that pension anomalies still exist among the officers who have retired from the public service.",
  "key": "2020-07-22-003-5aae"
}