{
  "date_str": "2024-04-29",
  "decision_num": 13,
  "title": "Amendment of the Penal Code and the Code of Criminal Procedure Act to\tprohibit Corporal punishment in all spheres",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12528",
  "decision_details": "- The Convention on the Rights of the Child to which Sri Lanka is a party, sets out the Civil, Political, Economic, Social and Cultural Rights of the Child. Article 19(1) of the Convention on the Rights of the Child mentions that the States Parties shall take all appropriate legislative, administrative and educational measures to protect the child from all forms of physical or mental violence, injury or abuse, neglect or negligent treatment, maltreatment or exploitation, including sexual abuse, while in the care of parents, legal guardians or any other person who has the care of the child. The United Nations Committee on the Rights of the Child in its latest observations on Sri Lanka states that a high number of children are subjected to abuse and violence, including corporal punishment at home, alternative care settings, penal institutions and schools due to insufficient legal provisions. Also, by the Supreme Court judgment related to a Fundamental Rights Petition filed by a student recently, who was slapped by a teacher which resulted in a permanent hearing impairment, has determined that the teacher in concern and the State have violated Article 11 of the Constitution. It has also been scientifically proved that such corporal punishment has a long-term effect on a child physically and mentally. Therefore, Legal Amendments to cover any act falling under the category of cruel and/or degrading physical and/or non-physical punishment should be introduced expeditiously. Accordingly, the joint proposal made by the Hon. President and the Minister of Justice, Prison Affairs and Constitutional Reforms to amend the Penal Code and the Code of Criminal Procedure Act by incorporating provisions for the prohibition of corporal punishment in all spheres, was approved by the Cabinet.",
  "key": "2024-04-29-013-fb56"
}