{
  "date_str": "2024-04-25",
  "decision_num": 1,
  "title": "Entering into Memoranda of Understanding/Agreements in view of Educational Collaboration",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12504",
  "decision_details": "- The proposal made by the Minister of Education to enter into the following  Memoranda of Understanding/Agreements between Sri Lankan Universities and Foreign Universities/Agencies with the objective of developing the higher educational collaboration, was approved by the Cabinet. \n\n*\tThe Memorandum of Understanding between the Sabaragamuwa University of Sri Lanka and the University of Salford, United Kingdom pertaining to fostering multidisciplinary research for disaster resilience and integrated natural resource management.\n\n*\tThe Tripartite Agreement among the University of Jaffna and the National University of Singapore and Singapore Health Services Pte. Ltd. to establish a Regional Collaborating Centre with the aim of coordinating global health efforts.\n\n*\tThe Memorandum of Understanding between the University of Ruhuna and the Southern Health NHS Trust of the United Kingdom and Northern Ireland pertaining to the MARIE Project on the mental health effects of menopause on women globally.\n\n*\tThe Memorandum of Understanding between the Open University of Sri Lanka and the Tomorrow Technology Education Service Center, China pertaining to the designation and empowerment of Tomorrow Technology Education Service Center as the duly authorized representative for the purpose of endorsing and marketing the academic programmes offered by the Open University of Sri Lanka to the students from China.\n\n*\tThe Memorandum of Understanding between the University of Sri Jayewardenepura and the Tomas Bata University in the Czech Republic to develop cooperation between the two parties.\n\n*\tThe Agreement between the Rajarata University of Sri Lanka and the University of Naples Federico II, Italy on capacity building, research collaborations, innovations and use of aquaculture biosystems technology.",
  "key": "2024-04-25-001-52fb"
}