{
  "date_str": "2015-08-05",
  "decision_num": 3,
  "title": "Resettlement of Families affected due to acquiring of lands for Moragahakanda - Kaluganga Agricultural Development Project - the increase of families due to the delay of the project - Revision of benefits including approval of alternative proposals",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6258",
  "decision_details": "Moragahakanda - Kaluganga Agricultural Development Project was commenced in 2008 and it has been identified that the 1,747 families of 12 Grama Niladari Divisions in Naula Divisional Secretary's Division and 907 families of 11 Grama Niladari Divisions in Laggala Pallegama Divisional Secretary's Division will be affected in the implementation of the said project. However, the following issues have arisen due to the delay in the implementation of the project by 8 years:   \r\n\r\n*\tSince the new marriages have taken place within the families to be affected, another 224 families have been added to the earlier number, as families to be affected. \r\n\r\n*\treluctance of the newly added families, to leave the area \tand settle down in Medirigiriya. \r\n\r\n*\tthe expression of unwillingness by 345 families which consented to settle down in Medirigiriya in the year 2007 to go and live in the said area.  \r\n\r\n*\tthe alternative lands have to be provided with the newly added families who have expressed their unwillingness to settle down in Medirigiriya area. \r\n\r\nThe proposal made by H.E. the President Maithripla Sirisena, in his capacity as the Minister of Mahaweli Development and Environment,  to acquire the lands identified to be given to the famiies to be added under above project belonging to the Government Owned Plantation Companies situated in the relevant area and suburbs, to pay compensation for the lands owned by such families and to provide assistance for building houses in alternative lands, as a remedy to solve the above issues, was approved by the Cabinet.",
  "key": "2015-08-05-003-de15"
}