{
  "date_str": "2015-08-05",
  "decision_num": 13,
  "title": "Investigation on Corruptions, Mal-administration and Irregularities",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6268",
  "decision_details": "The proposal made by the Hon. Ranjith Madduma Bandara, the Minister of Internal Transport to consult the Attorney General's Department, to institute legal actions against the responsible institutions and persons, in accordance with the Report pertaining to the following matters submitted by the Special Investigation Committee appointed by the Secretary to the Ministry, on a directive made by the Minister of Internal Transport, to make investigations into corruption, maladministration and irregularities said to have been taken place during the past five year period in the Ministry and its affiliated institutions and to avoid occurrence of such situations in future, was approved by the Cabinet:  \r\n\r\n*\tNon-recovery of a sum of Rs.142 million for the buses hired by the Sri Lanka Transport Board (SLTB), for the presidential election-2015.  \r\n\r\n*\tNon-receipt of the discount offered in procuring 2,200 new buses for the SLTB. \r\n\r\n*\tLoosing the anticipated quality and the import duty concessions to the SLTB when purchasing spare parts. \r\n\r\n*\tOperation of private buses under SLTB logo. \r\n\r\n*\tOperation of 20 luxury buses imported for the Commonwealth Heads of Government Meeting, by the Road Development Authority. \r\n\r\n*\tIssues with regard to enormous cost and the estimates in the construction of the Northern Railway Line. \r\n\r\n*\tSubmission of estimates with an enormous cost in the construction of the Matara - Kataragama Railway Line. \r\n\r\n*\tVesting and leasing out lands owned by the Railway Department, to the external institutions and persons,  deviating from the formal procedure. \r\n\r\n*\tOperation of rail carriages/special trains with private sector participation and loses incurred in the operation of the Vice Roy special train. \r\n\r\n*\tSale of scrap iron deviating from the accepted procedure.",
  "key": "2015-08-05-013-f000"
}