{
  "date_str": "2011-03-08",
  "decision_num": 12,
  "title": "Implementation of the Proposals of the Budget 2011 ? Establishment of Contributory Pension Funds",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=3917",
  "decision_details": "on a proposal made by H.E. the President, in keeping with the budget proposals 2011, Cabinet approval was granted to set up three (03) separate Contributory Pension Funds to ensure the well-being of the people who reach non-working age, to be implemented on 01st May 2011.  They are as follows:\r\n\t\t*\tEmployees' Pension Benefits Fund\r\n\t\t*\tForeign Employment Pension Benefits Fund\r\n\t\t*\tSelf-Employment Pension Benefits Fund\r\n\t\r\n\tMain features of these Funds are as follows:\nEmployees' Pension Benefits Fund - this will be administered by the Commissioner of Labour and will be maintained by the Central Bank of Sri Lanka.  This will apply to any employment not covered by the Government Pension Minutes.   The employer's contribution will be 2% of the Gross Monthly Salary of the employee and the Employee's contribution will also be 2% of his Gross Monthly Salary.  Contributions have to be made for a minimum period of ten years for a pension to be paid at the age of 60 years.  Those with less years of service at the time of implementation, could make payments to cover the balance period.\r\n\r\n\tFurther provisions will be provided in the Act to cover the interest of Bank Employees who have been deprived of their pension rights around 1996, consequent to the State Banks being restructured.  \nForeign Employment Pension Benefits Fund - the objective of this Fund is to recognize the significant contribution made by those in foreign employment to the economy of this country.  Any Sri Lankan in foreign employment can opt to join this Pension Scheme.  The Government will provide Rs.1000 million by way of an initial capital and all Funds lying to the credit of the Foreign Employment Bureau as at 30.04.2011 will be credited to this Fund.  Each employee has to contribute a minimum amount of Rs.12,000/- per annum to this Fund.  Such contribution could be made in one or more installments prior to reaching 55 years of age.  The pension will be paid at the age of 65 years.\nSelf-Employment Pension Benefits Fund - the objective of this Fund is to provide a Retirement Benefits Scheme for those in Self-Employment.  The Government will be provide Rs.1000 million as an Initial to this Fund.  Any persons in Self-Employment can be a member and has to contribute a minimum of Rs.10,000/- per annum to this Fund.  This contribution can be made in one or more installments.  A minimum of ten (10) years contribution has to be made to be paid a pension at the age of 65 years.",
  "key": "2011-03-08-012-8bc2"
}