{
  "date_str": "2020-01-14",
  "decision_num": 12,
  "title": "Debt Relief Package Provided by the Government for Reviving the Small and Medium-Sized Entrepreneurial Sector",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10349",
  "decision_details": "- The small and Medium-Sized Entrepreneurs in the country have encountered severe problems due to their inability of obtaining new loans to expand their businesses, various fees and additional interests to be paid on non-performing loans due to the inability of serving loans continuously and the auctioning of the collateralized property by banks.\n\n\tA series of proposals has been submitted through the Government policy Framework ''Saubagyaye Dakma'' to re-energize the Small and Medium-Sized Entrepreneurial Sector, which has collapsed due to the complex taxation policies and banking laws and regulations enforced for the past few years, with a special emphasis on it.\n\n\tAccordingly, H.E the President has already directed all the Banks to suspend the legal action taken to recover the loans that have already been defaulted. \n\n\tAs its second phase, the proposal made by the Minister of Finance, Economy and Policy Development, to implement a  'Debt Relief Package' to grant a concessionary period to pay the capital moratorium in respect of the performing term loans as at 2019-12-31 borrowed by the Small and Medium-Sized Entrepreneures from licensed banks until 2020‑12‑31, upon a written request made by the borrower and to extend the tenure after the moratorium period without increasing the value of installments, to suspend all legal action relating to the recovery of non-performing loans as at 2019‑12‑31 and write off the total penal interest thereof, and also to grant new working capital loans, subject to the concessionary conditions, to resume businesses that have been closed due to the inability to pay off the loans, was approved by the Cabinet.",
  "key": "2020-01-14-012-4130"
}