{
  "date_str": "2020-01-22",
  "decision_num": 1,
  "title": "Accelerated Paddy Purchase Programme during the Maha Season 2019/2020",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10354",
  "decision_details": "- Reaping of the harvest in the Maha Season 2019/2020 has already been commenced and a harvest of about 03 million MT of paddy is anticipated. Although there has been a slight increase in the price of rice, as a result of the non importation of rice by the Government as a matter of policy, it has been possible to save about US$ 100 million in foreign exchange. This situation has made it possible to stabilize the exchange rates and to have an impact on the reduction of the interest rate as well. Accordingly, it was decided by the Cabinet that the Government should intervene in the purchase of the excess stocks of paddy  during the Maha Season 2019/2020, with a view to stabilizing the price of paddy and compelling the rice mill owners of the private sector to purchase paddy at a reasonable price. As such, it was further decided that the following measures should be taken expeditiously.\n\n*\tstipulation of a minimum guaranteed price of Rs.50/- per standardized kilogram of paddy (subject to a criterion of moisture content).\n\n*\tstipulation of a minimum guaranteed price of Rs.45/- per  kilogram of paddy with the moisture content which is above the anticipated level.\n\n*\timplementation of the Government Paddy Purchasing Programme through the District Secretaries/Government Agents and the Paddy Marketing Board.\n\n*\tpurchasing of the rice required by the Government institutions inclusive of the Tri Forces, the Department of Prisons and the Hospitals, directly.\n\n*\tvesting of all the Stores belonging to the Food Commissioner for storing the paddy stocks purchased, immediately, with the Paddy Marketing Board and the District Secretaries/Government Agents.\n\n*\tthe use of lorries and trucks belonging to the Government institutions for the transportation of stocks of paddy.\n\n*\tissuing of pledge loans for an amount of Rs.100 billion at an interest rate of 8% through the Government and private banks to the paddy purchasers inclusive of small, medium and large scale rice mill owners for purchasing paddy under the guaranteed price.\n*\tvesting of the responsibility of operating the Government Paddy Purchasing Programme with several State Ministers in the major paddy producing districts of Polonnaruwa, Anuradhapura, Kurunegala, Vavuniya, Ampara, Batticaloa, Moneragala and Hambantota.\n\n*\tissuing of the required circular instructions by the Secretary to the President to implement the above programme expeditiously.",
  "key": "2020-01-22-001-bf04"
}