{
  "date_str": "2013-07-18",
  "decision_num": 2,
  "title": "Regulatory and Supervisory Framework for Microfinance Institutions (MFIs) in Sri Lanka",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5140",
  "decision_details": "- the proposed Regulatory and Supervisory Framework will be applicable to Microfinance Institutions  which accepts deposits from the Public and will consist of a three tier system as follows:*    Tier I - Large MFIs to come under the direct supervision and examination by the Central Bank of Sri Lanka (CBSL);*    Tier II - Small MFIs to come under the supervision and examination by CBSL approved Audit Firms;*    Tier III - Institutions falling under the Commissioner of Cooperative Development and Registrar of Cooperative Societies, Divineguma Department and Board of Management of Divineguma Community Based Bank and Banking Societies and the Commissioner General of Agrarian Development will be exempted from the CBSL regulation and will come under the regulation and supervision of the Authorities already empowered under the relevant Statutes.Some of the salient features are -*    no person other than a licensed MFI and an exempted entity can carry on microfinance business after the enactment of the proposed Act;*    provisions of the proposed Act will not apply to Banks licensed under the Banking Act, No. 30 of 1988, Finance Companies licensed under the Finance Business Act, No. 42 of 2011 and Community Based Organizations established with social objectives and engaged in microfinance business, as determined by the CBSL; and*    Registered Cooperative Societies , entities formed in terms of the Agrarian Development Act, No. 46 of 2000 and Organizations established under the Divineguma Act, No.1 of 2013 are exempted from the application of the provisions of the proposed Act.The proposal made by H.E. the President, in his capacity as the Minister of Finance and Planning, to present the relevant Bill in Parliament for approval, was approved by the Cabinet.",
  "key": "2013-07-18-002-6427"
}