{
  "date_str": "2013-07-04",
  "decision_num": 2,
  "title": "National Migration Health Policy of Sri Lanka",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5109",
  "decision_details": "the Sri Lanka National Migration Health Policy aims to engage all relevant sectors and agencies that are responsible to ensure the health of migrants throughout the migration process.  Sri Lanka has recognized that outbound, internal and inbound migrants and the families left behind by outbound migrants are the key groups considered in this policy.  The above proposal made by Hon. Maithripala Sirisena, Minister of Health, was approved by the Cabinet.  Salient features of this Policy are - Outbound migrants and families left behind *    ensure the health and social well being of all migrants by guaranteeing their access to decent and productive employment in conditions of freedom, equity, security and human dignity;*    ensure health protection for Sri Lankan migrant workers by entering into Bilateral Agreements and Memoranda of Understanding with countries that employ Sri Lankan migrant workers; and*    develop and implement a coordinated plan to address the welfare needs of single parent families where the single parent migrates for employment. Internal migrants*    develop a National Programme that addresses specific nutritional issues of vulnerable internal migrant population; and*    ensure access to primary health care for internal migrant population, in partnership with private sector health care providers.Inbound migrants*    ensure that the migration process does not endanger the health of the migrant or the host population;*    identify and address conditions of public health concern in order to mitigate the impact of the migrants; disease burden on national health or social services; and*    promote Sri Lanka as a country with high health standards.",
  "key": "2013-07-04-002-d126"
}