{
  "date_str": "2013-07-25",
  "decision_num": 10,
  "title": "H.E. the President's State Visit to the People's Republic of China",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=5244",
  "decision_details": "- H.E. the President paid a State Visit to the People's Republic of China recently.  From a bilateral point of view, the visit was highly successful due to the following:   *  the leaders of the two countries agreed to strengthen co-operation in maritime security, combating piracy, search and rescue and navigation safety.  *  in the economic sphere, a major breakthrough was achieved when both leaders endorsed a Free Trade Agreement (FTA) between the two countries, which would help Sri Lanka to advance its market access to the second largest luxury market in the world with a population of more than 1.3 billion. This would also bring more benefits to Sri Lanka in the investment sector and also pave the way to enhance Chinese tourist arrivals in Sri Lanka. \r\n\r\n*  China extended further grant assistance in a sum of RMB Yuan 200 million which will be utilized for building an International Convention Centre in Kandy and an Arts Theatre in Anuradhapura.\r\n\r\n*  the construction of the National School of Business Management at Homagama will also commence with the assistance of China.  \r\n\r\n*  the leaders also agreed to promote people to people contacts, strengthen exchanges and co-operation in education, culture, religion, press, radio, television and other areas, and intensify contacts between women, civil groups and academic institutions.\r\n\r\n*  China assured assistance for agricultural development and offered small machineries to Sri Lanka, as a means of further capacity building co-operation. \r\n\r\n*  the leaders also agreed to further strengthen exchanges and co-operation in the areas of aerospace co-operation, telecommunication and broadcasting, disaster management, tsunami monitoring, environmental protection and other areas to serve economic growth and social progress in both countries.",
  "key": "2013-07-25-010-a964"
}