{
  "date_str": "2021-09-06",
  "decision_num": 2,
  "title": "Declaration of the lands under the Wayamba Maha Ela and Deduru Oya Irrigation Development Projects as a Mahaweli Special Economic Zone",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11231",
  "decision_details": "- The Mahaweli Water Security Investment Programme has been implemented as a priority project, with the aim of utilizing the excess water of the Mahaweli River Basin for the agro‑economic activities of the rural communities living in the sub‑river basins in the North Western, North Central and Northern provinces and meeting the drinking and industrial water needs of the said areas as well. Under the said Project, it has been planned to construct the artificial canal systems of the North Western Main Canal of 88.9km in length and the North Central Main Canal of 95.7km in length within the next four (04) years and feed 1,500 rural tanks by new 07 reservoir tanks. And, work of the new Deduru Oya Reservoir constructed crossing the Deduru Oya and the construction activities thereunder have been completed and under this project, it is expected to provide irrigation facilities to cultivate 25,000 acres of lands by 200 small tanks in the two seasons, provide drinking water facilities to around 50,000 new consumers and to generate electricity through a Renewable Energy Project of 1.5MW. Under the above two projects, it has been identified to develop less developed lands in the districts of Kurunegala, Puttalam, Anuradhapura and Matale covering 26 Divisional Secretariat Divisions through an Accelerated and Integrated Rural Development Initiative. Accordingly, it has been planned to formulate an Integrated Investment Plan for the Zone with the contribution of all the relevant Ministries and Institutions and implement the said plan in the next three years. As such, the proposal made by the Minister of Irrigation, to declare the geographical area comprising 410 Grama Niladhari Divisions covering 26 Divisional Secretariat Divisions in the districts of Kurunegala, Puttalam, Anuradhapura and Matale, as a Special Mahaweli Jurisdiction under the Mahaweli Authority of Sri Lanka Act, No.23 of 1979 and develop the said area under an Integrated Rural Development Process, was approved by the Cabinet.",
  "key": "2021-09-06-002-814b"
}