{
  "date_str": "2021-09-27",
  "decision_num": 4,
  "title": "Removing sand, soil and organic materials deposited in small/medium size tanks for the enhancement of water retention capacity",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11260",
  "decision_details": "- A programme for rehabilitating 5000 irrigated tanks and anicuts is being implemented to strengthen the rural agricultural economy. It is a prime request of farmers engaged in farming activities using these tanks to increase the capacity of the said tanks by excavating those filled due to prolonged soil erosion, growth of aquatic plants and weeds, and decaying the same. For the said purpose, the sediment deposited in those tanks should be removed and transported and there is a possibility of using sediment so removed as row materials in the industries such as pottery, sand extraction, production of organic fertilizer and road development. Therefore, Government has space to increase the water retention capacity of those tanks without being any burden to the Government whereby the Government could gain an income as well, by allowing entrepreneurs who use such row materials to remove those under certain restrictions. It has been planned to obtain the service of the National Equipment and Machinery Organization, State Development and Construction Corporation, Central Engineering Services (Pvt.) Ltd and Maganaguma Institution, since technical staff in the Department of Agrarian Development is not adequate for this purpose. Accordingly, the proposal made by the Minister of Irrigation to obtain the contribution of the private sector to remove the materials deposited in the tanks as beneficial to the Government and in conformity with the proper standards under the supervision of the Department of Agrarian Development and take necessary action to clean the bottoms of 2,000 tanks within the period of next three years and increase their capacities, was approved by the Cabinet.",
  "key": "2021-09-27-004-0cd2"
}