{
  "date_str": "2021-09-06",
  "decision_num": 4,
  "title": "Alienation of lands to Private Sector Investors on Long Term Lease basis to establish large scale Commercial Dairy farms",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11233",
  "decision_details": "- Around 40% of the liquid milk requirement in Sri Lanka is manufactured locally and about Rs.50 billion is spent annually for the importation of the balance quantity. Therefore, the Presidential Task Force for Economic Revival & Poverty Alleviation has submitted proposals to the Board of Investment of Sri Lanka to encourage the local and foreign investors for developing the local milk production. As such, the Board of Investment of Sri Lanka has called for proposals from the interested investors and the proposal made by the Minister of Agriculture to alienate the unused farm lands belonging to the National Livestock Development Board (NLDB) and those other belonging to the Government, to the investors who have submitted project proposals which have been recommended by the Technical Evaluation Committee of the said Board, on Long Term Lease basis, for a period of 30 years, to improve them as modern dairy farms.\n\n*\tAlienation of 700 acres and 60 acres from the farm in Nikaweratiya belonging to the National Livestock Development Board, to HBKLR International Investments/Acces Agro (Pvt.) Ltd. and Pehesara Logistics respectively.\n\n*\tAlienation of 811 acres from the Galabodawatta estate and Mount Jean estate belonging to the Janatha Estate Development Board, to Farm's Pride (Pvt.) Ltd..\n\n*\tAlienation of 200 acres and 150 acres from the Delthota estate and Great Valley estate respectively, belonging to the Janatha Estate Development Board, to Hillside Agro (Pvt.) Ltd.\n\n*\tAlienation of 250 acres from the Kottukachchiya farm belonging to the National Livestock Development Board, to Gamma Pizzakraft Lanka (Pvt.) Ltd.",
  "key": "2021-09-06-004-6557"
}