{
  "date_str": "2011-02-09",
  "decision_num": 15,
  "title": "Impact of recent floods and providing relief to those affected",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=3884",
  "decision_details": "-  thousands of families in the Districts of Batticaloa, Ampara, Trincomalee, Polonnaruwa, Anuradhapura, Vavuniya, Mannar, Mullaitivu and Kilinochchi have been affected due to the recent floods and those in the Districts Badulla, Nuwara-Eliya, Kandy and Matale have been affected due to heavy rains and landslides.  Immediate relief measures have already been taken by the Government to provide cooked meals, dry rations and \tshelter for those affected.  Provisional Estimates are as follows:\r\n\r\n\t* affected population - 1.2 million\r\n\t* houses damaged/destroyed - 20000 \r\n\t* minor tanks/anicuts damaged - \t500\r\n\t* cultivation areas lost - 100,000 ha.\r\n\t* paddy cultivation lost - 800,000 mt.\r\n\t* displaced families due to landslides -7000\r\n\t\r\n\tA Task Force for the purpose under the Chairmanship of H.E. the President and consisting of relevant Cabinet Ministers and Chief Ministers has been appointed to direct and monitor the implementation of a well coordinated and effective programme for restoration activities of the affected areas, through the District Secretariats and Chief Secretaries of Provinces.  Accordingly, Cabinet approval was granted - \r\n\r\n(i) to set apart Rs. 33 billion for the proposed rehabilitation programme; \r\n\t\t(ii) to suspend all supplementary budget programmes in 2011\r\n(iii) for Line Ministries and Agencies to use their existing programmes to a maximum possible extend to generate some earnings to facilitate the General Treasury to contribute to the rehabilitation programme;\r\n(iv) to concentrate on an accelerated food production drive including one million home gardens to improve food supply; and,\r\n(v) to extend the fertilizer subsidy scheme to vegetable and all other crops and make subsidized fertilizer available in the open market. \r\n\r\n\tCabinet approval was also granted to authorize the District Secretaries / Government Agents in the Districts affected by disasters to engage persons who have lost their livelihood on account of the above, for work pertaining to renovation and rehabilitation of Rural Roads, Minor Irrigation Works, Tank Bunds, Cannals etc. for a maximum period of two months, in the following manner:\r\n\r\n* to provide work for 04 days per week in work sites on payment of Rs.500/- per day.\r\n* reconstruction work to be carried out by the District Secretaries / Government Agents by deployment of Grama Niladharies and other Field and Technical Officers, as found necessary.\r\n\r\n* the Divisional Secretaries of the areas to identify the immediate needs of the disaster areas and make necessary arrangements to organize activities at the work sites.\r\n* since the renovation works and provision of relief to those affected have to be attended to expeditiously and effectively in the disaster stricken Districts, the District Secretaries / Government Agents to obtain the services of any Pubic Officer engaged in field activities, as found necessary.\r\n\r\n\tDry rations will be provided to the affected people as follows:\r\n\r\n\t\t* Rs.500/- per week for a family of two or less. \r\n\t\t* Rs.750/- per week for a family of three or four.\r\n\t\t* Rs.1,000/- per week for a family of five or more.\r\n\r\n\tCabinet also authorized Hon. Mahinda Amaraweera, Minister of Disaster Management to issue a Circular embodying the enhanced rates as indicated above and for engaging of persons who have lost their livelihood on rehabilitation work. \r\n\r\nIn addition to the above, the Government has also arranged food supply through the World Food Programme to be used to improve the food supply situation and rural work programmes in the affected areas.",
  "key": "2011-02-09-015-3d50"
}