{
  "date_str": "2016-11-29",
  "decision_num": 9,
  "title": "Improvement of the New Utility & Infrastructure facilities needed for the Development of  the Western Region Megapolis",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7281",
  "decision_details": "- With the implementation of the projects identified under the Master Plan for the Western Region Megapolis, it is anticipated that there will be a greater demand for the utility and infrastructure facilities such as  transport, electricity, water, disposal of waste water and Municipal Solid Waste. Therefore, the proposal made by Hon. Patali Champika Ranawaka, the Minister of Megapolis and Western Development, to take measures to address these challenges, was approved in principle by the Cabinet. \nInterventions to the road network\n\t*\tExtension of Baseline Road up to Galle Road;\n*\tPolduwa - Koswatta Road under construction to be extended up to Kelaniya via Kolonnawa;\n*\tWidening of 120 bus route from the Pamankada bridge up to W.A. Silva Mawatha;\n*\tConstruction of a new express transport route to Mahenawatta Science and Techno City from the Multi Modal Transport Hub at Makumbura;\n*\tConstruction of new flyovers at Kohuwala junction and over Castle Street Railway crossing near Castle Hospital;\n*\tConstruction of Multi Modal Transport Hubs at Battaramulla, Katunayake, Kadawatha, Moratuwa and Panadura and regularising the bus transport service to the city; and\n\n\n*\tThe proposed elevated road from the Kelani Bridge via Orugodawatta to Rajagiriya to be extended up to the outer circular road covering the Battaramulla Administrative City.\n\nThe Cabinet noted that the Ministry of Higher Education and Highways had already taken the preliminary steps to implement some of these projects.\nSolid Waste Management\n*\tFurther improving of the Municipal Solid Waste Disposal plants either on sorting or incineration technologies\nEnsuring the Essential Water Supply  \n*\tConstruction of larger reservoirs associated with the Seethawaka Ganga and the Vee Oya which are the branches of Kelani Ganga to cater to the increasing demand for drinking water;\n*\tRecycling of waste water and use for other activities other than for drinking; and\n*\tDesalination of sea water by obtaining electricity from the power stations at off peak periods.\t\n \nFurther, the Cabinet noted that the Water Resources Board has already taken measures to utilise more ground water than presently used for industrial purposes, with the objective of saving the river waters for the supply of drinking water and also that the Board is already in the process experimenting with regard to artificial introduction of ground water beds.",
  "key": "2016-11-29-009-fc7e"
}