{
  "date_str": "2020-08-26",
  "decision_num": 7,
  "title": "Amendment of Tax Legislation - Policy Measures for Economic Revival",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10590",
  "decision_details": "Followed by a proposal made by H.E the President, the approval of the Cabinet was granted at its meeting held on the 2019‑11‑27 for the introduction of a simple, transparent and efficient tax system to all the stakeholders in the economy including consumers, working population, entrepreneurs and tax paying community. Morefully, the Government has also taken  measures to provide fiscal and monetary stimulus to all the stakeholders in the economy including low - income earners, entrepreneurs, micro, small and medium entrepreneurs, those engaged in tourism and the farmers in order to minimize the adverse impacts caused to the production activities as well as to the employments due to the COVID - 19 pandemic. The Central Bank of Sri Lanka with the intention of easing the financial burden on the entrepreneurs has taken measures to increase the liquidity of the financial market.\n\nIt is expected that these measures will bring back the economy to normalcy in the second part of the year 2020. Accordingly, the proposal made by the Minister of Finance to publish the Bills drafted by the Legal Draftsman to amend the following Acts in compliance with the above, in the Government Gazette and thereafter present the same in Parliament, was approved by the Cabinet.\n\ni. \tNation Building Tax Act, No.9 of 2009\nii. \tEconomic Services Charge Act, No.13 of 2006\niii. \tPorts and Airports Development Levy Act, No.18 of 2011 \niv.  \tFinance Act, No.35 of 2018\n\nFurther, the Cabinet approved the proposal made to instruct the Legal Draftsman to draft legislation to amend the following Acts.\n\ni.  Inland Revenue Act, No. 24 of 2017.\nii. Value Added Tax Act, No. 14 of 2002.",
  "key": "2020-08-26-007-b099"
}