{
  "date_str": "2020-08-26",
  "decision_num": 3,
  "title": "Submission of reports published by the Ministry of Finance to Parliament",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10586",
  "decision_details": "- The following reports have been published by the Ministry of Finance and accordingly, the proposal made by the Minister of Finance to submit the said reports  to Parliament, was approved by the Cabinet. \n\n i.\tPre-election Budgetary Position Report\n\nIn terms of the provisions of Section 16 (2) of the Fiscal Management (Responsibility) Act, No.3 of 2003, the Pre-election Budgetary Position Report is required to be tabled in Parliament by the Minister of Finance within 02 weeks of the first session of the new Parliament.\n\tii.\tAnnual Report - 2019 of the Ministry of Finance\n\nIn terms of the provisions of Section 13 of the Fiscal Management (Responsibility) Act, No.3 of 2003, the Final Budgetary Position Report is required to be released to the public  by the Minister of Finance prior to lapse of 05 months after the end of the financial year and thereafter tabled in Parliament.\n\n\tiii.\tMid-Year Fiscal Position Report 2020\n\nIn terms of the provisions of Section 10 of the Fiscal Management (Responsibility) Act, No.3 of 2003, the Mid-Year Fiscal Position Report is required to be released to the public by the Minister of Finance  by the last day of June in each financial year and thereafter tabled in Parliament.\n\n\tiv.\t Annual Report - 2019 of the Central Bank of Sri Lanka\n\nIn terms of the provisions of Section 35 of the Monetary Law Act, the Monetary Board of the Central Bank of Sri Lanka should submit a report containing the state of the economy, condition of the Central Bank of Sri Lanka and the policies and measures adopted by the Monetary Board during the year to the Minister of Finance within 04 months of the commencement of the following year and thereafter the same should be submitted to Parliament.",
  "key": "2020-08-26-003-e5b8"
}