{
  "date_str": "2018-06-05",
  "decision_num": 3,
  "title": "Promotion and Implementation of the 'Enterprise Sri Lanka' Interest Subsidy Loan Scheme",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8889",
  "decision_details": "- In accordance with the budget proposals of 2017 and 2018, the 'Enterprise Sri Lanka' Interest Subsidy Loan Scheme is implemented by the Ministry of Finance and Mass Media in collaboration with the state and private banks, foreign financial cooperation institutes and the other participatory institutes. Through this programme it is expected to build a business paradise in Sri Lanka, using the innate entrepreneur expertise of the Sri Lankans. Under this programme consisting of 11 interest subsidy loan schemes, 3 refinancing loan schemes inclusive of 2 financial and non‑financial schemes, concessions are provided under 16 schemes. Accordingly, funds over Rs.30 billion have been provided by now to entrepreneurs of around 12,405 in number. The Government has set apart Rs.5,250 million for the year 2018 for the payment of interest subsidies alone in respect of the loan schemes, implemented under the programme and the Government expects the generation of 50,000 new employment opportunities, through the creation of a capital of nearly Rs.60,000 million. \n\t\n \tWith a view to popularizing the programme further among the general public, it is expected to implement it as a national level promotional programme, under the theme '2025 vision' along with the other development programmes of the Government once in every three (03) months covering all Provinces of the country in the hope of providing the necessary guidance to expand the products of the entrepreneurs up to the international level. Accordingly, the proposal made by Hon. Mangala Samaraweera, the Minister of Finance and Mass Media, to establish a Secretariat in the Ministry of Finance and Mass Media to coordinate the activities, was approved by the Cabinet.",
  "key": "2018-06-05-003-b0e6"
}