{
  "date_str": "2021-06-28",
  "decision_num": 5,
  "title": "Facilitation for the legal procedure regarding the maritime disaster caused by the fire at MV X-press Pearl",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11123",
  "decision_details": "- In order to facilitate for the legal procedure regarding the maritime disaster caused by the fire at MV X-press Pearl, a consultation programme has been initiated by the Minister of Justice under the guidance of H.E the President and with the participation of other relevant ministers. Accordingly, following measures have been taken under the said programme:\n\n* \tFive Sub-Committees have been appointed to asses the damage caused by the fire in order to obtain insurance claims.\n\n* \tNewspaper advertisements have been published in all the three languages regarding insurance claims and information.\n\n* \tThe Attorney General has taken legal action against the Ship Owner, Captain and the Board of Directors of the Local Agent at the Colombo High Court.\n\n* \tA committee has been appointed to investigate on the deaths of marine animals under the chairmanship of the Secretary, State Ministry of Wildlife Protection, Adoption of Safety Measures including the Construction of Electrical Fences and Trenches and Reforestation and Forest Resources Development.\n\n* \tExpression of Interests have been called to select a suitable legal firm since the service of law experts in the relevant field is essential for the future legal proceedings and accordingly 08 international legal firms have expressed their interest.\n\n* \tThe London P & I Club has agreed to pay Rs.720 million as an interim compensation at a discussion conducted with insurer of the said vessel by the Attorney General.\n\n\tAccordingly, the Cabinet decided to grant its concurrence for the above measures taken by the consultation process which is functioning under the chairmanship of the Minister of Justice and to appoint a Committee comprising of senior officials for selecting the most suitable law firm from among the firms who have expressed their interests for providing consultation.",
  "key": "2021-06-28-005-4017"
}