{
  "date_str": "2024-10-28",
  "decision_num": 3,
  "title": "Submission of a Joint Application by Sri Lanka and Indonesia to obtain \tbenefits under the 'Inter Regional Cumulation' included in the Developing \tCountries Trading Scheme of the United Kingdom",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12876",
  "decision_details": "- Subsequent to the UK's withdrawal from the European Union, the Developing Countries Trading Scheme (DCTS) is implemented from June 2023 in order to maintain the trade preferences granted under the Generalized System of Preferences (GSP) of the European Union. Sri Lanka has automatically become a beneficiary of the UK's DCTS, as it is a beneficiary of the EU GSP Scheme. As per the criteria under the said Scheme, in order to obtain the benefits of the relevant System of Preferences to the apparel productions in Sri Lanka, ready‑made garments are required to be made by using fabrics woven or knitted domestically, as materials. Since domestically woven or knitted apparel production was inadequate, the local apparel manufacturers have been unable to secure the benefits of the UK's DCTS at optimum level. However, according to the criteria of the Developing Countries Trading Scheme, when inputs/materials produced in a country of one regional group entitled to the preferential benefits are incorporated into a product manufactured by a country of another regional group entitled to the similar preferential benefits, provisions have been made available to treat them as a ready-made item manufactured by the country where the end product is made. The said criterion is known as Inter Regional Cumulation whereby exporters in both countries are able to accrue benefits. As per the said provisions, both ASEAN region (Regional Group I) and SAARC region (Regional Group II) are entitled to the above preferential benefits. Accordingly, the proposal made by Hon. Prime Minister in her capacity as the Minister of Trade, Commerce, Food Security, Cooperative Development, Industry and Entrepreneurship Development, to submit a single application adopting the provisions of Inter Regional Cumulation jointly by Sri Lanka and Indonesia and take necessary action to accrue the preferential benefits for both countries by obtaining inputs/materials required for the apparel industry from Indonesia and exporting Sri Lankan ready-made garments to the United Kingdom, was approved by the Cabinet.",
  "key": "2024-10-28-003-cb44"
}