{
  "date_str": "2024-10-14",
  "decision_num": 4,
  "title": "Procurement of Medical Supplies from Local Manufacturers",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12849",
  "decision_details": "- Approval of the Cabinet had been granted at the meeting held on 2013‑11‑29 to purchase locally manufactured pharmaceuticals under the Buy Back Agreement, in order to encourage local pharmaceutical manufacturers while giving priority to the functions of the State Pharmaceutical Manufacturing Corporation of Sri Lanka. Accordingly, approval of the Cabinet had been granted on 2018‑10‑02 to be in Buy Back Agreements for a period of 15 years for the productions of local manufacturing companies which are in agreement with the State Pharmaceutical Manufacturing Corporation of Sri Lanka, to purchase such pharmaceuticals giving priority to the State Pharmaceutical Manufacturing Corporation of Sri Lanka and to extend the Buy Back Agreements which have been entered into by the Ministry of Health with the local pharmaceutical manufacturers for a period of 10 years. A Pricing Committee has also been appointed to determine the prices of pharmaceuticals so supplied. As per the said procurement process, approximately 20% of the country's medical supply requirement is currently met and it has been recognized that there is a possibility of increasing that amount up to 40%. Accordingly, the Medical Supply Division of the Ministry has identified 49 local pharmaceutical manufacturing companies that have the ability to supply 454 medical supplies, including medicines. The proposal made by the Hon. Prime Minister in his capacity as the Minister of Health to enter into Buy Back Agreements to procure medicinal supplies including locally manufactured pharmaceuticals from the identified companies for a period of one year, without causing an injustice to the pharmaceutical manufacturing process of the State Pharmaceutical Manufacturing Corporation of Sri Lanka as well as to the local pharmaceutical manufacturing companies which have already been contracted, was approved by the Cabinet.",
  "key": "2024-10-14-004-358e"
}