{
  "date_str": "2012-07-11",
  "decision_num": 12,
  "title": "Implementation of the Urgent Development Programme to uplift the living standards of the people affected by the drought",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4619",
  "decision_details": "- Cabinet of Ministers at its Meeting held on 2012?07?04 directed the relevant authorities to formulate an urgent  programme to provide relief to the people affected by the drought.   Accordingly, the following proposals submitted to the Cabinet by H.E. the President, in his capacity as the Minister of Finance and Planning, for the Meeting of 2012?07?11, were approved for implementation:\r\n\r\n*\tdredging of major irrigation reservoirs so as to increase there water retention capacities - under this programme, dredging of 1278 reservoirs / tanks will be undertaken at a cost of Rs.3577 million and the increase in capacity of these reservoirs / tanks after dredging will be 7378 acre feet.   The work will be attended to by the Department of Irrigation, Mahaweli Authority of Sri Lanka and the Department of Agrarian Development.\r\n\r\n*\tprovision of Drinking Water - drinking water facilities are to be provided to 52,430 families in 12 Districts at a cost of Rs.30 million.  \r\n\r\n*\tRenovation of Agricultural Wells - dredging and renovation of 4,000 selected agricultural wells will be undertaken at a cost of Rs.40 million.\r\n\r\n*\tProject for the Payment in Cash for the work done - under this project, members of affected families between the ages of 18 and 60 are to be engaged in the renovation work pertaining to minor irrigation systems, canals and rural access roads, for a period of 8 - 12 days per month, subject to a maximum payment of Rs.6,000/- each, in their  respective areas. \r\n\r\nThis programme will be monitored by a Presidential Task Force comprising of Secretaries to the relevant Ministries.",
  "key": "2012-07-11-012-5282"
}