{
  "date_str": "2024-08-12",
  "decision_num": 1,
  "title": "Entering into Memoranda of Understanding / Collaboration Agreements between Sri Lankan Universities and Overseas Universities",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12736",
  "decision_details": "- It has been proposed to sign Memoranda of Understanding / Collaboration Agreements among Sri Lankan Universities and overseas Universities with a view to elevating Sri Lankan Universities to the top level of world ranking and developing higher educational collaborations. The said Memoranda of Understanding / Collaboration Agreements have been prepared in conformity with the observations and recommendations of the Ministry of Foreign Affairs, the Department of National Planning and the Department of External Resources. Accordingly, the proposal made by the Minister of Education to grant covering approval to sign the Memorandum of Understanding between the University of Peradeniya and the Board of Trustees of the University of Illinois of the United States of America for the mutual participation in the fields of education and research and to sign the following  Memoranda of Understanding and Collaboration of Agreements, was approved by the Cabinet.\n\n*\tCollaboration Agreement between the University of Jaffna and the University of Oxford in United Kingdom with the objective of capacity  building, conducting of training programmes, and conducting of research.\n\n*\tMemorandum of Understanding between the University of Peradeniya and Johns Hopkins University, United States of America with a view to conducting joint research in the field of nursing, educational exchange of students between the two countries and/or development of educational programmes related to the field. \n\n*\tMemorandum of Understanding between the University of Sri Jayewardenepura and Hunan University of Chinese Medicine, of the People's Republic of China regarding the exchange of student-academic staff, with the aim of strengthening collaboration in the field of Pharmacy education.\n\n*\tMemorandum of Understanding between the University of Moratuwa, and the University of Maryland of the United States of America to enter into joint activities on mutual agreement with the aim of sharing scientific knowledge and cultural traditions at the global level.\n\n*\tMemorandum of Agreement between the University of Sri Jayewardenepura and the Meiji University in Japan with the objective of exchanging academic staff for the advancement in the field of education and research. \n\n*\tMemorandum of Understanding between the University of Peradeniya and the Association of Commonwealth Universities of the United Kingdom for the Higher Education Scholarship Programme implemented under the Ocean Country Partnership Programme Scholarships.\n\n*\tMemorandum of Understanding between the University of Kelaniya and Nālandā University in India to develop academic cooperation and strengthen historical, cultural and intellectual ties between the two parties.\n\n*\tMemorandum of Understanding between Buddhist and Pali University and Vietnam Buddhist Academy with the objective of developing cooperation in the field of academic research.",
  "key": "2024-08-12-001-68f8"
}