{
  "date_str": "2024-08-12",
  "decision_num": 19,
  "title": "Proposals to revise salaries in the Public Service",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=12754",
  "decision_details": "- Approval of the Cabinet has been granted at the Cabinet meeting held on 2024‑05-27 to appoint an Expert Committee to review the salaries, wages, and other allowances in the public sector and submit a Report with recommendations for implementing the proposals to revise the salaries in all sectors of the public service through the Budget 2025. Accordingly, the Expert Committee appointed under the Chairmanship of Mr. Udaya Senevirathne, Former Secretary to the President has negotiated with the Government Officers and major trade unions in the public sector and an Interim Report has been submitted having analyzed the relevant information. The proposal made by the Hon. President in his capacity as the Minister of Finance, Economic Stabilization and National Policies to grant policy approval for the following proposals recommended by the said Report and to implement the said proposals having included them into the Budget 2025, was approved by the Cabinet.\n\n* \tClassification of all posts in the entire public sector under 04 Main levels \tand  classification of recruitment qualifications into sub-categories based on the Sri Lanka Qualification Guide (SLQF) and National Vocational Qualification (NVQ) and taking into account the relevant job role, responsibilities and attracting employees with skills for the special jobs and keeping them in jobs.\n\n* \tFollowing the Sri Lanka Qualification Guide as basic qualifications for recruitment for the Primary Service categories as well and following the appropriate selection procedures on the service requirement based on the National Vocational Skills.  \n\n* \tRecruitment for all other service categories only through formal competitive examinations and interview methods.\n\n* \tAccordingly, expeditious revision of existing approved recruitment procedures as appropriate.\n\n* \tPayment of Rs. 25,000/- per month as the cost of living allowance to all the Government employees (subject to revision once in every 03 years), adding all the allowances such as, various adjustments made to the cost of living allowances and the allowances already added,  considering 2025 as the base year.\n\n* \tIncreasing the minimum Initial monthly salary of the Public service by a minimum percentage of 24% and taking the gross salary with cost of living allowance as Rs.55,000/- and adjusting the basic salary for all other posts accordingly.\n\n* \tImplementation of this new Salary and Allowance Procedure for all the public institutions except Business State Companies and Banks.\n\n* \tTaking measures to limit the total number of employees in the public service to Ten lakhs (1,000,000) or less, by 2030.\n\n* \tAccordingly, introducing a methodology for the administration of the Government (E-Governance) in every possible field of the entire public service , through Digitalization and Automation and giving the priority of investment for that, within 03 years from 2025. \n\n* \tImplementation of a Medical Insurance Scheme including all the employees and retirees of the public sector, being entitled to the most attractive benefits with a minimum monthly contribution of Rs. 1000/- , from January 2025. \n\n* \tObtaining services by following the prescribed methodologies so as to maximize the efficiency and minimizing the cost burden of the Government through methodologies such as Outsourcing whenever possible.\n\n* \tImplementation of the restructuring programme for conversion of the identified Government Departments/Corporations/Statutory Institutions into Public Liability Companies listed in the Stock Market.\n\n* \tConduct a proper work study and take action to conduct a scientific study on  the entire public sector staff and services in year 2025.\n\n* \tAccordingly, preparing the performance indicators for all the public servants and provide salary increments based on their progress.\n\n* \tProviding salary increments entitled for the public officers retired before year 2020 and revising their pension and resolving the relevant anomalies. \n\n*   \tProviding the Cost of Living Allowance to the retirees, equivalent to 50 % of the Cost of Living Allowance provided for the public officers engaged in active service, from January 2025 onwards. \n\n* \tImplementation of the Salary System, subject to the management of these expenditures within the existing tax policy and implementation of the proposed Salary System from 2025-01-01 in stages, taking into consideration the fiscal space as well.",
  "key": "2024-08-12-019-c8e1"
}