{
  "date_str": "2011-07-13",
  "decision_num": 12,
  "title": "Proposed Laws Relating to Anti Money Laundering and Countering the Financing of Terrorism in Sri Lanka",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4096",
  "decision_details": "- the proposal made by H.E. the President to present in Parliament two amending Bills pertaining to the above, prepared by the Legal Draftsman, was approved by the Cabinet. The salient features of the two Bills are as follows: \r\n\r\n(a)\tConvention on the Suppression of Terrorist Financing (Amendment) Bill: \r\n\r\n*\tApplicability of terrorist financing law widely defined to include citizens of Sri Lanka and non-citizens while present in Sri Lanka.    \r\n\t\t\t \r\n*\tThe \"Funds\" is defined to include assets of every kind whether it is \ttangible or intangible, movable or immovable, kept in Sri Lanka or outside Sri Lanka  \r\n\t\t\t  \r\n*\tTerrorist Financing offences have been widened to include financing of a terrorist and/or any terrorist act.\r\n\r\n*\tAuthority for Police to freeze/suspend terrorist funds and properties relating to terrorists financing or activities before indictment. \r\n\r\n\r\n(b)\tPrevention of Money Laundering (Amendment) Bill:\r\n\r\n*\tApplicability of the Law has been expanded to cover any person who has committed a money laundering offence while in Sri Lanka.\r\n\r\n*\tRecovery of corresponding value of the properties related to a money laundering offence, in the absence of properties derived/realized through money laundering. \r\n\r\n*\tcoverage of unlawful activities relating to money laundering have been further expanded by inclusion of offences liable for imprisonment for five years or over. \r\n\r\n*\tcoverage of an act committed within any jurisdiction outside Sri Lanka, which would either constitute an offence in that jurisdiction or which should if committed in Sri Lanka, amount to an unlawful activity within the meaning of this Act.",
  "key": "2011-07-13-012-8ec7"
}