{
  "date_str": "2018-03-27",
  "decision_num": 37,
  "title": "Amending the Fertilizer Subsidy Policy to be effective from the Yala Season",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=8742",
  "decision_details": "The Fertilizer Subsidy Programme, which provided fertilizer to the farmers, with effect from the Yala Season in the year 2016 was determined to be in the form of a cash grant and the same is being implemented during 4 seasons consecutively, since the Yala Season, 2016 up to now. Under the programme, measures were taken to remit to the bank accounts of the farmers a sum of Rs.25,000/- for two hectares of paddy cultivation in one season and a sum of Rs.10,000/- once a year, for one hectare of selected other field crops such as potatoes, onions, capsicum, corn and soya.\n\n\tConsidering the matters which arose while reviewing the Cash Grant Policy for the purchase of fertilizer, the Government has focused its attention on making arrangements to purchase the direct fertilizer such as Urea, T. S. P. , M. O. P. and Ammonia Sulfate as required by the farmers for a concessionary price determined in the open market, based on the recommendations to be applied in respect of each crop, covering all crops in lieu of the Cash Grant Programme.\n\n\tAccordingly, the proposal made by Hon. Duminda Dissanayake, the Minister of Agriculture, to provide a bag of 50 kg of direct fertilizer such as Urea, T. S. P. and M. O. P. at a concessionary price of Rs.500/-, to the paddy cultivators for one season subject to a maximum of 5 acres through the Department of Agrarian Development, to formulate a mechanism to enable to purchase a bag of fertilizer of 50kg required by the farmers who cultivate other crops at a concessionary price of Rs.1,500/- from the open market, to contribute  Rs.675/- per season by the Government, to an Insurance Scheme on behalf of a farmer, providing a compensation of Rs.40,000/- per acre for the loss of crops such as paddy, potatoes, corn, soya and onions due to natural causes, as proposed by the Budget 2018, and to implement these proposals with effect from the Yala Season 2018, was approved by the Cabinet.",
  "key": "2018-03-27-037-6a71"
}