{
  "date_str": "2012-03-21",
  "decision_num": 15,
  "title": "Annual Report of the Sri Lanka Samurdhi Authority for the year                               2008/2009",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4460",
  "decision_details": "- Low income earners are the basic target group of the Samurdhi Programme and to provide opportunities for them to have a sustainable source of income and to make them stakeholders in the national production, a large number of  Agricultural Development Programmes have been implemented. Some of the main programmes are as follows:\r\n\r\n  *\tLocal Food Promotion Project -  cultivation projects such as fruits,vegetables, yams, leafy vegetables, field crops an cereals were implemented. \r\n\r\n*\tNational Project for the enrichment of small scale plantation crop growers - attention was paid to the cultivation of cinnamon, in addition to tea, coconut and rubber. \r\n\r\n*\tProject for the tilling of fallow paddy lands - this was inaugurated to encourage re-tilling of cultivable paddy lands. \r\n\r\n*\tSupply of Solar Powered sprinkler water supply kits -  this was implemented in collaboration with the Department of Agriculture thorough a  concessionary line of credit granted by the Government of Australia to the Government of Sri Lanka. \r\n\r\n*\tHome Garden Development Programme for Nutrition  Enhancement - this was implemented to make available the basic nutritional requirements of low income earners from their home gardens, enabling them to earn an extra income through the sale of surplus production. Under this programme, a sum of Rs.90 million had been spent for 72,073 home gardens. \r\n\r\n*\tPost Harvesting Technology Project -  this was implemented mainly in the districts of Matale, Anuradhapura, Polonnaruwa and Vavuniya to enable Samurdhi Beneficiaries to obtain a higher price by storing the harvest of onions and releasing it to the market when the prices were on the rise. \r\n\r\n\t  \r\n\tThe above Annual Report submitted by Hon. Basil Rajapakse, Minister of Economic Development, was approved by the Cabinet to be presented in Parliament.",
  "key": "2012-03-21-015-b0d4"
}