{
  "date_str": "2020-09-09",
  "decision_num": 3,
  "title": "Accelerated programme to supply fertilizer without a shortage during 2020/21 Maha Season",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10604",
  "decision_details": "- During the preceding period the constant changes to the fertilizer subsidy policy, unsettlement of payments to the respective companies which import fertilizer and release of low quality non‑standardized fertilizer to the market have resulted the farmers to face much hardships. Therefore, evading such situation, the following measures have been planned, to implement the mechanism properly to distribute fertilizer to the farmers from the Maha Season 2020/21.\n\n\n\n*\tTo implement the programme to distribute fertilizer free of charge to the paddy farmers further in the same manner as it was implemented and to implement the programmes to popularize environmental friendly fertilizer among paddy farmers.\n\n*\tTo expeditiously import 230,000 metric tons of fertilizer required by the farmers for the Maha Season 2020/21 through the State Fertilizer Companies .\n\n*\tTo grant permission to import 300,000 metric tons of fertilizer required further to the fertilizer companies which agreed to import such fertilizer considering the fact that only 40,000 metric tons are available in the possession of the fertilizer companies to fulfill the fertilizer requirement of 332,000 metric tons required for the crops other than paddy during the Maha Season 2020/21.\n\n*\tTo grant permission for the other qualified fertilizer companies as well, to import fertilizer for Maha Season 2020/21, subject to a maximum of 5,000 metric tons.\n\n*\tTo provide an opportunity for any farmer to purchase a 50 kg bag of fertilizer required for the crops other than paddy, at a subsidized rate of Rs.1,500/- in the open market. \n\nAs such, the joint proposal made to implement the above programme by the Hon. Prime Minister in his capacity as the Minister of Finance and the Minister of Agriculture, was approved by the Cabinet.",
  "key": "2020-09-09-003-b771"
}