{
  "date_str": "2020-09-16",
  "decision_num": 6,
  "title": "Establishment of the Attanagalla Industrial Estate",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10612",
  "decision_details": "- At present, 32 Industrial Estates functioning under the Ministry of Industries  operate throughout the country and private investors have invested approximately Rs.36,500 million in these Industrial Estates. The Government has incurred around Rs.4,517 million for the infrastructure development of these Industrial Estates and the number of employment opportunities generated by these estates is around 18,600.\n\nEven though approximately 150 investors interested in commence the industries  in the Western Province, have submitted their applications, it has been found that they could not be provided with the necessary facilities within the 08 Industrial Estates located in the said Province. Therefore, it has been planned to establish a new Industrial Estate covering both  Gampaha and Kegalle districts and to give priority for manufacturing and assembling of electric and electronic accessories, packaging materials, value added agricultural products, rubber and plastic allied products, garments and allied products and pharmaceuticals and allied products in the said industrial estate and to allocate a space from the proposed  estate for recycling and research development activities.\n\nAccordingly, the Cabinet, as a matter of policy granted approval for the joint proposal made by the Minister of Industries and the Minister of Lands to establish the aforesaid Industrial Estate as a Green Industrial Estate on a land called “Pethiyakanda Watta”of 194 acres in extent  situated at both Attanagalla and Warakapola Divisional Secretariat Divisions belonging to the Land Reform Commission and it was also decided to assign the Department of National Planning to conduct a detailed evaluation in respect of this matter.",
  "key": "2020-09-16-006-dda9"
}