{
  "date_str": "2020-09-28",
  "decision_num": 14,
  "title": "The Light Rail Transit System Project (LRT) proposed to be implemented \tin the Western region of Sri Lanka under the financial assistance of the \tJapan International Cooperation Agency (JICA)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10643",
  "decision_details": "-The Cabinet approval has been granted to implement the Light Rail Transit System Project within the Western region of Sri Lanka under the financial assistance of JICA. However, it has been observed that it would not be able to achieve the expected outcome of that project due to the following reasons. \n\n\n\n*\tAccording to the initial plan of the project, it had been proposed to introduce a Light Rail Service with facilities to travel along the overland railway tracks as an alternative mode of transport for persons who come to the city of Colombo for employment and other requirements by using their private motor vehicles. \n\n*\tHowever, the previous Government, changing the aforesaid plan, had taken the necessary basic measures to implement the proposed Light Rail Transit System on a railway track built on pillars that may cause huge environmental damage.\n\n*\tIt has been found that if the project is implemented, a large number of buildings including houses and business premises will have to be demolished and a very high cost will have to be incurred for constructing the railway track on pillars.\n\n*\tIt has been observed that it would not be possible to provide the required facilities through this train expected to be implemented under the proposed Light Rail Transit System as an alternative mode of transport to attract persons, coming to the city of Colombo for employment and other purposes by using their private motor vehicles.\n\n*\tFurther, it has also been found that if the proposed Light Rail Transit System Project is implemented, a heavy operational cost will have to be incurred for the same. \n\n\tAccordingly, taking into consideration the matters submitted by the Minister of Transport as the Minister in charge of the subject of implementing this Project at present, the Cabinet decided to cancel the Light Rail Transit System Project planned to be implemented in the Western region.",
  "key": "2020-09-28-014-3e64"
}