{
  "date_str": "2020-09-21",
  "decision_num": 2,
  "title": "Meeting of the Cabinet Sub-Committee on Cost of Living",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10623",
  "decision_details": "- The first meeting of the Cabinet Sub-Committee on Cost of Living appointed by the Cabinet to provide policy and practical solutions to maintain the Cost of Living stable in the country was held under the Chairmanship of H.E the President on 2020-08-31. Accordingly, the decisions taken at the said Sub-Committee meeting pertaining to the following matters to ensure that essential goods including food items are available in the market without any scarcity and to monitor the stable maintenance of the Cost of Living were submitted to the Cabinet by the Minister of Trade and the Cabinet granted its concurrence for the same. \n\n* \tTo focus more attention on the most affected categories, when taking measures pertaining to the reduction of the Cost of Living.\n\n*\tTo maintain a stable local policy towards motivating the farmers to engage in cultivation and accordingly restrict the imports only to essential goods. \n\n*\tTo formulate a system to purchase the goods by the consumers at a reasonable price, providing suitable prices for the products of the farmers since the prices of goods would rise due to the pressure of the intermediaries.\n\n*\tTo establish a seed bank as a solution to the dearth of various high quality seeds that can be grown locally and for the preservation of local seeds which are progressively getting extinguished.\n\n*\tTo implement a mechanism for the distribution of products such as vegetables and fruits effectively to the consumers at an affordable price regulating the prices of the same. \n\n* \tTo design and implementation of a programme under the guidance of the Ministry of Plantation, Ministry of Agriculture and the Ministry of Trade to directly purchase the produced from the farmers and sell them in towns in populated areas accordingly.\n\n*\tTo suspend the import of additional crops which can be cultivated locally since there is a huge tendency of cultivating such crops by farmers, and give priority to promote the increase of production of local vegetables and to promote substitute crops for the crops to be imported.\n\n*\tTo ensure the availability of sufficient stocks of rice in the market at the guaranteed price by the Government, while maintaining safe stocks of rice without leaving space to escalate rice prices until the paddy harvest of the \tMaha season reaches the market.\n\n*\tDue to the complete suspension of the importation of the required materials specially maize required for producing chicken feed, the price of maize has gone up resulting in the increase of the prices of chicken and eggs. Therefore, it has been permitted temporarily to import wheat to be used as a substitute for maize on import permits for the purpose of controlling the escalation of the prices of chicken and eggs. As such, a suitable programme will have to be expeditiously implemented by the responsible Institutions for providing the required lands, seeds, fertilizer and required technology to expand the maize cultivation in the country.\n\n*\tThe Ceylon Fisheries Corporation to take measures to increase the market stalls and to expeditiously open the 40 stalls designed to be opened enabling the consumers to purchase fish at a reasonable price.\n\n*\tExpeditious action to be taken to increase the milk production and for such purpose, implement an arrangement to provide the milk farmers with required facilities and technical knowledge.\n\n*\tSince there is a tendency of a price increase of coconuts in the market, to implement a programme to sell coconuts in the populated towns by the Ministry of Plantation, enabling the consumers to\tpurchase them at a reasonable price.",
  "key": "2020-09-21-002-0839"
}