{
  "date_str": "2020-09-28",
  "decision_num": 1,
  "title": "Taking further measures regarding the families in the houses reported to be prone to high risk due to a geographical instability in the district of Polonnaruwa",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10630",
  "decision_details": "- Walls of 223 houses in 06 Grama Niladhari divisions of the Hingurakgoda Divisional Secretariat Division in the Polonnaruwa district have been unusually cracked due to a geographical instability in the interior of the earth causing the danger of the collapse of those houses. Out of the said houses 67 houses identified to have been severely damaged and uninhabitable, should be evacuated with immediate effect, and resettled in a suitable place. \n\n\nApproval of the Cabinet has been granted previously at its meeting held on 2017‑06‑27 for a methodology for the construction of permanent houses for families residing within high risk zones of earth slips and, accordingly taking into consideration the proposal made by the Minister of Irrigation and State Minister of Internal Security, Home Affairs and Disaster Management regarding the necessary measures to be taken on the said affected families, the Cabinet approved to take the following measures -\n\n\n* \tEvacuation of families from the houses identified as high risk and settle them temporarily in another secure place.\n\n\n* \tProvision of a rental allowance subject to a maximum of Rs.10,000.00 per month for a period of 06 months for each family so settled.\n\n\n* \tImplementation of an accelerated housing scheme with required infrastructure facilities by the Ministry of Urban Development and Housing and provide houses from the said Housing Scheme to the families to be evacuated.\n\n\n*\tIf the proposed housing scheme cannot be implemented within a short period of time, provide the following relief granted under the resettlement programme for the families who were evacuated due to high risk of landslides in terms of the Cabinet decision dated 2017‑06‑27 to the families to be evacuated from their places of living due to disaster situation in the Hingurakgoda Divisional Secretariat Division. \n\n\ni \tGranting Rs.1.6 million to purchase a land with a house.\n\n\nii\tGranting Rs.0.4 million to purchase a land and Rs.1.2 million to build a house .\n\n\niii\tIf a land has been granted by the State, granting Rs.1.2 million to build a house on such land.",
  "key": "2020-09-28-001-569d"
}