{
  "date_str": "2020-09-16",
  "decision_num": 14,
  "title": "Preparation of Budget 2021",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10620",
  "decision_details": "- The Hon. Prime Minister in his capacity as the Minister of Finance, presented the policy frame work to be followed in the  preparation of the Budget for the year 2021, giving priority to the following:\n\n* \tAllocation of resources to ensure the outcomes of the Government Policy document 'Vistas of Prosperity and Splendour' is achieved.\n\n*\tAllocation of resources to achieve the objectives stated in the Gazette Notification issued pertaining to the assignment of subjects and functions of the Cabinet Ministries and State Ministries.\n\n* \tProvision of safe drinking water to all, implementation of the programme for the rehabilitation and development of 100,000km roads covering the entire country, giving priority to aquatic resources and irrigation sectors.\n\n* \tAllocation of resources required for the Public Investment Programme creating an enabling environment for successful operation of business activities following the expenditure management methodologies under the prevailing circumstances since the State revenue for the 2021 is estimated to be approximately 10.2% of the Gross Domestic Production.\n\n* \tProviding  assistance for the digitalization of the Government processes.\n\n* \tFocus attention on the possibilities of adopting simple methodologies by \treviewing the existing methodologies enabling to yield better effective results utilizing fewer resources.\n\n\n\nAccordingly, the draft Appropriation Bill for the year 2021 is scheduled to be tabled in  Parliament during the second week of October 2020.\n\nThe proposal made by the Hon. Prime Minister in his capacity as the Minister of Finance, to take necessary action to draft the Appropriation Bill of the year 2021 based on the policies mentioned above, was approved by the Cabinet.",
  "key": "2020-09-16-014-241b"
}