{
  "date_str": "2021-03-08",
  "decision_num": 12,
  "title": "Setting up a Pharma Zone in Millewa, Horana",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10983",
  "decision_details": "- In line with the policies of the new government, strategic measures are being used by the State Pharmaceuticals Manufacturing Corporation to manufacture most pharmaceuticals locally. Accordingly, the establishment of pharma zones in Arabokka in the Hambantota District and Oyamaduwa in the Anuradhapura District has now been initiated. In addition, another Pharma Zone is scheduled to be established in Millewa, Horana. Orthopedic and Neuro-Surgical Implants, Oncology drugs, Oral Solid Dosage products and Cardiac Stents and Intra Ocular Lenses are expected to be manufactured in this Pharma Zone. The project is scheduled to be implemented under two phases and the first phase of the project is expected to commence in March 2021 with an estimated investment of Rs. 8 billion. A Memorandum of Understanding (MoU) has already been entered into between the State Pharmaceuticals Manufacturing Corporation and the Urban Development Authority to allocate a block of land in extent of 64 acres and 83.3 perches in Millewa area belonging to the Urban Development Authority to establish the proposed Pharma Zone. Accordingly, the joint proposal made by Hon. Prime Minister in his capacity as the Minister of Housing and Urban Development and the Minister of Health to appoint a Steering Committee chaired by the Secretary to the Ministry of Finance, comprising of the representatives of other relevant Ministries and Institutions enabling to implement the proposed project expeditiously and to appoint a Project Management Committee headed by the Chairman of the State Pharmaceuticals Manufacturing Corporation to provide the necessary technical matters to the said Steering Committee and to appoint Selendiva Investment Company, a fully state-owned company, as the Project Manager to provide pre- and post-contract and financial consultancy services, was approved by the Cabinet.",
  "key": "2021-03-08-012-e779"
}