{
  "date_str": "2021-03-01",
  "decision_num": 18,
  "title": "Report on the progress of the Development Projects implemented under the Line Ministries by the end of the financial year 2020",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10970",
  "decision_details": "- In terms of the Cabinet decision dated 2018‑04‑25, the Ministry of Finance should submit a report on the physical progress of the projects implemented by the Line Ministries through the Capital budget, to the Cabinet on quarterly basis. As such, the progress report pertaining to the large scale projects implemented in the year 2020 was submitted by the Minister of Finance to the Cabinet. The following information was brought to the notice of the Cabinet through the said report:\n\n* \t289 development projects of which the estimated cost exceeds Rs. 01 billion in the year 2020, have been implemented under the purview of 40 Line Ministries.\n\n*\tAn allocation of around Rs.710 billion has been made for the said projects and its financial progress amounts to 72%.\n\n*\tA further allocation of Rs.2.9 trillion has to be made approximately for future activities of the said 289 development projects.\n\n*\tThere have been various issues and impediments during the implementation of these projects and although around Rs.08 billion has been spent for the additional staff dedicated for the project, it has been observed in this report that the expected results could not be achieved within the approved cost and duration pertaining to certain projects.\n\n*\tCertain weaknesses have been observed since the per-preparatory stage of certain projects and the delay caused in obtaining the required approvals from Public Institutions has sometimes become a problem in the implementation of the projects.\n\nTaking into consideration also the information furnished in the said report by the Hon. Prime Minister in his capacity as the Minister of Finance, Cabinet decided to appoint a Committee comprising the Senior Secretaries and headed by the State Minister of Money & Capital Market and State Enterprise Reforms, to resolve the issues regarding the large scale Capital budget projects and to conduct monthly reviews on obtaining the optimum and timely assistance from the relevant parties.",
  "key": "2021-03-01-018-1264"
}