{
  "date_str": "2021-03-08",
  "decision_num": 13,
  "title": "Amending legislations to require security deposit when filling appeals, revisions and writ applications against grants and decisions granted under the Termination of Employment of Workmen (Special Provisions) Act No. 45 of 1971 and Industrial Disputes Act No. 43 of 1950",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10984",
  "decision_details": "- The Termination of Employment of Workmen (Special Provisions) Act No. 45 of 1971 has been introduced with a view to preventing the termination of employment of employees and it has ensured the job security of workmen by constituting legal action against employers who act deviating from the provisions of the said Act. Similarly, the Industrial Disputes Act, No.43 of 1950 has been introduced with a view to solving industrial disputes between employers and employees expeditiously in a reasonable manner. Further, in the circumstances where orders are made in favour of employers under the above two Acts, it has been observed that there is a tendency of constituting legal action by employers to prevent the enforcement of such orders. In this context, it has been observed that there are instances where nearly 15-20 years have lapsed for the implementation of relevant orders and that the employees could not receive the expected relief due to the death of employers, migration, avoidance of courts and liquidation of companies during the aforesaid period, Accordingly, the proposal made by the Minister of Labour to amend the Termination of Employment of Workmen (Special Provisions) Act No. 45 of 1971and the Industrial Disputes Act, No.43 of 1950, enabling to initiate the litigation process only after furnishing security deposit when employers institute legal actions against an Order of the Commissioner General of Labour under  the Termination of Employment of Workmen (Special Provisions) Act, No.45 of 1971 or a decision of the Magistrate’s Court to enforce such Order or against Industrial Arbitration award or an Industrial Court award under the provisions of the Industrial Disputes Act No.43 of 1950, was approved by the Cabinet.",
  "key": "2021-03-08-013-84a2"
}