{
  "date_str": "2016-05-17",
  "decision_num": 3,
  "title": "Establishment of the Asian Institute for Science of Technology (AIST)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=6758",
  "decision_details": "- Out of the students who sit the G.C.E (A/L) Examination annually, only around 22% are selected for the universities and as such, a large number of students leave the country annually to avail themselves the opportunities for higher education. However, most of these students do not return to Sri Lanka. In this background, it is intended to establish a higher educational institute by the name of 'Asian Institute for Science of Technology' (AIST) as a public - private investment, which could generate foreign exchange while providing educational opportunities for both local and foreign students.  Japan, who is a leading development partner of Sri Lanka has come forward to grant financial aid for this project. It is anticipated to establish a 'Technology Village' associated with AIST by the year 2025 and leading Japanese industrial partners will be invited to set up their production centres, research and development centres, high-end design centres etc; Special training programmes will be implemented for the students of this Institute, in the fields such as Nanotechnology, Electrical and Electronics, Information and Communication Technology (ICT), Telecommunication and Robotics, to enable them to enter into the industrial job market. Therefore, the proposal made by Hon. Susil Premajayantha, the Minister of Science, Technology and Research, to establish AIST in a land at Malabe in extent of 100 acres, which has been proposed for the City for Science and Technology to be set up under the Western Region Megapolis Plan and to obtain the relevant technological and  financial aid from the Japanese Government as well as from the other donor funding agencies, was approved by the Cabinet.",
  "key": "2016-05-17-003-1308"
}