{
  "date_str": "2016-10-04",
  "decision_num": 5,
  "title": "Provision of relief to persons affected by recent disasters - Progress as at 2016-08-31",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=7089",
  "decision_details": "- The Cabinet noted the following information submitted by Hon. Anura Priyadharashan Yapa, the Minister of Disaster Management, relating to the progress  achieved by the end of August  2016, on the provision of relief to  persons affected by the explosion that occurred on 2016-06-05 at the Salawa Army Camp located in Seethawaka Divisional Secretariat Division of the Colombo District, provision of relief to persons affected by the landslides which occurred as a result of heavy rains in the Kegalle District between 10th  to 17th of May 2016 and the provision of relief for those who were affected due to floods and landslides that occurred in  May 2016:   \n *   Provision of Rs.422.85 million has already been issued to District Secretariat, Colombo, for the provision of relief  to people affected by the explosion that occurred at the Army Camp located at Salawa, and the said provisions have been spent to provide monthly allowances for  persons with damaged houses until they  return  to their houses, to grant allowances to those affected who were self-employed and  for the payment of compensation  for the damaged houses.  \n*      Provisions have been given to the District Secretariat Kegalle, at various instances, to provide relief to 34,653 people of 9,588 families in the said district, who were affected due to landslides which occurred as a result of heavy rains in the Kegalle District between 10th to 17th of May 2016 and action is being taken to construct 145 houses, for the families recommended to be resettled due to high-risk, with the contribution of the private sector.  \n*    \tMeasures have been taken to provide Rs. 586.79 million  under the National Insurance Programme for natural disasters, Rs.149.02 million  under  the National Insurance Programme and Rs. 111.21 million  under the treasury provisions for the  provision of relief to  586,731 persons of 142,942 families affected due to disasters of floods and landslides that occurred in  May 2016.",
  "key": "2016-10-04-005-7c1b"
}