{
  "date_str": "2011-09-28",
  "decision_num": 2,
  "title": "Approval for 10 year Development plan for the Implementation of Medium/Large Scale Irrigation Projects by the Ministry of Irrigation & Water Resources Management",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4215",
  "decision_details": "- Hon. Nimal Siripala de Silva, Minister of Irrigation & Water Resources Management, presented an Investment Plan for the development of this sector in the ensuing ten years.  In the preparation of this Plan due consideration has been given to meet all the water requirements by optimum utilization of the water resources in the country.  The following are included in this Plan:\r\n\r\n*\tDiversion of Siyambalangamuwa Oya to augment Maha Galgamuwa Wewa - this is an ancient tank located in Ehetuwewa Divisional Secretary's Division in the Kurunegala District.  Augmentation of this tank will enable to ensure irrigation water to 1200 acres of existing land and 200 acres of new land. It is proposed to cultivate paddy, chillies, red onion and maize in both Yala and Maha seasons.\r\n\r\n\r\n\r\n\r\n\r\n*\tConstruction of Lower Malwathu Oya Reservoir - it is planned to provide irrigation water for 809 hectares of new land immediately down stream of the proposed reservoir and to cultivate mainly fruits crops, such as mango, guava and grapes etc.\r\n\r\n*\tRidemaliyadde Integrated Development Project - this project is expected to upgrade available irrigation infrastructure, provide 100 agro wells for highland cultivation and 100 drinking water wells, introduce commercial crop cultivation  in 1100 hectares, livestock related income opportunities for 1000 families and provide sanitary facilities, roads etc.\r\n\r\n*\tWeli Oya (Mahaweli System L) Integrated Development - this project will provide facilities for irrigating 1700 hectares of new land and 700 hectares of existing lands for cultivation of paddy and other field crops in Maha and Yala seasons.  2400 farmer families in System L area will be benefited by this Scheme.  The tentative cost of this project is Rs.6000 million. \r\n\r\n*\tExtension of Kaudulla L.B. Main Canal upto Damsopura Wewa -  the proposed project is expected to provide irrigation facilities to 1850 acres of paddy land including 870 acres new land.\r\n\t\r\n*\tRambaken Oya Integrated Development Project - the project will enhance the benefits of the Rambukkan  Oya Reservoir Project and improve the living standards of the community living in Maha Oya and Padiyathalawa D.S. Divisions which are considered as under developed areas.\r\n\r\n*\tSystem B - Maduru Oya Right Bank Development Project - the proposed project consists of construction of 76.9 Km. length of canal network and to provide irrigation facilities for 14,000 hectares. The project will enhance the living standards of 12630 settlers in zones 7 and 8. \r\n\r\n\tCabinet approval was granted for the implementation of the above projects.",
  "key": "2011-09-28-002-de53"
}