{
  "date_str": "2021-07-05",
  "decision_num": 4,
  "title": "Keeping Children Learning Through Home-based Activities' during the COVID-19 closure of schools",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11136",
  "decision_details": "- Action has been taken to offer education to students through alternative ways such as 'e-thaksalawa', 'Guru Gedara' TV and radio programmes, NIE YouTube Channel and Provincial level and School level on‑line lessons during the school closure due to the COVID‑19 pandemic situation. However, practical issues have arisen in respect of optimal utilization of schools, principals, teachers, in‑service advisors and other senior officials, maintenance of common standards in teaching methods, accounting of student engagement and assessment of learner achievement. Accordingly, as a remedial measure against the said issues, the proposal made by the Minister of Education to implement a programme titled 'Keeping Children Learning Through Home‑based Activities' designed as follows, from 2021‑08‑01, by utilizing all institutions and human resources belonging to the Education sector optimally, following the health rules and guidelines, was approved by the Cabinet. \n\n* \tstandardization and integration of activities with the expected learning outcomes for each grade level.\n\n* \tsupervision and monitoring of activities by teachers.\n\n* \tWeekly assessment of student performance and maintenance of student performance reports by teachers.\n\n* \tImplementation of Home‑based Learning activities by the school principal and teachers with the involvement of parents and students.\n\n*\tSupervision and monitoring of teacher performance by the in‑service advisors.\n\n* \tAppointment of Committees comprising Senior Officials to implement and monitor the proposed programme at national, provincial and zonal levels.",
  "key": "2021-07-05-004-8424"
}