{
  "date_str": "2021-07-26",
  "decision_num": 7,
  "title": "Preparation of the Annual Budget for the Year 2022",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11173",
  "decision_details": "- The Minister of Finance informed the Cabinet the following measures intended to be taken when preparing Annual Budget for the year 2022 within the Medium Term Budgetary Framework 2022-2024 and the Cabinet granted its concurrence for the same.\n\n\t(a)\tMacroeconomic Targets expected to be achieved ( As percentage of \tGDP) -\n\n\t\t*\tGovernment Revenue\t\t-\t13.0\n\t\t*\tGovernment Expenditure\t\t-\t20.6\n\t\t*\tBudget Deficit\t\t\t-\t-7.5\n\t\t*\tCentral Government Debt\t\t-\t95.0\n\t\t*\tEconomic Growth\tRate\t\t-\t6.0\n\n\tIn order to achieve the said targets, it is expected to maintain a stable  exchange rate, to maintain the inflation at a stable figure of 5% and to bring the unemployment rate below 4%, in the year 2022.\n\t\n\t(b)\tkeep the country open while safeguarding public health and continuing \tprecautionary measures against the Covid -19 pandemic.\n\n\t(c)\tGiving top priorities for using digital technology for rendering \tpublic service, providing required relief and facilities  for the sectors \taffected by the Covid -19, expanding and promoting import substitutes \tencouraging private sector investments towards export-oriented sectors, \tstrengthening foreign direct investments by creating friendly \tenvironment for the investment, expanding government revenue and \tmoving towards renewable energy.\n\t(d)\thighly discouraging the activities such as new constructions except \tongoing projects and tasks, expanding office space, purchase of new \tfurniture and equipment, \tnew recruitment, purchase of new vehicles \tother than essential\tvehicles, until the economy returned to the \tnormalcy.\n\n\t(e)\tmoving every Government institution towards new avenues of revenue \tgeneration in their capacity during  the year 2022.",
  "key": "2021-07-26-007-d9ed"
}