{
  "date_str": "2021-07-12",
  "decision_num": 5,
  "title": "Submission of ''Nationally Determined Contributions'' to the United Nations Framework Convention on Climate Change related to the Paris Agreement",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11152",
  "decision_details": "- Sri Lanka functions as a party of the United Nations Framework Convention on Climate Changes from the year 1993. Accordingly, Sri Lanka signed the Paris Agreement on 2016‑04‑21 and it was ratified on the 21st September of the same year. The prime objective of the Paris Agreement is to maintain global warming under 2° C compared to the level which prevailed in the pre – industrial era, and to take all possible measures to maintain it at 1.5° C level. The activities carried out by the stakeholders to achieve said objectives are called as “Nationally Determined Contributions”.\n\nAccordingly, the first “Nationally Determined Contributions” recognized to implement by Sri Lanka during the period 2020 – 2030 has been submitted to United Nations Framework Convention on Climate Changes in the year 2016 with the Cabinet approval. Those contributions, submitting under 14 major sectors should be updated once in every 05 years and re–submitted by preparing same in a more targeted manner. However, those updated contributions were scheduled to be submitted to the 26th session of stakeholders to be held in the month of December 2020, yet the session has been postponed up to the month of November 2021 due to the COVID pandemic situation. Accordingly, the proposal made by the Minister of Environment to submit the “Nationally Determined Contributions” that has been re–updated with the participation of stakeholder institutions of the relevant sectors by adapting to the current Government policy to the United Nations Framework Convention on Climate Changes and to appoint a National Steering Committee to monitor the effective implementation of the said contributions, was approved by the Cabinet.",
  "key": "2021-07-12-005-b408"
}