{
  "date_str": "2012-11-14",
  "decision_num": 15,
  "title": "Cabinet Paper No.12/1534/558/041-I (2012-11-14) \nAppeals made against the Disciplinary Orders issued by the Cabinet of Ministers on behalf of the Public Service Commission during the period between 2009?04?09 and 2011?05?12 when the Commission was non-functional",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=4868",
  "decision_details": "- (Cabinet decision dated 2012?10?18 - Item 41 refers) Cabinet of Ministers having considered the facts enumerated in the above Report, decided that action should be taken in the following manner in order to ensure administrative fairness: \r\n \r\n(a)\tto grant approval as a matter of policy in terms of Sub-Article 55(1) of the Constitution, to deem it appropriate for the Public Service Commission (PSC) to consider petitions submitted to the Commission by officers aggrieved by the decisions taken by the Cabinet of Ministers in respect of the disciplinary matters that would have otherwise come within the purview of the PSC if not for it being non-functional from 2009?04?09 to 2011?05?12, under the special circumstances set out below:\r\n\r\n(i)\tpetitions, requesting the consideration of a fact or facts that should have been considered during the formal disciplinary inquiry or during the deliberations of the Cabinet of Ministers, but had not been so considered;\r\n\r\n\r\n(ii)\tpetitions, regarding any procedural impropriety which has occurred from the time of the commencement of the formal disciplinary inquiry to the issuance of the formal disciplinary order that has resulted in prejudice to the accused;\r\n\r\n(iii)\tpetitions indicating that the punishment stipulated by the Cabinet of Ministers in the course of carrying out the functions of the disciplinary authority was excessively severe having regard to the comparable precedents.\r\n\r\n\r\n(b)\tFor the PSC to receive petitions under the aforesaid grounds during a period specified by it. The PSC shall decide and convey its decisions to the administrative authority and the petitioner within a time frame determined by it.\r\n\r\n\tThe Cabinet of Ministers also observed that the rationale of the above arrangement is to enable Public Officers who had been aggrieved by the disciplinary orders issued by the Cabinet of Ministers during the period in which the PSC was non-functional, to petition the PSC as would otherwise have been the case, and if aggrieved by the decision of the PSC to make available therefrom an appeal to the Administrative Appeals Tribunal within four (04) weeks of the receipt of the order or decision by the PSC.",
  "key": "2012-11-14-015-077b"
}