{
  "date_str": "2022-02-14",
  "decision_num": 5,
  "title": "Green Sri Lanka- “One Person-One Plant” National Programme - 2022",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11460",
  "decision_details": "- A provision of Rs.2000/- million has been allocated under budget proposals - 2022, to implement a suitable programme to increase the forest cover up to 30% by 2025 while preserving the existing forests in Sri Lanka and to increase the forestation through beneficial plants having removed invasive plants while  protecting water catchment areas. Accordingly, the Ministry of Wildlife and Forest Conservation has taken measures to implement a National Programme  on “One Person-One Plant”. Under the said programme, it is expected to implement following projects.\n\n* \tEstablishment of 200 forest villages\n\n* Implementation of Tree Plantation Programms in Schools and National   Educational Institutes in Sri Lanka.\n\n* \tEstablishment of Island Wide Herbal Gardens\n\n* \tImplementation of Tree Plantation Programms in Religious Places.\n\n* \tImplementation of Tree Plantation Programms in watersheds of reservoirs, irrigation reserves and catchment areas.\n\n* Implementation of Tree Plantation Programms in the lands owned by Government Institutions, Semi-Government Institutions, Corporations, Boards and Statuary Boards.\n\n*\tImplementation of Tree Plantation Programms in the lands owned by Plantation Companies and privately owned lands.\n\n*\tEstablishment of Island wide Nurseries.\n\n*\tImplementation of a series of publicity campaigns to educate school children and the Community on the Wildlife and Forest Conservation.\n\n* \tIdentification of suitable plant species for forestation and implementation of a research programme to carry out development programmes together with the Universities.\n\n\tIt is expected to implement these projects under the guidance of the District Sectaries and Divisional Secretaries. Accordingly, the Cabinet decided to grant its concurrence to implement the said programme as per the proposal made by the Minister of Wildlife and Forest Conservation.",
  "key": "2022-02-14-005-728a"
}