{
  "date_str": "2022-02-14",
  "decision_num": 3,
  "title": "Establishment of a Mini Super Market Chain (Home Shop) for Women Entrepreneurs",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=11458",
  "decision_details": "- A provision of Rs.15,000 million has been allocated under the budget 2022 for the programme for the Establishment of  a Mini Super Market Chain (Home Shop) for Women Entrepreneurs with the objective of “creating a woman entrepreneur in every village” by offering entrepreneurial guidance and assisting them in finding seed capital, having identified women entrepreneurs in rural family units who are interested in entrepreneurship. The identification of the relevant entrepreneurs is done by the Divisional Secretaries under the guidance of the Divisional Development Committee on the instructions of the Presidential Task Force on Poverty Alleviation. The selected woman entrepreneur will be able to set aside some space for this purpose, under one of the following methods,  either by allocating 200-400 square feet from a part of her home or renovating the house or by getting newly constructed by the Urban Development Authority or the National Housing Development Authority. Relevant Mini Super Markets are to be connected through a computer network and equipment and furniture needed for those shops will be provided by the Government. Plans have been made to supply consumer items for sale to women entrepreneurs through cooperative societies. Relevant beneficiaries will be able to purchase essential commodities including locally produced food items amounting to Rs.2000/- under the proposed Relief Basket Programme through a digital card given for low income earning families selected on special criteria. Accordingly, the proposal made by the Minister of Trade to take necessary action to implement the said programme, was approved by the Cabinet.",
  "key": "2022-02-14-003-689a"
}