{
  "date_str": "2020-02-27",
  "decision_num": 24,
  "title": "Inception Report of the Committee appointed to review the Compact Development Agreement of the Millennium Challenge Corporation (MCC)",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10451",
  "decision_details": "- In pursuance of a decision made by the Cabinet at its meeting held on 18th  December 2019, a Review Committee chaired by Prof. Lalithasiri Gunaruwan has been appointed to examine the MCC Agreement and submit recommendations to the Cabinet on action to be taken. The said Committee has submitted an Inception Report to the Hon. Prime Minister and it has been pointed out in the Report that although the MCC proposal contains the  opportunities of securing the required financial resources for the investments by avoiding initial economic barriers of Sri Lanka suppressed under the lack of capital resources and pile of debt, without increasing the country's foreign debt burden, some of the projects proposed under the said programme included certain factors that may cause an adverse impact on national, social and economic well being of Sri Lanka. Similarly, It has been further pointed out that the proposed MCC Compact Agreement, Programme Implementation Agreement and the draft Articles of Association of MCA-Sri Lanka also included sections and provisions that may be inconsistent with the Constitution and the legal system of the Country and other conditions which may be detrimental to the national objectives, sovereignty and the national security. Therefore, the Committee has pointed out that appropriate corrections and proper amendments are required to be made for such adverse references and thereafter, to obtain the necessary public opinion and approval of Parliament for same. The Prime Minster has submitted the said Inception Report of the Committee containing the above concerns to the Cabinet for information and the matters, preliminary conclusions and recommendations therein  were noted by the Cabinet.",
  "key": "2020-02-27-024-44e6"
}