{
  "date_str": "2020-02-19",
  "decision_num": 19,
  "title": "UNHRC Resolution 30/1 'Promoting reconciliation, accountability and \thuman rights in Sri Lanka'",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10425",
  "decision_details": "- The proposal made by the Minister of Foreign Relations to take following action pertaining to the approach of the Government of Sri Lanka to the upcoming 43rd Session of  the Human Rights Council and to undertake  diplomatic initiatives necessary to realise this strategy, was approved by the Cabinet.\n\n*\tTo announce Sri Lanka's decision to withdraw from co sponsorship of Resolution 40/1 of March 2019 on 'Promoting reconciliation', accountability and human rights in Sri Lanka', which also incorporates and builds on preceding Resolutions 30/1of Octomber 2015 and 34/1 of March 2017.\n\n*\tTo continue to work with the UN and its agencies, including the regular human rights mandates/bodies and mechanisms and seek as required, capacity building and technical assistance, in keeping with domestic priorities and policies.\n\n*\tTo declare the Government's commitment to achieve sustainable peace through an inclusive, domestically designed and executed reconciliation and accountability process, through the appropriate adaptation of existing mechanisms, in line with the Government's policy framework.\n\nTo appoint a Commission of Inquiry (COI) headed by a Justice of the Supreme Court, to review the reports of previous Sri Lankan COIs which investigated alleged violations of Human Rights and International Humanitarian Law (IHL), to assess the status of implementation of their recommendations and to propose deliverable measures to implement them keeping in line with the new Government's policy.\n\n*\tThrough due democratic and legal processes, to address other outstanding concerns and to introduce institutional reforms where necessary, in a manner consistent with Sri Lanka's obligations including the 2030 Sustainable Development Agenda (SDGs).\n\n*\tTo demonstrate in good faith the policies rooted in the Government's commitment to the people by advancing individual and collective rights and protections under the law, ensuring justice and reconciliation and addressing the concerns of vulnerable sections of society.\n\n*\tTo announce the intention of the GoSL to work towards the closure of the Resolution, in cooperation with the members of the UN.",
  "key": "2020-02-19-019-9390"
}