{
  "date_str": "2020-02-05",
  "decision_num": 25,
  "title": "The programme for the placement of unemployed Graduates",
  "source_url": "https://www.cabinetoffice.gov.lk/cab/index.php?option=com_content&view=article&id=16&Itemid=49&lang=en&dID=10388",
  "decision_details": "- Despite the fact that arrangements had been put in place on several occasions in the past, for the placement of Graduates, it has been found that there are still a considerable number of vacancies in the Government Institutions Island wide. It is also observed that the people living in remote and rural areas are faced with immense difficulties when obtaining Public Services specially due to the dearth of Government Officers in such areas. \n\n\tAs such, action has been initiated to bring about a positive transformation in the methodologies presently adopted with a view to evolving a people-centric system of  delivery of Public Services beyond the limits of the administrative culture traditionally followed by mobilizing the skills and competencies of the younger generation with the contribution of nearly 50,000 passed out Graduates from the Universities since the year 2012 and unemployed up to date.\n\n\tAccordingly, the proposal made by H.E. the President to recruit unemployed Graduates and the youth who have obtained a Degree or have satisfied such educational qualifications equivalent to a Degree as at 2019‑12‑31 recognized by the University Grants Commission, to the following institutions, as Graduate Trainees subject to one (01) year training period enabling to provide them with an opportunity for transfers at District/Provincial Level after having served five (05) years continuously at the place of the first appointment, was approved by the Cabinet. \n\n*\tMinistry of Education \n\t\t\n\t(Inclusion of the subject 'leadership' in the school curriculum from Grade 6 to Grade 11 in all schools and teach the subject in every school and to fill the vacancies in the Rural and Estate Schools)\n\n*\tDepartment of Irrigation (Maintenance of Rural Irrigation)\n\n\n\n*\tDepartment of Agrarian Development (Rural Agricultural Development)\n\n*\tDepartment of Wildlife (Wildlife Conservation and Community Projects)\n\n*\tDepartment of Ayurveda (Indigenous Ayurveda Divisional Hospitals)\n\n*\tMinistry of Healthcare and Indigenous Medical Services (Rural Hospitals/Dispensaries) \n\n*\tDepartment of Surveyor General \n\n*\tDepartment of Agriculture (Divisional Agriculture Services and Technological Services) \n\n*\tDepartment of Export Agriculture (Minor Export Crop Projects)\n\n*\tDepartment of Animal Production and Health (Development of Animal Farms) \n\n*\tDepartment of Valuation\n\n*\tDepartment of Immigration and Emigration",
  "key": "2020-02-05-025-22af"
}